[
  {
    "id": "account-based-cbdc",
    "detailed": "An account-based CBDC is a type of central bank digital currency where each unit of money is tied to a specific person's identity, verified through an account held at or registered with the central bank (or an intermediary bank acting on its behalf). To spend your digital money, the system checks who you are -- much like how your bank verifies your identity before letting you transfer funds online. This contrasts with token-based CBDC, where the digital coin itself is what matters, not who holds it. Account-based designs make it easier to enforce regulations but reduce the anonymity that physical cash provides.",
    "example": "The European Central Bank could issue a digital euro where every citizen has a registered account. When you pay EUR 25 at a store, the system verifies your identity against your account before completing the transfer -- similar to how online banking works today."
  },
  {
    "id": "atomic-swap",
    "detailed": "An atomic swap is a technology that allows two different currencies or digital assets to be exchanged simultaneously, with a guarantee that either both transfers complete successfully or neither does. The word 'atomic' comes from the idea of an indivisible operation -- there is no moment where one party has sent their money but the other has not. This eliminates counterparty risk (the danger that the other person takes your payment but never sends theirs). Atomic swaps use cryptographic techniques called hash time-locked contracts that automatically reverse the transaction if both sides do not fulfill their obligations within a set time window.",
    "example": "If the Fed and the European Central Bank connect their CBDC systems, a US importer could swap USD 10,000 for EUR 9,200 in a single instant. If either side fails, both amounts automatically return to their original owners -- no trust required."
  },
  {
    "id": "bank-disintermediation",
    "detailed": "Bank disintermediation is the risk that if a central bank issues digital currency directly to citizens, people might move their savings out of commercial banks (ordinary banks like Chase or Deutsche Bank) and into CBDC instead. This matters because commercial banks use customer deposits to fund loans to businesses and homebuyers. If deposits shrink significantly, banks have less money to lend, which could slow economic growth. This is one of the biggest concerns central banks face when designing CBDCs, and many proposed designs include holding limits or lower interest rates on CBDC to discourage large-scale deposit migration.",
    "example": "If the ECB launches a digital euro and 100 million Europeans each move EUR 3,000 from their bank accounts into CBDC, that is EUR 300 billion less that banks can use to fund mortgages, small business loans, and other lending."
  },
  {
    "id": "bank-reserves",
    "detailed": "Bank reserves are the funds that commercial banks (the ordinary banks where people hold accounts) keep deposited at the central bank. Think of it as a bank's own bank account. Banks are required to maintain a minimum level of reserves to ensure they can handle withdrawals and settle payments with other banks. When a central bank changes interest rates, it typically does so by adjusting the rate it pays on these reserves, which then ripples through the entire economy. Reserves are different from the cash in a bank's vault -- they exist as digital balances on the central bank's ledger and form the backbone of the interbank payment system.",
    "example": "Deutsche Bank holds a reserve account at the ECB. If a customer wires EUR 50,000 to someone at Commerzbank, Deutsche Bank's reserve balance drops by EUR 50,000 and Commerzbank's rises by the same amount -- the central bank's ledger is the ultimate record."
  },
  {
    "id": "cbdc",
    "detailed": "A Central Bank Digital Currency (CBDC) is digital money issued and guaranteed by a country's central bank -- the institution responsible for a nation's monetary system (like the European Central Bank or the US Federal Reserve). Unlike the money in your bank account, which is actually a promise from a commercial bank that could theoretically fail, CBDC is a direct claim on the central bank itself, making it as safe as physical cash. CBDCs can be designed for everyday use by the public (retail CBDC) or restricted to banks for large interbank transfers (wholesale CBDC). Over 130 countries are currently researching or piloting CBDC projects.",
    "example": "China's digital yuan (e-CNY) lets citizens pay at shops by scanning a QR code from a phone app. If you hold 500 e-CNY, the People's Bank of China itself guarantees that value -- even if the commercial bank that distributed the app goes bankrupt, your money is safe."
  },
  {
    "id": "credit-supply",
    "detailed": "Credit supply refers to the total volume of loans that banks are able and willing to offer to businesses and individuals. Banks create loans using their customers' deposits as a funding base -- when you deposit EUR 1,000, the bank can lend most of that to someone else. Credit supply matters for CBDC design because if people move large amounts of money from bank deposits into CBDC, banks lose their lending base and may have to reduce credit supply. Less lending means fewer mortgages, fewer business expansion loans, and potentially slower economic growth. Central banks must balance CBDC adoption against preserving the banking system's ability to fund the real economy.",
    "example": "A small bank has EUR 100 million in customer deposits and lends EUR 80 million of that as mortgages and business loans. If 30% of depositors move their savings to a digital euro, the bank's deposit base falls to EUR 70 million, and it may have to cut lending to EUR 56 million -- restricting credit for local businesses."
  },
  {
    "id": "flight-to-safety",
    "detailed": "Flight to safety describes the behavior where investors and savers rush to move their money from risky assets into safer ones during times of economic uncertainty or crisis. In the context of CBDCs, this creates a specific danger: because CBDC is guaranteed by the central bank (the safest institution in the financial system), people might rapidly withdraw deposits from commercial banks and convert them to CBDC at the first sign of banking trouble. This could trigger or accelerate a bank run (where too many people withdraw at once, causing the bank to collapse). CBDC designers must build in safeguards like holding limits to slow or prevent such panicked mass transfers.",
    "example": "During a financial crisis, if news breaks that a major bank might fail, depositors could instantly transfer their savings into digital euros with a few taps on their phone -- far faster than lining up at an ATM. A EUR 3,000 holding cap on CBDC would limit this rush."
  },
  {
    "id": "helicopter-money",
    "detailed": "Helicopter money is a monetary policy concept where the central bank distributes cash directly to every citizen, bypassing commercial banks and the normal lending process. The term comes from economist Milton Friedman's thought experiment of dropping money from a helicopter to stimulate spending. With physical cash, this is logistically impractical, but CBDC makes it technically possible -- a central bank could credit every citizen's CBDC wallet instantly. This approach could be used during severe economic downturns when traditional tools like lowering interest rates are no longer effective. The policy is controversial because it blurs the line between monetary policy (managed by central banks) and fiscal policy (managed by elected governments).",
    "example": "During a deep recession, the Fed could deposit USD 1,000 directly into every American's CBDC wallet overnight -- no checks to mail, no bank intermediaries needed. All 330 million adults would receive the stimulus simultaneously, potentially jumpstarting consumer spending within days."
  },
  {
    "id": "interbank-settlement",
    "detailed": "Interbank settlement is the process by which banks transfer money between each other to complete transactions initiated by their customers. When you send money to someone at a different bank, your bank does not physically hand cash to their bank. Instead, both banks adjust their reserve accounts at the central bank -- your bank's balance goes down and the recipient's bank's balance goes up. This settlement process is the plumbing of the financial system and currently happens through systems like TARGET2 in Europe or Fedwire in the US. Wholesale CBDCs could modernize this process by enabling faster, cheaper, and potentially 24/7 interbank settlement using digital currency technology.",
    "example": "When you transfer EUR 500 from your Deutsche Bank account to a friend at BNP Paribas, the two banks settle through the ECB's TARGET2 system: Deutsche Bank's reserve account is debited EUR 500 and BNP Paribas's is credited EUR 500. A wholesale CBDC could make this happen in seconds instead of hours."
  },
  {
    "id": "liability",
    "detailed": "In finance, a liability is a legal obligation to pay a certain amount. When applied to money, the concept explains who ultimately guarantees its value. If you hold physical cash, the central bank has a liability to you -- it owes you that value. If you hold money in a bank account, the commercial bank has a liability to you -- it promises to give you that amount on demand. CBDC is a direct liability of the central bank, which is important because central banks cannot go bankrupt in their own currency (they can always create more). Commercial banks, by contrast, can fail, which is why bank deposits above certain limits are not fully guaranteed.",
    "example": "If you hold EUR 5,000 in a bank account, your bank owes you that money -- but if the bank collapses, you depend on deposit insurance (guaranteed up to EUR 100,000 in the EU). If you hold EUR 5,000 in a digital euro CBDC, the ECB itself owes you that money, and the ECB cannot go bankrupt."
  },
  {
    "id": "monetary-policy",
    "detailed": "Monetary policy refers to the decisions a central bank makes about interest rates and the money supply in order to manage inflation (rising prices) and support economic growth. When the economy overheats with too much spending, the central bank raises interest rates to make borrowing more expensive, cooling demand. When the economy slumps, it lowers rates to encourage borrowing and spending. CBDC could give central banks a powerful new channel for monetary policy -- for example, paying interest directly on citizens' CBDC holdings or even applying negative interest rates (charging people to hold large balances) to encourage spending during downturns.",
    "example": "The ECB currently sets interest rates that affect banks, which then pass those rates on to customers. With a digital euro, the ECB could directly offer 0.5% interest on CBDC balances up to EUR 3,000, instantly incentivizing citizens to hold and spend digital euros -- bypassing banks entirely."
  },
  {
    "id": "monetary-sovereignty",
    "detailed": "Monetary sovereignty is a nation's ability to control its own currency, set its own interest rates, and manage its money supply independently. This power allows governments to respond to economic crises, control inflation, and finance public spending. Monetary sovereignty can be threatened when citizens adopt foreign currencies or private digital currencies (like stablecoins pegged to the US dollar) instead of the national currency. CBDCs are partly motivated by the desire to protect monetary sovereignty -- if a private company like Meta or a foreign government's digital currency becomes widely used domestically, the national central bank loses influence over its own economy.",
    "example": "If citizens in a small country like Uruguay start using a USD-pegged stablecoin for most daily transactions, the country's central bank can no longer effectively control inflation or stimulate the economy through interest rate changes. Launching a CBDC (digital Uruguayan peso) could help preserve that control."
  },
  {
    "id": "negative-interest-rates",
    "detailed": "Negative interest rates are a policy where, instead of earning interest on your savings, you pay a fee for keeping money deposited. Central banks sometimes use this unconventional tool during severe economic downturns to discourage hoarding and encourage people to spend or invest. With physical cash, negative rates are hard to enforce because people can simply withdraw banknotes and store them. CBDC changes this equation: if money is purely digital, a central bank could programmatically apply a negative rate to CBDC holdings, making it costly to hoard digital cash. This is both a powerful policy tool and a politically sensitive concern that worries citizens about government overreach.",
    "example": "The ECB could set a -0.5% annual rate on digital euro balances above EUR 3,000. If you hold EUR 10,000 in CBDC, you would lose EUR 35 per year on the excess (0.5% of the EUR 7,000 above the threshold), nudging you to spend or invest rather than sit on idle savings."
  },
  {
    "id": "retail-cbdc",
    "detailed": "A retail CBDC is a central bank digital currency designed for use by the general public -- ordinary people and businesses -- for everyday payments like buying groceries, paying rent, or transferring money to friends. This is distinct from wholesale CBDC, which is only available to banks and financial institutions. Retail CBDC would function as a digital equivalent of physical cash, accessible through smartphone apps or payment cards. Central banks designing retail CBDCs must balance competing goals: making payments convenient and inclusive, maintaining user privacy, preventing money laundering, and avoiding damage to the commercial banking system through deposit outflows.",
    "example": "The Bahamas launched the Sand Dollar, a retail CBDC available to all residents. A fisherman on a remote island can receive payment by holding his phone near the buyer's -- no bank account, internet connection, or credit card needed. Nigeria's eNaira is another live retail CBDC used for everyday purchases."
  },
  {
    "id": "spillovers",
    "detailed": "Spillovers occur when one country's policy decisions unintentionally affect other countries. In the CBDC context, if a major economy launches a digital currency, it could have ripple effects worldwide. For example, if the US Federal Reserve issues a digital dollar that anyone globally can hold, people in developing countries might prefer it over their own national currency, weakening those countries' monetary sovereignty. Cross-border spillovers can also include capital flow disruptions (money moving rapidly between countries), exchange rate volatility (unpredictable changes in currency values), and challenges for smaller economies that cannot compete with the technological infrastructure of larger nations.",
    "example": "If the Fed launches a digital dollar and citizens in Argentina can easily hold it on their phones, many might abandon the Argentine peso (which has suffered high inflation). This capital flight would weaken the peso further and undermine Argentina's central bank -- a classic negative spillover."
  },
  {
    "id": "tiered-remuneration",
    "detailed": "Tiered remuneration is a CBDC design feature where different interest rates apply to different amounts of holdings. The idea is to make CBDC attractive for everyday payments (by offering a competitive or zero rate on small balances) while discouraging people from treating it as a savings vehicle that could drain commercial bank deposits (by offering unattractive or negative rates on large balances). This graduated structure creates a built-in safeguard against bank disintermediation and flight-to-safety risks. Most major CBDC proposals, including the digital euro, incorporate some form of tiered remuneration as a core design element.",
    "example": "The ECB's digital euro proposal suggests 0% interest on the first EUR 3,000 held per person, then a penalty rate (say -2%) on any amount above that. A person holding EUR 3,000 pays nothing, but holding EUR 10,000 would cost EUR 140 per year on the excess -- strongly discouraging large CBDC hoarding."
  },
  {
    "id": "token-based-cbdc",
    "detailed": "A token-based CBDC is a type of central bank digital currency where the digital coin itself proves its authenticity, rather than relying on verifying the holder's identity. This works similarly to physical cash: a EUR 20 banknote is valid regardless of who holds it, because the note itself contains security features that prove it is genuine. Token-based CBDCs can enable offline transactions (payments without internet) and greater privacy, since the system validates the money rather than the person. However, this design makes anti-money-laundering enforcement more difficult because transactions can potentially occur anonymously.",
    "example": "Imagine paying for coffee by tapping your phone even when neither device has internet. Your phone transfers a cryptographically signed digital token to the shop's device, which can verify the token is genuine without contacting any server -- just like handing over a physical EUR 5 coin."
  },
  {
    "id": "trade-finance",
    "detailed": "Trade finance refers to the loans, guarantees, and insurance products that help companies buy and sell goods across international borders. When a factory in Germany ships machinery to Brazil, the buyer and seller face risks: the buyer worries about paying before receiving the goods, and the seller worries about shipping before getting paid. Banks bridge this gap by providing letters of credit (guarantees of payment) and short-term loans. CBDC could transform trade finance by enabling instant cross-border settlement through atomic swaps, reducing the time goods spend in transit limbo, and lowering the costs that banks charge for intermediation -- currently a multi-trillion-dollar global market.",
    "example": "A German exporter ships EUR 500,000 in equipment to Brazil. Today, the process involves 3-4 banks, stacks of paperwork, and 5-10 days for payment to clear. With interconnected CBDCs, the digital euro and digital real could be swapped atomically at the moment of delivery confirmation, settling in seconds."
  },
  {
    "id": "wholesale-cbdc",
    "detailed": "A wholesale CBDC is a central bank digital currency restricted to financial institutions -- primarily commercial banks -- for use in large-value interbank settlements and securities transactions. Unlike retail CBDC (which ordinary people use), wholesale CBDC is not available to the general public. It upgrades the existing system where banks settle payments through reserve accounts at the central bank, potentially enabling faster settlement, 24/7 operations, and programmable money (automated transactions triggered by conditions). Wholesale CBDC is considered less disruptive than retail CBDC because it improves existing infrastructure rather than creating a new relationship between citizens and the central bank.",
    "example": "In Project Helvetia, the Swiss National Bank tested a wholesale CBDC on a blockchain platform. Banks could settle securities trades worth millions of Swiss francs in seconds rather than the current two-day cycle, while the central bank maintained full oversight of the process."
  },
  {
    "id": "wholesale-funding",
    "detailed": "Wholesale funding is money that banks borrow from other financial institutions -- such as other banks, pension funds, or money market funds -- rather than from ordinary customer deposits. Banks use wholesale funding to fill gaps when customer deposits alone are not enough to cover their lending activities. This type of funding is typically short-term and must be regularly renewed (rolled over). Wholesale funding is relevant to CBDC because if customer deposits migrate to CBDC, banks would need to rely more heavily on wholesale funding, which is generally more expensive and less stable than deposits. During financial crises, wholesale funding can dry up suddenly as institutional lenders become risk-averse.",
    "example": "A bank has EUR 80 billion in customer deposits and EUR 20 billion in wholesale funding from other banks to support EUR 90 billion in loans. If CBDC adoption causes EUR 15 billion in deposits to leave, the bank must replace that with more wholesale funding -- which might cost 1-2% more in interest and can vanish during a crisis."
  },
  {
    "id": "zero-knowledge-proofs",
    "detailed": "Zero-knowledge proofs are a cryptographic technique (a method using mathematical codes) that allows one person to prove a fact to another without revealing the underlying data. The concept is like proving you know a secret password without ever saying the password out loud. In CBDC design, zero-knowledge proofs could let the system verify that a transaction is legitimate -- for example, that the sender has enough funds and is not on a sanctions list -- without revealing the sender's identity or account balance to anyone. This technology offers a potential solution to the tension between user privacy and regulatory compliance that is central to CBDC policy debates.",
    "example": "When paying with a digital euro, a zero-knowledge proof could let the system verify you are over 18 and not on a terrorist watchlist without revealing your name, age, or address to the merchant or anyone else in the transaction chain. You prove compliance without sacrificing privacy."
  }
]
