[
  {
    "id": "amm",
    "detailed": "An Automated Market Maker (AMM) is a smart contract (self-executing computer program on a blockchain) that acts like a robot market maker, always ready to buy or sell tokens. Instead of matching buyer and seller orders like a traditional exchange, it uses a mathematical formula to set prices automatically. The most common formula is the constant product formula (x times y equals k), where x and y represent the quantities of two different tokens in a pool. When someone buys token X, the pool has less X and more Y, so the formula automatically makes X more expensive. This means prices adjust automatically based on supply and demand without needing a human market maker.",
    "example": "Uniswap uses AMMs: if a pool has 100 ETH and 200,000 USDC (k = 20 million), and you buy 10 ETH, you pay roughly 22,000 USDC because the formula maintains k constant, making each additional ETH progressively more expensive."
  },
  {
    "id": "arbitrage",
    "detailed": "Arbitrage means buying an asset in one place where it is cheap and simultaneously selling it in another place where it is more expensive, capturing the price difference as risk-free profit. Arbitrageurs act like economic bloodhounds who sniff out price differences and eliminate them by trading. This process is essential for keeping markets efficient because it forces prices to converge across different venues. In crypto and stablecoin markets, arbitrage is especially important: if USDC trades for 0.99 USD on one exchange and 1.01 USD on another, arbitrageurs buy at 0.99, sell at 1.01, and pocket 2 cents per coin while pulling the prices back together.",
    "example": "If 1 BTC costs 50,000 USD on Binance but 50,200 USD on Coinbase, an arbitrageur buys on Binance and sells on Coinbase for 200 USD profit (minus fees), which forces prices to equalize."
  },
  {
    "id": "bid-ask-spread",
    "detailed": "The bid-ask spread is the gap between the highest price someone is willing to pay to buy an asset (the bid) and the lowest price someone is willing to accept to sell it (the ask). Think of it as the hidden cost of trading: if you want to buy immediately, you pay the ask price, which is higher than the bid. If you want to sell immediately, you receive the bid price, which is lower than the ask. A narrow spread (say 100.00 bid and 100.02 ask) means the market is liquid with many buyers and sellers. A wide spread (say 100.00 bid and 101.00 ask) means the market is illiquid, and you pay a steep hidden fee for instant execution.",
    "example": "On NYSE, Apple stock might have a bid of 150.00 USD and ask of 150.01 USD (1 cent spread). On a small crypto exchange, an obscure token might have a bid of 5.00 USD and ask of 5.50 USD (50 cent spread), costing you 10% just to trade."
  },
  {
    "id": "block-time",
    "detailed": "Block time is the average duration between the creation of consecutive blocks on a blockchain. A block is like a page in a digital ledger that records a batch of transactions. Bitcoin creates a new block roughly every 10 minutes, while Ethereum produces one roughly every 12 seconds. Block time matters enormously for trading because during that interval, traders can see pending transactions in the mempool (waiting area) and can strategically insert, reorder, or front-run them to extract profit. This window of opportunity is the foundation for Maximal Extractable Value (MEV): the longer the block time, the more time traders have to analyze and exploit pending transactions before they are finalized.",
    "example": "On Ethereum (12-second blocks), a bot can see your pending 10 ETH buy order, quickly submit its own buy order with a higher gas fee to execute first, then sell to you at a higher price, all within one block."
  },
  {
    "id": "clob",
    "detailed": "A Central Limit Order Book (CLOB) is the traditional order-matching system used by stock exchanges like NYSE or NASDAQ, where all buy orders (bids) and sell orders (asks) are collected in one place and displayed publicly. Orders are matched according to strict rules: best price wins (highest bid gets matched with lowest ask), and if two orders have the same price, the earlier one (time priority) goes first. This creates a transparent system where you can see all pending orders at every price level. The \"limit\" in CLOB refers to limit orders: instructions to buy or sell at a specified price or better, which sit in the book until matched.",
    "example": "On Binance's BTC/USDT CLOB, you might see bids at 50,000 (for 2 BTC), 49,999 (for 5 BTC), 49,998 (for 1 BTC) and asks at 50,001 (for 3 BTC), 50,002 (for 4 BTC). If you place a market buy for 4 BTC, you get 3 at 50,001 and 1 at 50,002."
  },
  {
    "id": "constant-product-formula",
    "detailed": "The constant product formula is the mathematical rule x times y equals k that Automated Market Makers (AMMs) use to set prices automatically. Here, x and y represent the quantities of two different tokens in a liquidity pool, and k is a constant number that never changes. When you swap tokens, you add one token (increasing its quantity) and remove the other (decreasing its quantity), but the product must stay equal to k. This creates a beautiful property: as you buy more of one token, it becomes progressively more expensive because the formula forces the price to rise as the pool balance becomes more lopsided. The formula eliminates the need for a traditional order book and ensures liquidity is always available at some price.",
    "example": "A pool with 100 ETH and 200,000 USDC has k = 20,000,000. If you buy 10 ETH, the pool has 90 ETH left, so it needs 222,222 USDC to maintain k (90 times 222,222 equals 20,000,000). You must deposit 22,222 USDC to extract 10 ETH, paying roughly 2,222 per ETH."
  },
  {
    "id": "front-running",
    "detailed": "Front-running is the practice of seeing someone else's pending trade and racing to execute your own trade first to profit from the price movement you know is coming. Imagine you are standing in line at a store, and someone behind you overhears you asking for the last discounted item. They sprint ahead, buy it first, and immediately resell it to you at a higher price. In traditional markets, this is often illegal because brokers have a duty to execute client orders first. In blockchain markets, front-running happens because all pending transactions sit in a public mempool before being included in a block, and anyone with faster technology or higher gas fees can jump ahead of you in line.",
    "example": "You submit a buy order for 100 ETH on Uniswap. A bot detects your pending transaction, submits its own buy for 50 ETH with a higher gas fee (executing first), which pushes the price up, then your order executes at the now-higher price, and the bot profits."
  },
  {
    "id": "gas-fees",
    "detailed": "Gas fees are payments you make to validators (computers that process transactions) on a blockchain network like Ethereum to compensate them for the computational work of executing your transaction. Think of gas as the fuel that powers the blockchain: more complex transactions (like swapping tokens on Uniswap) require more computational steps and thus more gas. Gas fees are measured in two parts: the base fee (which is burned, meaning destroyed permanently) and the priority fee (a tip you pay to validators to process your transaction faster). When the network is congested, gas fees skyrocket because users compete by offering higher priority fees to get their transactions included in the next block.",
    "example": "A simple ETH transfer might cost 2 USD in gas fees during normal times, but swapping tokens on Uniswap could cost 50 USD, and during a market crash when everyone is panic-selling, gas fees can spike to 500 USD per transaction."
  },
  {
    "id": "impermanent-loss",
    "detailed": "Impermanent loss is the hidden cost liquidity providers (LPs) pay when they deposit tokens into an AMM liquidity pool. It occurs when the price ratio of the two tokens changes compared to when you deposited them. Because the AMM rebalances your holdings using the constant product formula, you end up with more of the token that fell in price and less of the token that rose in price, compared to if you had simply held both tokens in your wallet. It is called \"impermanent\" because if prices return to the original ratio, the loss disappears. But if you withdraw while prices are different, the loss becomes permanent. LPs accept this risk in exchange for earning trading fees from the pool.",
    "example": "You deposit 1 ETH and 2,000 USDC when ETH = 2,000 USD. ETH doubles to 4,000 USD. The AMM rebalances to 0.707 ETH and 2,828 USDC (worth 5,656 USD total). But holding would give you 1 ETH and 2,000 USDC (worth 6,000 USD). You lost 344 USD to impermanent loss."
  },
  {
    "id": "liquidity-provider",
    "detailed": "A Liquidity Provider (LP) is someone who deposits pairs of tokens into an AMM pool to enable trading. Think of LPs as the people who stock the shelves of a robot-run store: they provide inventory (token pairs like ETH and USDC) so that traders can come and swap tokens anytime. In return, LPs earn a share of the trading fees charged on every swap (typically 0.3% per trade on Uniswap). Being an LP is risky because you face impermanent loss if token prices diverge, and you also take on smart contract risk (the possibility that a bug in the code could drain the pool). LPs are essential to DeFi because without them, AMMs would have no liquidity and trading would be impossible.",
    "example": "Alice deposits 10 ETH and 20,000 USDC into a Uniswap pool, receiving LP tokens representing her 5% share. She earns 5% of all trading fees (0.3% per swap), but faces impermanent loss if ETH price changes significantly relative to USDC."
  },
  {
    "id": "market-microstructure",
    "detailed": "Market microstructure is the study of how trading actually works at the nuts-and-bolts level: how buy and sell orders are matched, how prices are formed, how liquidity is provided, and how the mechanics of the market affect outcomes like price efficiency and trader welfare. It zooms in on the plumbing of financial markets rather than big-picture questions like asset valuation. For example, microstructure economists care whether continuous trading or periodic auctions lead to better price discovery, whether payment for order flow harms retail investors, or how high-frequency traders affect market quality. In crypto, microstructure includes understanding AMM vs order book designs, MEV extraction, and how blockchain block times create unique trading dynamics.",
    "example": "A microstructure question: Does Uniswap's AMM (where prices adjust along a curve) or Binance's order book (where traders post bids and asks) lead to better prices for a 10,000 USD trade? Studies compare execution costs, price impact, and speed."
  },
  {
    "id": "mev",
    "detailed": "Maximal Extractable Value (MEV) is the profit that miners or validators can earn by strategically reordering, inserting, or censoring transactions within a blockchain block they are assembling. Think of validators as DJs who can rearrange the playlist of pending transactions before broadcasting them to the network. By seeing pending trades in the mempool, sophisticated bots can identify profitable opportunities like sandwich attacks (trading right before and after someone else to profit from the price movement they cause), arbitrage between decentralized exchanges, or liquidations of undercollateralized loans. MEV is controversial because it represents value extracted from ordinary users, often without their consent or knowledge, though it also serves efficiency purposes like liquidating risky loans quickly.",
    "example": "A validator sees your pending order to buy 100 ETH on Uniswap for 200,000 USDC. They insert their own bot's buy order before yours (front-run), pushing the price up, then insert a sell order after yours (back-run), capturing 5,000 USDC profit at your expense."
  },
  {
    "id": "order-book",
    "detailed": "An order book is a list showing all the buy orders (bids) and sell orders (asks) waiting to be executed at different price levels in a market. Imagine a two-column table: the left column shows prices at which people want to buy (sorted highest to lowest) and the quantity they want, while the right column shows prices at which people want to sell (sorted lowest to highest) and their quantities. The top of the buy column is the best bid (highest price someone will pay) and the top of the sell column is the best ask (lowest price someone will accept). The gap between them is the bid-ask spread. Order books provide transparency: you can see the market depth at every price level and estimate how much your trade will move the price.",
    "example": "Bitcoin order book on Coinbase might show: Bids: 50,000 USD (2 BTC), 49,999 (5 BTC), 49,998 (3 BTC) | Asks: 50,001 (4 BTC), 50,002 (6 BTC), 50,003 (2 BTC). Best bid is 50,000, best ask is 50,001, spread is 1 USD."
  },
  {
    "id": "order-book-depth",
    "detailed": "Order book depth refers to the volume of buy and sell orders available at each price level near the current market price. A deep order book has large quantities of orders stacked at many price levels, which means the market can absorb big trades without the price moving much (low price impact). A shallow order book has small quantities at few price levels, so even a modest trade can cause the price to jump or drop significantly. Depth is a key measure of market liquidity: deep markets are more stable and cheaper to trade in, while shallow markets are volatile and expensive because your trade moves the price against you. Traders inspect order book depth before executing large orders to estimate their price impact.",
    "example": "Binance BTC/USDT has 500 BTC of bids stacked within 1% below the market price (deep book): a 50 BTC sell barely moves the price. A small altcoin exchange has only 10 BTC of bids within 1% (shallow): a 50 BTC sell crashes the price by 5%."
  },
  {
    "id": "price-discovery",
    "detailed": "Price discovery is the process by which markets aggregate information from all participants to determine the fair value of an asset. It happens through continuous trading: buyers and sellers submit bids and asks based on their private information (news they have read, analysis they have done, or beliefs they hold), and the market price converges to a level that reflects the collective wisdom of all participants. Good price discovery means the market price accurately reflects all available information quickly. Poor price discovery means prices are stale, inaccurate, or lag behind news. Factors affecting price discovery include market fragmentation (trading happening across many venues), information asymmetries (some traders know more than others), and trading frictions (fees, delays, or restrictions).",
    "example": "When Elon Musk tweets about Bitcoin, traders on hundreds of exchanges simultaneously buy, pushing the price up within seconds. Prices on liquid exchanges like Binance adjust first, then smaller exchanges follow via arbitrage, completing global price discovery within minutes."
  },
  {
    "id": "price-impact",
    "detailed": "Price impact is the change in the market price caused by your own trade. When you place a large buy order, you consume all the sell orders at the best ask price, then the next best, then the next, walking up the order book and pushing the price higher. Similarly, a large sell order walks down the buy side, pushing the price lower. Price impact is a hidden cost of trading large quantities: the average price you pay is worse than the market price when you started. It depends on market liquidity: in deep, liquid markets like major stock exchanges, even million-dollar trades have minimal price impact. In shallow, illiquid markets like small-cap crypto tokens, even thousand-dollar trades can move the price by several percent.",
    "example": "You want to buy 100 ETH on a DEX. The first 10 ETH cost 2,000 USDC each, the next 20 cost 2,010 each, the next 30 cost 2,025 each, and the final 40 cost 2,050 each. Your average price is 2,028 per ETH due to price impact, costing you 2,800 USDC more than if there were no impact."
  },
  {
    "id": "sandwich-attack",
    "detailed": "A sandwich attack is a specific MEV exploitation technique where a bot detects your pending trade, executes a buy order right before yours (front-run) to push the price up, waits for your order to execute at the now-higher price, then immediately sells (back-run) at a profit. Your trade is \"sandwiched\" between the bot's buy and sell orders. This is possible because on blockchains like Ethereum, all pending transactions are visible in the mempool before being confirmed, and bots can pay higher gas fees to ensure their orders are processed first. Sandwich attacks harm ordinary traders by increasing the price they pay (or decreasing the price they receive) while enriching the attacker. They are endemic in DeFi because of blockchain transparency and priority gas auctions.",
    "example": "You submit a Uniswap order to buy 10 ETH for 20,000 USDC. Bot sees it, buys 5 ETH first for 9,800 USDC (pushing price up), your order executes for 20,200 LIQUIDITY, bot sells 5 ETH for 10,100 USDC, netting 300 USDC profit at your expense."
  },
  {
    "id": "slippage",
    "detailed": "Slippage is the difference between the price you expected to get when you submitted your trade and the actual price you received when it executed. It happens because markets are constantly moving: by the time your order reaches the exchange and gets matched, other traders may have bought or sold, changing the best available price. Slippage is especially severe in fast-moving markets (like during news announcements or crashes) and in illiquid markets (where there are not many orders available at each price level). On AMMs, slippage happens because your trade itself changes the price via the constant product formula. Traders can set slippage tolerance limits: if slippage exceeds the limit, the trade is canceled.",
    "example": "You place a market buy for 1,000 USDC worth of a small altcoin, expecting a price of 0.50 USD per token (2,000 tokens). By the time it executes 2 seconds later, the price is 0.53 USD, and you only get 1,887 tokens. You suffered 6% slippage."
  },
  {
    "id": "tvl",
    "detailed": "Total Value Locked (TVL) is the total dollar value of all assets deposited into a DeFi protocol or set of protocols. It is calculated by adding up the value of every token locked in smart contracts for purposes like providing liquidity to AMMs, collateralizing loans, or staking for yield. TVL serves as a rough measure of a protocol's popularity, user trust, and economic significance: higher TVL means more users are willing to entrust their funds to the protocol. However, TVL can be misleading because it can be inflated by counting the same assets multiple times (if assets are rehypothecated across protocols) or by not accounting for whether deposits are real user funds or just mercenary capital chasing high yields.",
    "example": "Uniswap has 4 billion USD TVL across all its liquidity pools, meaning users have deposited that much value in ETH, USDC, and other tokens to enable decentralized trading. Aave has 6 billion USD TVL, representing collateral deposited for lending and borrowing."
  }
]
