[
  {
    "id": "algorithmic-stablecoin",
    "detailed": "An algorithmic stablecoin is a cryptocurrency designed to maintain a stable value (usually pegged to 1 USD or 1 EUR) without holding full collateral (assets backing each coin) in reserve. Instead, it uses computer algorithms (sets of rules) to automatically adjust the supply of coins in response to market demand. When the price rises above the target, the algorithm creates new coins to increase supply and push the price down. When the price falls below the target, the algorithm removes coins from circulation to decrease supply and push the price up. This approach relies on market participants (traders) believing the system will work and acting accordingly. The danger is that if confidence collapses, the algorithm cannot restore the peg, leading to a death spiral (self-reinforcing collapse).",
    "example": "TerraUSD (UST) was an algorithmic stablecoin that maintained its 1 USD peg by allowing users to swap 1 UST for 1 USD worth of LUNA tokens. When confidence evaporated in May 2022, the peg broke, UST fell to 0.10 USD, and the entire 40 billion USD ecosystem collapsed within days."
  },
  {
    "id": "barter",
    "detailed": "Barter is the direct exchange of goods or services without using money as an intermediary. For barter to work, you need a double coincidence of wants, meaning both parties must have what the other wants and want what the other has at the exact same time. This makes barter extremely inefficient compared to using money. If you grow apples and need shoes, you must find a shoemaker who wants apples right now and has shoes available. Money solves this problem by acting as a medium of exchange (universally accepted payment) that separates buying from selling in time and space.",
    "example": "A farmer with extra wheat wants a new axe. Without money, they must find a blacksmith who both makes axes and currently needs wheat. If the blacksmith already has enough wheat, no trade happens even though both parties need something. With money, the farmer sells wheat to anyone for cash, then buys the axe whenever convenient."
  },
  {
    "id": "collateral",
    "detailed": "Collateral is an asset (something of value like real estate, stocks, or cryptocurrency) that a borrower pledges to a lender as security for a loan. If the borrower fails to repay the loan, the lender can seize and sell the collateral to recover their money. In stablecoin systems, collateral backs the coins to maintain their value. For example, a fiat-backed stablecoin holds 1 USD in a bank account for every 1 stablecoin issued. In decentralized finance (DeFi), collateral is often over-collateralized, meaning borrowers must pledge assets worth more than the loan amount to protect against price volatility (rapid price changes). If collateral value drops below a certain threshold (minimum level), it gets automatically liquidated (sold off).",
    "example": "MakerDAO's DAI stablecoin requires users to deposit 150 USD worth of Ethereum to borrow 100 DAI. If Ethereum's price drops and your collateral falls below 150%, the system automatically sells your Ethereum to repay the loan, protecting the system but potentially costing you money."
  },
  {
    "id": "death-spiral",
    "detailed": "A death spiral is a self-reinforcing collapse where falling prices trigger more selling, which causes prices to fall further, creating a vicious cycle that accelerates until the asset becomes worthless. In algorithmic stablecoins, a death spiral occurs when the peg (target price) breaks and holders lose confidence in the system's ability to restore it. As people rush to sell, the algorithm creates new tokens to buy back the stablecoin and restore the peg, but this floods the market with tokens, driving their price down and making the problem worse. Each wave of selling increases panic, causing more selling, until confidence is completely destroyed and the system collapses.",
    "example": "In May 2022, TerraUSD lost its 1 USD peg and fell to 0.90 USD. Panicked holders sold, triggering the algorithm to mint billions of LUNA tokens to buy UST and restore the peg. This crashed LUNA from 80 USD to 0.0001 USD in 72 hours, destroying 40 billion USD in value as both UST and LUNA became worthless."
  },
  {
    "id": "deflationary",
    "detailed": "Deflationary describes a currency where prices of goods and services fall over time, meaning each unit of the currency becomes more valuable and can buy more things as time passes. This typically happens with fixed-supply currencies (where no new money is created) because as the economy grows and produces more goods, the same amount of money chases more goods, making each unit more valuable. While this sounds good for holders, deflation can harm economic activity because people delay purchases expecting lower prices later, reducing spending and investment. Bitcoin is designed to be deflationary because its supply is capped at 21 million coins, so as adoption grows, each Bitcoin should theoretically become more valuable over time.",
    "example": "If Bitcoin were the global currency and a car costs 1 BTC today, in 10 years that same car might cost only 0.5 BTC because Bitcoin's value increased while car production stayed the same. Knowing this, people delay buying cars, which hurts car manufacturers and the economy."
  },
  {
    "id": "dollarization",
    "detailed": "Dollarization occurs when a country officially or unofficially adopts a foreign currency (usually the US dollar but could be the euro or any stable foreign currency) instead of using its own national currency for everyday transactions, saving, and pricing goods. This typically happens when a country's own currency suffers from high inflation (rapid loss of value), hyperinflation (extreme inflation where prices double monthly or faster), or economic instability that destroys confidence in the local currency. By adopting a stable foreign currency, countries gain price stability and reduce transaction costs (costs of exchanging money), but they lose monetary sovereignty (the ability to control their own money supply and interest rates) and cannot use monetary policy (central bank tools like printing money) to respond to economic crises.",
    "example": "Ecuador officially dollarized in 2000 after inflation reached 96%, replacing the sucre with the US dollar. Prices stabilized immediately, but when the 2008 financial crisis hit, Ecuador could not print money or lower interest rates to stimulate the economy because those decisions are made by the US Federal Reserve."
  },
  {
    "id": "fiat-backed-stablecoin",
    "detailed": "A fiat-backed stablecoin is a cryptocurrency that maintains stable value by holding traditional fiat money (government-issued currency like USD or EUR) in reserve accounts at banks on a 1:1 basis. For every stablecoin issued, the issuer holds 1 USD (or 1 EUR) in a bank account or short-term government securities (low-risk investments like Treasury bills). Users can redeem their stablecoins for the underlying fiat currency at any time, which maintains the peg (target exchange rate). This model depends on trust that the issuer actually holds the reserves and will honor redemptions. Regular audits (independent financial examinations) provide transparency about reserve holdings.",
    "example": "Tether (USDT) claims to hold 1 USD in reserves for each USDT issued, making 1 USDT always worth approximately 1 USD. If you hold 100 USDT, you can theoretically redeem it for 100 USD from Tether. This allows cryptocurrency users to avoid volatility without converting to traditional bank accounts."
  },
  {
    "id": "greshams-law",
    "detailed": "Gresham's Law states that when two forms of money are in circulation and one is perceived as more valuable (undervalued by official exchange rates) while the other is less valuable (overvalued), people will hoard the good money and spend the bad money, causing bad money to drive out good money from circulation. This happens because rational people keep assets they expect to appreciate (increase in value) and get rid of assets they expect to depreciate (decrease in value). The law applies when governments set fixed exchange rates that do not reflect market values, creating an incentive to game the system.",
    "example": "In the 1960s, US silver quarters had official face value of 0.25 USD but contained silver worth 0.40 USD due to rising silver prices. People hoarded the silver quarters and spent paper dollars instead. By 1965, silver quarters disappeared from circulation, and the US switched to cheaper copper-nickel coins."
  },
  {
    "id": "inflation-tax",
    "detailed": "The inflation tax is an implicit (hidden) tax that governments impose on holders of cash and savings when they print money or increase the money supply faster than economic growth. When new money is created without corresponding growth in goods and services, each existing unit of money becomes less valuable, meaning prices rise and your savings buy less than before. This is called a tax because it transfers purchasing power (the ability to buy things) from citizens to the government without explicitly collecting taxes. Governments resort to the inflation tax when they cannot or will not raise regular taxes or borrow money to finance spending. It disproportionately hurts poor people who hold cash and have fewer options to protect their wealth through investments.",
    "example": "Venezuela's government printed massive amounts of bolivars to pay for spending without raising taxes. Between 2016 and 2019, inflation exceeded 1,000,000%, meaning savings of 1 million bolivars became worth 1 bolivar in purchasing power. Citizens lost nearly all their wealth while the government gained resources by printing money."
  },
  {
    "id": "liquidation",
    "detailed": "Liquidation is the automatic forced sale of a borrower's collateral (assets pledged as security) when its value falls below a required minimum threshold relative to the loan amount. This mechanism protects lenders from losses due to volatility (rapid price changes) in collateral values. In decentralized finance (DeFi) systems, liquidation happens automatically through smart contracts (self-executing code) without human intervention. When collateral value drops to the liquidation threshold (typically 120-150% of loan value), a liquidation bot (automated program) buys the collateral at a discount and repays the loan, keeping the difference as profit. Liquidation penalties (fees charged to borrowers) provide incentives for liquidators to act quickly and for borrowers to maintain healthy collateral ratios.",
    "example": "You deposit 10,000 USD worth of Ethereum to borrow 6,667 USD in DAI stablecoin (150% collateralization ratio). If Ethereum crashes and your collateral falls to 8,000 USD, your collateralization drops to 120%, triggering automatic liquidation. The system sells your Ethereum for 8,000 USD, repays your 6,667 USD loan, charges a 13% penalty (867 USD), leaving you with 466 USD instead of your original 10,000 USD."
  },
  {
    "id": "medium-of-exchange",
    "detailed": "A medium of exchange is anything widely accepted as payment for goods and services, allowing indirect exchange instead of barter (direct goods-for-goods exchange). Money serves as a medium of exchange by solving the double coincidence of wants problem, where both trading parties must simultaneously want what the other offers. A good medium of exchange must be widely accepted, easily divisible (can be broken into smaller units), portable (easy to carry), durable (does not deteriorate), and recognizable (easy to verify authenticity). When a currency fails as a medium of exchange due to hyperinflation (extreme inflation) or lack of acceptance, economic activity suffers because people revert to inefficient barter or alternative currencies.",
    "example": "In Venezuela during hyperinflation (2016-2019), the bolivar failed as a medium of exchange because its value changed hourly and vendors refused to accept it. People switched to US dollars, Colombian pesos, or Bitcoin for transactions, while bolivars were only used when no alternative existed."
  },
  {
    "id": "money-multiplier",
    "detailed": "The money multiplier describes how banks create money through fractional reserve banking, amplifying central bank money (base money or reserves) into a much larger money supply through repeated lending. When a central bank creates 100 EUR in reserves and banks are required to hold 10% reserves (reserve requirement ratio), banks can lend 90 EUR of every 100 EUR deposited. That 90 EUR gets deposited elsewhere and re-lent, creating a multiplicative effect. The money multiplier equals 1 divided by the reserve requirement ratio, so with 10% reserves, the multiplier is 10, meaning 100 EUR of reserves supports 1,000 EUR in total money supply. This mechanism gives central banks powerful leverage over the economy but also creates systemic fragility because money exists mostly as loan obligations, not physical currency.",
    "example": "The European Central Bank creates 1 billion EUR in reserves. With a 2% reserve requirement, banks can lend 980 million EUR. Those borrowers deposit the money, which gets re-lent at 98%, creating deposits of 960 million EUR. This process repeats until the original 1 billion EUR supports approximately 50 billion EUR in total money supply (multiplier of 50)."
  },
  {
    "id": "opportunity-cost",
    "detailed": "Opportunity cost is the value of the next best alternative you give up when making a choice. Every decision involves trade-offs because resources (time, money, attention) are limited. When you choose option A, the opportunity cost is the benefit you would have received from option B, the best alternative you did not choose. In monetary contexts, holding cash has an opportunity cost equal to the interest or returns you could earn by investing that money elsewhere. Opportunity cost is crucial for understanding economic decisions because the true cost of any action includes both direct costs (money spent) and the value of forgone alternatives.",
    "example": "You have 10,000 EUR and can either hold it as cash earning 0% or invest in government bonds earning 3% annually. If you hold cash, the opportunity cost is 300 EUR per year in forgone interest. If inflation is 2%, your real opportunity cost is even higher because cash loses 2% purchasing power while bonds gain 3%, making the real difference 5%."
  },
  {
    "id": "over-collateralization",
    "detailed": "Over-collateralization means pledging collateral (assets used as security) worth significantly more than the value of the loan or obligation being secured. In decentralized finance (DeFi), over-collateralization is necessary because crypto assets are volatile (prices change rapidly) and smart contracts (self-executing code) cannot assess creditworthiness (trustworthiness as a borrower) or pursue legal action against defaulters. Typical ratios range from 150% to 300%, meaning borrowers must deposit 1.50 to 3.00 EUR worth of assets for every 1 EUR borrowed. This protects lenders from losses if collateral value drops suddenly, providing a buffer before liquidation (automatic sale of collateral) becomes necessary. The higher the volatility, the higher the required over-collateralization ratio.",
    "example": "To borrow 1,000 DAI stablecoin from Aave, you must deposit 1,500 USD worth of Ethereum (150% collateralization). If Ethereum's price drops 20%, your collateral falls to 1,200 USD (120% ratio), triggering automatic liquidation to protect the lending pool. This over-collateralization ensures lenders get repaid even if collateral value crashes."
  },
  {
    "id": "quantity-theory-of-money",
    "detailed": "The quantity theory of money describes the relationship between the money supply (total amount of money in circulation), velocity of money (how fast money changes hands), price levels (average prices of goods and services), and real output (total goods and services produced) using the equation MV = PY. M is money supply, V is velocity (number of times a unit of money circulates per year), P is price level, and Y is real output or GDP (gross domestic product, the total value of goods and services produced). The theory predicts that if velocity and output are constant, increasing money supply causes proportional increases in prices (inflation). This implies that printing money without growing the economy causes inflation, while growing the economy without increasing money supply causes deflation (falling prices).",
    "example": "An economy produces 1,000 EUR worth of goods annually (Y = 1,000), has 100 EUR in circulation (M = 100), and each euro is spent 10 times per year (V = 10). This gives MV = 100 × 10 = 1,000 = PY. If the central bank doubles money supply to M = 200 with constant V and Y, then P must double, causing 100% inflation."
  },
  {
    "id": "seigniorage",
    "detailed": "Seigniorage is the profit a government or central bank earns from issuing currency when the face value (nominal value printed on the currency) exceeds the production cost. For physical currency, if a 100 EUR note costs 0.15 EUR to print, seigniorage is 99.85 EUR. For digital money, production costs approach zero, making seigniorage nearly 100%. Governments use seigniorage as a funding source, essentially getting free resources by creating money. In cryptocurrency contexts, miners or validators (participants who secure the network) earn seigniorage by creating new coins as rewards for processing transactions. Excessive seigniorage through money printing leads to inflation (rising prices) and eventually hyperinflation if abused, functioning as an inflation tax (hidden tax on money holders).",
    "example": "The European Central Bank prints a 50 EUR note costing 0.12 EUR in paper and ink, earning 49.88 EUR in seigniorage when it enters circulation. Bitcoin miners earn seigniorage of 6.25 BTC (worth approximately 160,000 USD at 2024 prices) every 10 minutes for validating transactions and securing the network."
  },
  {
    "id": "stablecoin",
    "detailed": "A stablecoin is a cryptocurrency designed to maintain a stable value relative to a reference asset, typically pegged at 1:1 to a fiat currency like the US dollar or euro. Unlike Bitcoin or Ethereum, whose prices fluctuate dramatically, stablecoins aim to provide the benefits of cryptocurrency (fast transfers, programmability, global access) without the volatility (rapid price changes). Stablecoins achieve stability through different mechanisms: fiat-backed stablecoins hold traditional currency reserves, crypto-backed stablecoins use over-collateralization with volatile assets, and algorithmic stablecoins use supply adjustments without collateral. Stablecoins are crucial for cryptocurrency trading (providing a stable trading pair), decentralized finance (DeFi) applications, and cross-border payments.",
    "example": "USDC (USD Coin) is a fiat-backed stablecoin issued by Circle, maintaining a 1:1 peg to the US dollar by holding 1 USD in reserves for every USDC issued. Users can always redeem 100 USDC for 100 USD, keeping the market price stable. This allows cryptocurrency traders to park funds in USDC during market downturns without converting to traditional bank accounts."
  },
  {
    "id": "store-of-value",
    "detailed": "A store of value is an asset that maintains its purchasing power (ability to buy goods and services) over time without significant depreciation (loss of value). Good stores of value have characteristics like durability (lasting without deteriorating), scarcity (limited supply), portability (easy to transfer), and recognizability (universally accepted). Money serves as a store of value when inflation (rising prices) is low and stable, allowing savings to retain their worth. Assets that lose value quickly due to inflation, deterioration, or lack of demand fail as stores of value. Gold, real estate, and government bonds traditionally serve as stores of value, while Bitcoin proponents argue its fixed supply makes it a superior store of value compared to fiat currencies subject to inflation.",
    "example": "In stable economies, 1,000 EUR saved today will buy roughly the same amount of goods in 10 years (adjusted for modest 2% annual inflation, worth about 820 EUR in purchasing power). In Venezuela during hyperinflation (2016-2019), 1,000 bolivars lost 99.9999% of purchasing power within months, failing catastrophically as a store of value."
  },
  {
    "id": "unit-of-account",
    "detailed": "A unit of account is the standard measure used to price goods, services, assets, and debts in an economy. Money functions as a unit of account by providing a common denominator for expressing value, making it easy to compare the worth of different things. Without a unit of account, you would need to know exchange rates between every pair of goods (if 1 apple = 3 oranges and 1 chair = 50 apples, how many oranges equal 1 chair?). Using money simplifies this: if apples cost 1 EUR, oranges cost 0.33 EUR, and chairs cost 50 EUR, all comparisons become trivial. A stable unit of account requires low inflation (stable prices) so contracts and prices remain meaningful over time.",
    "example": "In everyday life, we think in euros or dollars, not apples or gold grams. A coffee costs 3 EUR, rent is 1,000 EUR per month, and salaries are 50,000 EUR per year. Without this common unit, comparing whether a coffee is expensive relative to rent would require complex mental calculations involving dozens of exchange rates."
  },
  {
    "id": "velocity-of-money",
    "detailed": "Velocity of money measures how many times a unit of currency circulates through the economy within a period (usually one year), calculated as nominal GDP (gross domestic product, total value of all goods and services produced) divided by money supply. High velocity means money changes hands frequently, indicating active economic activity where people spend rather than hoard money. Low velocity means money sits idle in accounts, suggesting economic stagnation or hoarding behavior. Velocity is crucial for understanding the quantity theory of money (MV = PY): if velocity falls, the central bank must increase money supply to maintain price levels and output. Token velocity in cryptocurrencies works similarly—high velocity can depress token value because tokens do not get held as a store of value.",
    "example": "If an economy produces 10 trillion EUR in GDP annually with 2 trillion EUR in money supply, velocity is 10 trillion / 2 trillion = 5, meaning each euro is spent 5 times per year on average. If velocity drops to 3 due to recession fears causing hoarding, GDP falls unless the central bank increases money supply."
  }
]
