[
  {
    "id": "acquirer",
    "detailed": "An acquirer is a bank or financial institution that processes card payments on behalf of merchants and deposits the funds into their accounts. When you pay with a card at a store, the acquirer handles the transaction from the merchant's side, communicating with the card networks (like Visa or Mastercard) and the issuer (the customer's bank) to verify and complete the payment. The acquirer takes on risk by guaranteeing payment to the merchant even if the customer's bank has problems, and charges the merchant fees for this service. This is the opposite side of card transactions from the issuer, which provides cards to consumers.",
    "example": "When a coffee shop accepts your Visa card, their acquirer (perhaps a bank like Chase) processes the EUR 4.50 payment, verifies it with Visa's network, receives approval from your card issuer, and deposits the money (minus fees) into the coffee shop's bank account within 1-2 business days."
  },
  {
    "id": "correspondent-banking",
    "detailed": "Correspondent banking is an arrangement where one bank (the correspondent) provides services on behalf of another bank (the respondent), commonly used for international payments. Banks cannot directly access every country's payment system, so they hold accounts with each other to facilitate cross-border transactions through intermediary banks. When you send money internationally, it often passes through multiple correspondent banks before reaching the recipient, with each intermediary taking a fee. This system creates long chains of banks, which increases costs, delays, and opacity in international payments. The number of correspondent banking relationships has declined in recent years due to compliance costs and risk concerns.",
    "example": "If a small bank in Kenya wants to send USD to the USA but has no direct access to the US payment system, it uses a larger correspondent bank like Citibank that has accounts in both countries. Citibank acts as the intermediary, charging fees for providing this access and taking on the compliance burden of verifying the transaction meets anti-money laundering rules."
  },
  {
    "id": "dns",
    "detailed": "Deferred Net Settlement (DNS) is a payment system that accumulates transactions throughout the day and settles only the net positions (the difference between what each bank owes and is owed) at the end of the day. Instead of transferring money for every single transaction, banks keep a running tally and only move the final balance. This dramatically reduces the amount of money banks need to hold ready (liquidity) compared to settling each transaction individually. However, it creates settlement risk, meaning if one bank fails during the day before settlement occurs, other banks may not receive the money they are owed. DNS systems are common for retail payments where individual transactions are small.",
    "example": "Bank A processes 1000 payments totaling EUR 500,000 to Bank B during the day, while Bank B sends 800 payments totaling EUR 450,000 to Bank A. Instead of transferring money 1800 times, the DNS system nets these out, and only EUR 50,000 moves from Bank A to Bank B at 5pm settlement time."
  },
  {
    "id": "financial-inclusion",
    "detailed": "Financial inclusion means ensuring all people have access to useful and affordable financial services such as bank accounts, payments, savings, credit, and insurance. Approximately 1.4 billion adults worldwide lack access to basic banking services, particularly in developing countries, rural areas, and among women and low-income populations. Without access to formal financial services, people must rely on cash, informal lenders with high rates, or risky alternatives. Lack of financial inclusion perpetuates poverty by making it harder to save safely, access credit for business opportunities, or receive payments efficiently. Digital payment systems, mobile money, and central bank digital currencies are seen as potential tools to expand financial inclusion.",
    "example": "Before mobile money, a farmer in rural Kenya had to walk hours to the nearest bank branch and pay high fees to cash checks or send money to family. With M-Pesa mobile money, the farmer can now send and receive payments via text message using just a basic mobile phone, dramatically reducing transaction costs and time."
  },
  {
    "id": "float",
    "detailed": "Float is money that is in transit between accounts during the time delay between when a payment is initiated and when it is actually settled. During this period, the money has left the payer's practical control but has not yet arrived in the payee's account. Whoever holds the float during this period can earn interest on it, creating an economic incentive around payment speed. In traditional banking, float can last several days for checks or international transfers. Payment companies and banks historically benefited from float by earning interest on money in transit. Faster payment systems and real-time settlement reduce float, which benefits consumers but reduces revenue for financial intermediaries.",
    "example": "You write a check for EUR 1000 on Monday, and the recipient deposits it Tuesday. Your bank does not deduct the money from your account until Thursday, and the recipient's bank does not credit their account until Friday. From Tuesday to Friday, that EUR 1000 is float, sitting in the banking system earning interest for the banks rather than either party."
  },
  {
    "id": "interchange-fee",
    "detailed": "An interchange fee is a fee paid by the merchant's bank (acquirer) to the cardholder's bank (issuer) for each card transaction, typically ranging from 1% to 3% of the transaction value. This fee is set by the card networks like Visa and Mastercard and is ultimately passed on to merchants, who pay it as part of their merchant service fees. Interchange fees fund credit card rewards programs, fraud protection, and card issuer profits. Merchants cannot usually negotiate these fees and typically pass the costs to consumers through higher prices. Many countries regulate interchange fees because they are perceived as anti-competitive, with the European Union capping them at 0.2% for debit and 0.3% for credit cards.",
    "example": "When you use your rewards credit card to buy EUR 100 of groceries, the grocery store pays approximately EUR 2 in interchange fees to your bank. Your bank uses this revenue to fund the cash-back or airline miles rewards you earn, creating a subsidy where people who pay cash effectively subsidize rewards for credit card users."
  },
  {
    "id": "issuer",
    "detailed": "An issuer is a bank or financial institution that provides payment cards (debit or credit) to consumers and extends credit to cardholders. The issuer maintains the customer relationship, sets credit limits, handles billing and collections, and bears the risk if the cardholder does not pay. When you use your card, the issuer receives the interchange fee from the merchant's bank and must pay you any rewards you earn. Issuers make money from interchange fees, interest on credit card balances, and annual fees. They compete for customers by offering attractive rewards programs, lower interest rates, or other benefits. This is the opposite side of card transactions from the acquirer, which works with merchants.",
    "example": "Chase Bank is the issuer of your Visa credit card. When you make a purchase, Chase verifies you have available credit, approves the transaction, charges it to your account, sends you a monthly bill, and collects interest if you carry a balance. Chase also credits you with rewards points and receives interchange fees from merchants where you shop."
  },
  {
    "id": "mobile-money",
    "detailed": "Mobile money is a financial service that allows users to store, send, and receive money using their mobile phone without needing a traditional bank account. Users deposit cash with an agent, who credits their mobile account, and can then transfer money via text message to other users, who can withdraw cash from another agent. M-Pesa in Kenya pioneered this model in 2007 and has achieved massive adoption, especially in regions with low banking penetration but high mobile phone ownership. Mobile money dramatically reduces transaction costs and increases financial inclusion by leveraging existing mobile networks and agent networks instead of expensive bank branches. It has become essential for remittances, bill payments, and merchant transactions in many developing countries.",
    "example": "A construction worker in Nairobi uses M-Pesa to send 2000 Kenyan shillings (about USD 20) to his mother in a rural village. He visits a local shop that acts as an M-Pesa agent, gives them cash, and they credit his mobile account. He then sends the money via text message, and his mother visits her local agent to withdraw cash, all within minutes and for fees under 1%."
  },
  {
    "id": "natural-monopoly",
    "detailed": "A natural monopoly exists when a market is most efficiently served by a single provider because of high fixed costs and low marginal costs, meaning one company can serve everyone at lower cost than multiple competitors. Payment infrastructure often exhibits natural monopoly characteristics because building and maintaining a payment network requires massive upfront investment, but processing additional transactions costs very little. Once one network achieves dominance, it becomes increasingly difficult for competitors to justify building duplicate infrastructure. This creates a policy dilemma since monopolies can lead to high prices and lack of innovation, but forcing competition may result in inefficient duplication and higher overall costs. Many countries regulate natural monopolies or provide public alternatives to ensure fair access and pricing.",
    "example": "In many countries, the national card payment network like Visa or Mastercard acts as a near-monopoly because it would be wasteful for five different companies to each build separate networks of card readers, bank connections, and fraud systems. The dominant network gets stronger as more merchants and cardholders join, making it nearly impossible for new entrants to compete."
  },
  {
    "id": "netting",
    "detailed": "Netting is the process of offsetting payments in opposite directions so that only the net difference actually settles, rather than settling each transaction individually. If Bank A owes Bank B EUR 10 million and Bank B owes Bank A EUR 9 million, netting means only EUR 1 million actually moves from Bank A to Bank B instead of transferring EUR 19 million in both directions. This dramatically reduces the amount of liquidity (money) that banks need to hold ready to make payments, lowering costs. Netting can be bilateral (between two parties) or multilateral (across many parties simultaneously). However, netting creates settlement risk because if one party fails before settlement, the other parties may be left with unexpected obligations.",
    "example": "During a trading day, Bank A and Bank B execute hundreds of securities trades with each other. Instead of transferring cash and securities for each trade individually, which would require enormous liquidity reserves, they net all trades at day's end. If Bank A bought EUR 500 million and sold EUR 450 million worth of securities, only the net EUR 50 million needs to be settled."
  },
  {
    "id": "price-elasticity",
    "detailed": "Price elasticity measures how much demand changes when price changes, expressed as the percentage change in quantity demanded divided by the percentage change in price. In payment systems, card users are typically price-insensitive (inelastic demand) because they do not directly pay transaction fees and value the convenience and rewards, while merchants are more price-sensitive (elastic demand) but have little choice but to accept cards since refusing them loses customers. This asymmetry allows card networks to charge high fees to merchants who have less ability to resist. Elastic demand means small price increases cause large drops in usage, while inelastic demand means price increases barely affect usage.",
    "example": "When Visa increases interchange fees by 10%, merchants continue accepting Visa cards because refusing them would drive customers to competitors, even though the fee increase hurts merchant profitability. Meanwhile, if merchants tried to charge customers a 10% surcharge for using cards, many customers would switch to cash or go elsewhere, showing that merchant demand is more elastic than cardholder demand."
  },
  {
    "id": "remittances",
    "detailed": "Remittances are money transfers sent by workers living abroad back to their families in their home countries, often from developed to developing nations. Remittances are a critical source of income for many developing countries, exceeding foreign aid in total value. However, sending remittances through traditional channels like Western Union or banks is expensive, with global average costs around 6% of the amount sent, and sometimes exceeding 10% for certain corridors. These high costs are due to lack of competition, compliance costs, and correspondent banking fees. Digital payment systems, cryptocurrencies, and mobile money are emerging as cheaper alternatives, with some services charging under 2%. Reducing remittance costs is a development priority because it increases the money reaching families.",
    "example": "A construction worker in Germany sends EUR 200 per month to his family in Morocco using Western Union. He pays EUR 12 in fees each time (6% of the transfer), meaning his family receives only EUR 188. Over a year, EUR 144 goes to fees instead of his family. With a digital service charging 2%, his family would receive an extra EUR 96 per year."
  },
  {
    "id": "rtgs",
    "detailed": "Real-Time Gross Settlement (RTGS) is a payment system that settles transactions individually and immediately, with finality, meaning once settled the payment cannot be reversed. Unlike deferred net settlement systems that batch transactions, RTGS transfers money instantly for each transaction in real-time. This eliminates settlement risk (the risk that a counterparty fails before settlement) because transactions complete immediately. However, RTGS requires banks to hold much more liquidity (cash reserves) since they must have funds available for each transaction as it occurs, rather than netting obligations at day's end. RTGS systems are typically used for large-value payments between financial institutions, such as interbank transfers or securities settlements, where settlement risk is unacceptable.",
    "example": "When Bank A wires EUR 50 million to Bank B to settle a corporate acquisition, the payment goes through the central bank's RTGS system. Within seconds, EUR 50 million is deducted from Bank A's account at the central bank and credited to Bank B's account, with immediate finality. Bank B can immediately use these funds, knowing the payment cannot be reversed."
  },
  {
    "id": "settlement-risk",
    "detailed": "Settlement risk is the risk that one party in a transaction delivers their side of the bargain (such as goods, services, or securities) but the counterparty fails to deliver their side (typically payment) before settlement completes. This risk exists in deferred settlement systems where there is a time gap between when a transaction is agreed and when it actually settles. If one party becomes insolvent during this period, the other party may not receive what they are owed, potentially triggering a cascade of failures if the loss affects their ability to meet obligations to others. Settlement risk is eliminated in real-time gross settlement (RTGS) systems because transactions complete immediately with finality. It is a key concern in payment systems, securities trading, and foreign exchange markets.",
    "example": "Bank A agrees to buy EUR 100 million in securities from Bank B, with settlement scheduled for two days later. Bank A transfers the securities immediately but Bank B has not yet paid. If Bank B fails before settlement day, Bank A has delivered EUR 100 million in securities but will not receive payment, creating a massive loss and potentially causing Bank A to fail its own obligations to other parties."
  }
]
