{
  "metadata": {
    "generated": "2026-02-07",
    "totalTerms": 163,
    "totalLessons": 8
  },
  "terms": [
    {
      "id": "account-based-cbdc",
      "term": "Account-Based CBDC",
      "definition": "CBDC where validity requires verification of the holder's identity against an account.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "An account-based CBDC is a type of central bank digital currency where each unit of money is tied to a specific person's identity, verified through an account held at or registered with the central bank (or an intermediary bank acting on its behalf). To spend your digital money, the system checks who you are -- much like how your bank verifies your identity before letting you transfer funds online. This contrasts with token-based CBDC, where the digital coin itself is what matters, not who holds it. Account-based designs make it easier to enforce regulations but reduce the anonymity that physical cash provides.",
      "example": "The European Central Bank could issue a digital euro where every citizen has a registered account. When you pay EUR 25 at a store, the system verifies your identity against your account before completing the transfer -- similar to how online banking works today."
    },
    {
      "id": "acquirer",
      "term": "Acquirer",
      "definition": "Bank that processes card payments for merchants and deposits funds into their accounts.",
      "lessons": [
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "An acquirer is a bank or financial institution that processes card payments on behalf of merchants and deposits the funds into their accounts. When you pay with a card at a store, the acquirer handles the transaction from the merchant's side, communicating with the card networks (like Visa or Mastercard) and the issuer (the customer's bank) to verify and complete the payment. The acquirer takes on risk by guaranteeing payment to the merchant even if the customer's bank has problems, and charges the merchant fees for this service. This is the opposite side of card transactions from the issuer, which provides cards to consumers.",
      "example": "When a coffee shop accepts your Visa card, their acquirer (perhaps a bank like Chase) processes the EUR 4.50 payment, verifies it with Visa's network, receives approval from your card issuer, and deposits the money (minus fees) into the coffee shop's bank account within 1-2 business days."
    },
    {
      "id": "adverse-selection",
      "term": "Adverse Selection",
      "definition": "When information asymmetry causes bad products/actors to dominate markets (Akerlof's lemons problem). Informed traders profit at uninformed traders' expense, causing market makers to widen spreads.",
      "lessons": [
        "L06",
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Adverse selection happens when one side of a deal knows more than the other, and this imbalance causes the market to fill up with low-quality participants. The concept comes from economist George Akerlof's \"lemons problem\": if used-car buyers cannot tell good cars from bad ones, they only offer low prices, so owners of good cars leave the market and only \"lemons\" (bad cars) remain. In financial markets, informed traders (those with private knowledge about an asset's true value) profit at the expense of uninformed traders, forcing market makers (firms that stand ready to buy and sell) to widen the bid-ask spread (the gap between buying and selling prices) to protect themselves from losses.",
      "example": "A crypto exchange lists a new token. Insiders know the project is failing, so they sell heavily. Regular buyers, unaware of this, keep purchasing at inflated prices. The informed insiders profit while uninformed buyers suffer losses -- a textbook adverse-selection problem."
    },
    {
      "id": "airdrops",
      "term": "Airdrops",
      "definition": "Free distribution of tokens to wallet addresses to bootstrap network or reward loyalty.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "An airdrop is a free distribution of cryptocurrency tokens sent directly to people's digital wallets (software that stores crypto), usually to jump-start a new network or reward early users. Projects use airdrops the way a new restaurant might hand out free samples to attract its first customers. The idea is that once people hold tokens, they have an incentive to use and promote the platform. Airdrops can also reward loyalty, giving extra tokens to people who were active on the platform before it launched its own currency.",
      "example": "In 2020, the Uniswap exchange airdropped 400 UNI tokens to every wallet that had ever used the platform. At their peak price, those free tokens were worth over $16,000 per person."
    },
    {
      "id": "algorithmic-stablecoin",
      "term": "Algorithmic Stablecoin",
      "definition": "Stablecoin using supply adjustments without full collateral.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "An algorithmic stablecoin is a cryptocurrency designed to maintain a stable value (usually pegged to 1 USD or 1 EUR) without holding full collateral (assets backing each coin) in reserve. Instead, it uses computer algorithms (sets of rules) to automatically adjust the supply of coins in response to market demand. When the price rises above the target, the algorithm creates new coins to increase supply and push the price down. When the price falls below the target, the algorithm removes coins from circulation to decrease supply and push the price up. This approach relies on market participants (traders) believing the system will work and acting accordingly. The danger is that if confidence collapses, the algorithm cannot restore the peg, leading to a death spiral (self-reinforcing collapse).",
      "example": "TerraUSD (UST) was an algorithmic stablecoin that maintained its 1 USD peg by allowing users to swap 1 UST for 1 USD worth of LUNA tokens. When confidence evaporated in May 2022, the peg broke, UST fell to 0.10 USD, and the entire 40 billion USD ecosystem collapsed within days."
    },
    {
      "id": "aml",
      "term": "AML (Anti-Money Laundering)",
      "definition": "Laws and regulations designed to prevent criminals from disguising illegally obtained money as legitimate income. Rules preventing financial system use for laundering illicit funds.",
      "lessons": [
        "L03",
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Anti-Money Laundering (AML) refers to the set of laws, regulations, and procedures that financial institutions must follow to detect and prevent criminals from disguising illegally obtained money as legitimate income. Money laundering typically involves three stages: placement (putting dirty money into the financial system), layering (moving it around through complex transactions to obscure its origin), and integration (making it appear like normal business income). Banks and crypto exchanges must monitor transactions, report suspicious activity to authorities, and keep records. Failure to comply can result in heavy fines, criminal charges, or loss of operating licenses.",
      "example": "When you open a bank account or sign up for a cryptocurrency exchange like Coinbase, you must provide identification documents. If someone deposits EUR 50,000 in cash without explanation, the bank files a Suspicious Activity Report with regulators -- that is AML in action."
    },
    {
      "id": "amm",
      "term": "AMM (Automated Market Maker)",
      "definition": "Smart contract providing liquidity through algorithmic pricing (e.g., constant product formula x · y = k).",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "An Automated Market Maker (AMM) is a smart contract (self-executing computer program on a blockchain) that acts like a robot market maker, always ready to buy or sell tokens. Instead of matching buyer and seller orders like a traditional exchange, it uses a mathematical formula to set prices automatically. The most common formula is the constant product formula (x times y equals k), where x and y represent the quantities of two different tokens in a pool. When someone buys token X, the pool has less X and more Y, so the formula automatically makes X more expensive. This means prices adjust automatically based on supply and demand without needing a human market maker.",
      "example": "Uniswap uses AMMs: if a pool has 100 ETH and 200,000 USDC (k = 20 million), and you buy 10 ETH, you pay roughly 22,000 USDC because the formula maintains k constant, making each additional ETH progressively more expensive."
    },
    {
      "id": "arbitrage",
      "term": "Arbitrage",
      "definition": "Profiting from price differences across markets; maintains stablecoin pegs.",
      "lessons": [
        "L02",
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "Arbitrage means buying an asset in one place where it is cheap and simultaneously selling it in another place where it is more expensive, capturing the price difference as risk-free profit. Arbitrageurs act like economic bloodhounds who sniff out price differences and eliminate them by trading. This process is essential for keeping markets efficient because it forces prices to converge across different venues. In crypto and stablecoin markets, arbitrage is especially important: if USDC trades for 0.99 USD on one exchange and 1.01 USD on another, arbitrageurs buy at 0.99, sell at 1.01, and pocket 2 cents per coin while pulling the prices back together.",
      "example": "If 1 BTC costs 50,000 USD on Binance but 50,200 USD on Coinbase, an arbitrageur buys on Binance and sells on Coinbase for 200 USD profit (minus fees), which forces prices to equalize."
    },
    {
      "id": "atomic-swap",
      "term": "Atomic Swap",
      "definition": "A technology enabling exchange of different currencies simultaneously---both transfers complete or neither does.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "An atomic swap is a technology that allows two different currencies or digital assets to be exchanged simultaneously, with a guarantee that either both transfers complete successfully or neither does. The word 'atomic' comes from the idea of an indivisible operation -- there is no moment where one party has sent their money but the other has not. This eliminates counterparty risk (the danger that the other person takes your payment but never sends theirs). Atomic swaps use cryptographic techniques called hash time-locked contracts that automatically reverse the transaction if both sides do not fulfill their obligations within a set time window.",
      "example": "If the Fed and the European Central Bank connect their CBDC systems, a US importer could swap USD 10,000 for EUR 9,200 in a single instant. If either side fails, both amounts automatically return to their original owners -- no trust required."
    },
    {
      "id": "bank-disintermediation",
      "term": "Bank Disintermediation",
      "definition": "Risk that CBDC adoption draws deposits away from commercial banks, reducing their lending capacity.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "Bank disintermediation is the risk that if a central bank issues digital currency directly to citizens, people might move their savings out of commercial banks (ordinary banks like Chase or Deutsche Bank) and into CBDC instead. This matters because commercial banks use customer deposits to fund loans to businesses and homebuyers. If deposits shrink significantly, banks have less money to lend, which could slow economic growth. This is one of the biggest concerns central banks face when designing CBDCs, and many proposed designs include holding limits or lower interest rates on CBDC to discourage large-scale deposit migration.",
      "example": "If the ECB launches a digital euro and 100 million Europeans each move EUR 3,000 from their bank accounts into CBDC, that is EUR 300 billion less that banks can use to fund mortgages, small business loans, and other lending."
    },
    {
      "id": "bank-reserves",
      "term": "Bank Reserves",
      "definition": "Money that commercial banks hold at the central bank---like a bank's own bank account.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "Bank reserves are the funds that commercial banks (the ordinary banks where people hold accounts) keep deposited at the central bank. Think of it as a bank's own bank account. Banks are required to maintain a minimum level of reserves to ensure they can handle withdrawals and settle payments with other banks. When a central bank changes interest rates, it typically does so by adjusting the rate it pays on these reserves, which then ripples through the entire economy. Reserves are different from the cash in a bank's vault -- they exist as digital balances on the central bank's ledger and form the backbone of the interbank payment system.",
      "example": "Deutsche Bank holds a reserve account at the ECB. If a customer wires EUR 50,000 to someone at Commerzbank, Deutsche Bank's reserve balance drops by EUR 50,000 and Commerzbank's rises by the same amount -- the central bank's ledger is the ultimate record."
    },
    {
      "id": "barter",
      "term": "Barter",
      "definition": "Direct goods exchange without money; requires double coincidence of wants.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "Barter is the direct exchange of goods or services without using money as an intermediary. For barter to work, you need a double coincidence of wants, meaning both parties must have what the other wants and want what the other has at the exact same time. This makes barter extremely inefficient compared to using money. If you grow apples and need shoes, you must find a shoemaker who wants apples right now and has shoes available. Money solves this problem by acting as a medium of exchange (universally accepted payment) that separates buying from selling in time and space.",
      "example": "A farmer with extra wheat wants a new axe. Without money, they must find a blacksmith who both makes axes and currently needs wheat. If the blacksmith already has enough wheat, no trade happens even though both parties need something. With money, the farmer sells wheat to anyone for cash, then buys the axe whenever convenient."
    },
    {
      "id": "bid-ask-spread",
      "term": "Bid-Ask Spread",
      "definition": "Difference between highest buy price and lowest sell price; narrower spreads mean more liquid markets. Wider spreads mean higher hidden costs.",
      "lessons": [
        "L04",
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "The bid-ask spread is the gap between the highest price someone is willing to pay to buy an asset (the bid) and the lowest price someone is willing to accept to sell it (the ask). Think of it as the hidden cost of trading: if you want to buy immediately, you pay the ask price, which is higher than the bid. If you want to sell immediately, you receive the bid price, which is lower than the ask. A narrow spread (say 100.00 bid and 100.02 ask) means the market is liquid with many buyers and sellers. A wide spread (say 100.00 bid and 101.00 ask) means the market is illiquid, and you pay a steep hidden fee for instant execution.",
      "example": "On NYSE, Apple stock might have a bid of 150.00 USD and ask of 150.01 USD (1 cent spread). On a small crypto exchange, an obscure token might have a bid of 5.00 USD and ask of 5.50 USD (50 cent spread), costing you 10% just to trade."
    },
    {
      "id": "block-time",
      "term": "Block Time",
      "definition": "Time between new blocks added to blockchain; determines MEV opportunities.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "Block time is the average duration between the creation of consecutive blocks on a blockchain. A block is like a page in a digital ledger that records a batch of transactions. Bitcoin creates a new block roughly every 10 minutes, while Ethereum produces one roughly every 12 seconds. Block time matters enormously for trading because during that interval, traders can see pending transactions in the mempool (waiting area) and can strategically insert, reorder, or front-run them to extract profit. This window of opportunity is the foundation for Maximal Extractable Value (MEV): the longer the block time, the more time traders have to analyze and exploit pending transactions before they are finalized.",
      "example": "On Ethereum (12-second blocks), a bot can see your pending 10 ETH buy order, quickly submit its own buy order with a higher gas fee to execute first, then sell to you at a higher price, all within one block."
    },
    {
      "id": "blockchain",
      "term": "Blockchain",
      "definition": "Distributed digital ledger recording transactions across many computers.",
      "lessons": [
        "L01"
      ],
      "category": "Foundations",
      "detailed": "A blockchain is a distributed digital ledger (a record-keeping system) that stores transaction data across many computers instead of in one central location. Each block contains a batch of transactions, and blocks are linked together in a chain using cryptography (mathematical codes that secure data). Once data is recorded in a block, it cannot be changed without altering all subsequent blocks, which requires consensus from the network. This makes blockchains resistant to tampering and fraud, and eliminates the need for a trusted central authority to verify transactions.",
      "example": "Bitcoin's blockchain records every transaction ever made. When Alice sends 0.5 BTC to Bob, that transaction gets bundled into a block with hundreds of others, then added to the chain permanently. Anyone can verify the transaction happened, but no single company or government controls the records."
    },
    {
      "id": "burn-mechanism",
      "term": "Burn Mechanism",
      "definition": "Process of permanently removing tokens from circulation to create scarcity.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "A burn mechanism is a process that permanently destroys tokens by sending them to an address from which they can never be retrieved, reducing the total supply in circulation. This works like a company buying back and shredding its own shares: fewer tokens in existence means each remaining token represents a larger share of the network's value. Burns create deflationary pressure (a tendency for value per token to rise over time) and are often triggered automatically when users pay transaction fees or use platform services.",
      "example": "Ethereum's EIP-1559 upgrade burns a portion of every transaction fee. In busy periods, Ethereum has burned more tokens per day than it creates, making the total supply shrink over time."
    },
    {
      "id": "cbdc",
      "term": "CBDC (Central Bank Digital Currency)",
      "definition": "Digital cash issued by the central bank. If you hold 100 in CBDC, the central bank guarantees you that value---unlike bank deposits which depend on your bank staying solvent.",
      "lessons": [
        "L01",
        "L03"
      ],
      "category": "CBDC",
      "detailed": "A Central Bank Digital Currency (CBDC) is digital money issued and guaranteed by a country's central bank -- the institution responsible for a nation's monetary system (like the European Central Bank or the US Federal Reserve). Unlike the money in your bank account, which is actually a promise from a commercial bank that could theoretically fail, CBDC is a direct claim on the central bank itself, making it as safe as physical cash. CBDCs can be designed for everyday use by the public (retail CBDC) or restricted to banks for large interbank transfers (wholesale CBDC). Over 130 countries are currently researching or piloting CBDC projects.",
      "example": "China's digital yuan (e-CNY) lets citizens pay at shops by scanning a QR code from a phone app. If you hold 500 e-CNY, the People's Bank of China itself guarantees that value -- even if the commercial bank that distributed the app goes bankrupt, your money is safe."
    },
    {
      "id": "censorship-resistance",
      "term": "Censorship Resistance",
      "definition": "Property of a system that prevents any single entity from blocking or reversing transactions.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "Censorship resistance is the ability of a financial system or network to process transactions without any single entity having the power to block, reverse, or prevent them. This property emerges from decentralization (spreading control across many independent participants) rather than relying on one trusted authority like a bank or government. In traditional finance, governments or banks can freeze accounts or reject payments. In censorship-resistant systems like Bitcoin, no single party can stop you from transacting. This trade-off often means sacrificing some efficiency and regulatory compliance for greater autonomy and access.",
      "example": "Bitcoin is censorship-resistant because no government or company controls the network—even if one country bans it, miners and nodes worldwide continue processing transactions. In contrast, PayPal can freeze your account if it suspects a terms-of-service violation. WikiLeaks famously turned to Bitcoin in 2010 after traditional payment processors like Visa and Mastercard blocked donations under political pressure."
    },
    {
      "id": "clob",
      "term": "CLOB (Central Limit Order Book)",
      "definition": "Order book matching system that pairs buy and sell orders by price-time priority.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "A Central Limit Order Book (CLOB) is the traditional order-matching system used by stock exchanges like NYSE or NASDAQ, where all buy orders (bids) and sell orders (asks) are collected in one place and displayed publicly. Orders are matched according to strict rules: best price wins (highest bid gets matched with lowest ask), and if two orders have the same price, the earlier one (time priority) goes first. This creates a transparent system where you can see all pending orders at every price level. The \"limit\" in CLOB refers to limit orders: instructions to buy or sell at a specified price or better, which sit in the book until matched.",
      "example": "On Binance's BTC/USDT CLOB, you might see bids at 50,000 (for 2 BTC), 49,999 (for 5 BTC), 49,998 (for 1 BTC) and asks at 50,001 (for 3 BTC), 50,002 (for 4 BTC). If you place a market buy for 4 BTC, you get 3 at 50,001 and 1 at 50,002."
    },
    {
      "id": "collateral",
      "term": "Collateral",
      "definition": "Assets pledged as security for loan or stablecoin.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "Collateral is an asset (something of value like real estate, stocks, or cryptocurrency) that a borrower pledges to a lender as security for a loan. If the borrower fails to repay the loan, the lender can seize and sell the collateral to recover their money. In stablecoin systems, collateral backs the coins to maintain their value. For example, a fiat-backed stablecoin holds 1 USD in a bank account for every 1 stablecoin issued. In decentralized finance (DeFi), collateral is often over-collateralized, meaning borrowers must pledge assets worth more than the loan amount to protect against price volatility (rapid price changes). If collateral value drops below a certain threshold (minimum level), it gets automatically liquidated (sold off).",
      "example": "MakerDAO's DAI stablecoin requires users to deposit 150 USD worth of Ethereum to borrow 100 DAI. If Ethereum's price drops and your collateral falls below 150%, the system automatically sells your Ethereum to repay the loan, protecting the system but potentially costing you money."
    },
    {
      "id": "collateral-liquidation",
      "term": "Collateral Liquidation",
      "definition": "Automatic sale of collateral when borrowers fail to maintain required collateralization ratios.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "Collateral liquidation is the automatic forced sale of assets that a borrower pledged as security when the value of those assets falls below a required minimum threshold (called the collateralization ratio). This protects lenders from losing money if borrowers default. In decentralized finance (DeFi), smart contracts (automated programs on blockchains) monitor collateral values constantly and trigger liquidations instantly without human intervention. For example, if you borrow 500 dollars worth of stablecoins by pledging 1000 dollars of Ethereum, and Ethereum's price drops so your collateral is now worth only 650 dollars, the protocol might automatically sell your Ethereum to repay the loan plus a penalty.",
      "example": "On Aave (a DeFi lending protocol), if you deposit 10,000 dollars of Ethereum as collateral to borrow 5,000 USDC, and Ethereum's price drops 40 percent, your collateral is now worth only 6,000 dollars. Since you're below the safe threshold (usually 150 percent collateralization), Aave's smart contract automatically sells enough Ethereum to repay your 5,000 dollar loan plus a liquidation penalty, leaving you with less Ethereum than you started with."
    },
    {
      "id": "compliance-costs",
      "term": "Compliance Costs",
      "definition": "Direct and indirect expenses of meeting regulatory requirements.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Compliance costs are all the expenses -- both direct and indirect -- that a company must pay to follow government rules and regulations. Direct costs include hiring compliance officers, purchasing monitoring software, conducting audits, and filing mandatory reports. Indirect costs include the time employees spend on paperwork instead of productive work, delays in launching new products while awaiting regulatory approval, and opportunities lost because resources were diverted to meeting requirements. These costs are especially burdensome for small firms, which spend a larger share of their revenue on compliance than big companies do, creating an uneven playing field.",
      "example": "A small fintech startup wanting to offer payment services in the EU might spend EUR 500,000 per year on legal counsel, compliance staff, and reporting systems before earning a single euro in revenue. A large bank spreads similar fixed costs across millions of customers, paying just cents per account."
    },
    {
      "id": "composability",
      "term": "Composability",
      "definition": "Ability of different DeFi protocols to interact and build on each other.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "Composability is the ability of different blockchain protocols and smart contracts (automated programs on blockchains) to interconnect and build on each other like LEGO blocks, without needing permission or custom integrations. In DeFi (Decentralized Finance), one protocol can automatically use another's services—for example, a lending protocol can plug into a price oracle (real-world data provider) or a decentralized exchange. This creates network effects where each new protocol adds value to existing ones. Composability works because blockchain code is public, standardized, and always accessible, unlike traditional finance where banks use proprietary closed systems.",
      "example": "Yearn Finance automatically moves your funds between Aave, Compound, and Curve protocols to find the best interest rates, all without you doing anything. You deposit once, and Yearn's smart contracts interact with multiple other protocols on your behalf. This is like having a single app that automatically shops between banks for the best savings rate and moves your money overnight—but in traditional finance, APIs (programming interfaces) and legal agreements make this nearly impossible."
    },
    {
      "id": "constant-product-formula",
      "term": "Constant Product Formula",
      "definition": "AMM pricing rule x · y = k that automatically adjusts prices as traders swap tokens.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "The constant product formula is the mathematical rule x times y equals k that Automated Market Makers (AMMs) use to set prices automatically. Here, x and y represent the quantities of two different tokens in a liquidity pool, and k is a constant number that never changes. When you swap tokens, you add one token (increasing its quantity) and remove the other (decreasing its quantity), but the product must stay equal to k. This creates a beautiful property: as you buy more of one token, it becomes progressively more expensive because the formula forces the price to rise as the pool balance becomes more lopsided. The formula eliminates the need for a traditional order book and ensures liquidity is always available at some price.",
      "example": "A pool with 100 ETH and 200,000 USDC has k = 20,000,000. If you buy 10 ETH, the pool has 90 ETH left, so it needs 222,222 USDC to maintain k (90 times 222,222 equals 20,000,000). You must deposit 22,222 USDC to extract 10 ETH, paying roughly 2,222 per ETH."
    },
    {
      "id": "consumer-protection",
      "term": "Consumer Protection",
      "definition": "Rules and standards designed to shield individuals from exploitation, fraud, or harm.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Consumer protection encompasses the rules, standards, and enforcement mechanisms designed to shield individuals from exploitation, fraud, misleading information, or unfair practices by businesses. In traditional finance, this includes requirements like clear disclosure of fees, cooling-off periods for contracts, deposit insurance (government guarantees on bank savings up to a limit), and complaint resolution procedures. In digital finance, consumer protection extends to issues like ensuring exchanges do not misuse customer funds, requiring clear risk warnings on volatile crypto assets, and establishing rules about who is liable when things go wrong. The challenge is balancing protection with allowing innovation.",
      "example": "The SEC (U.S. Securities and Exchange Commission) requires that investment products disclose risks in plain language. If a DeFi platform advertises '20% guaranteed returns' without disclosing the risks of smart-contract failure or token collapse, regulators may intervene to protect consumers from misleading claims."
    },
    {
      "id": "contagion",
      "term": "Contagion",
      "definition": "Spread of financial distress from one institution or market to others through direct links or sentiment.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "Contagion is the process by which financial distress or failure spreads from one institution, market, or country to others that initially seemed healthy, like a disease spreading through a population. This happens through direct connections (one bank owes money to another), shared exposures (many institutions holding the same risky assets), or panic-driven behavior (investors selling everything when one market crashes). Contagion is a major concern for regulators because it can transform a localized problem into a systemic crisis threatening the entire financial system. Interconnectedness magnifies contagion risk—the more institutions depend on each other, the faster problems spread.",
      "example": "In 2022, the collapse of crypto hedge fund Three Arrows Capital (3AC) triggered contagion: lending platform Celsius froze withdrawals because 3AC owed them money; crypto lender Voyager went bankrupt from 3AC exposure; and BlockFi needed a bailout from FTX. When FTX itself collapsed months later, the contagion spread further. This mirrors how Lehman Brothers' 2008 bankruptcy triggered panic across traditional financial markets."
    },
    {
      "id": "correspondent-banking",
      "term": "Correspondent Banking",
      "definition": "An arrangement where one bank provides services on behalf of another, commonly used for international payments. Banks hold accounts with each other to facilitate cross-border payments through intermediaries.",
      "lessons": [
        "L03",
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "Correspondent banking is an arrangement where one bank (the correspondent) provides services on behalf of another bank (the respondent), commonly used for international payments. Banks cannot directly access every country's payment system, so they hold accounts with each other to facilitate cross-border transactions through intermediary banks. When you send money internationally, it often passes through multiple correspondent banks before reaching the recipient, with each intermediary taking a fee. This system creates long chains of banks, which increases costs, delays, and opacity in international payments. The number of correspondent banking relationships has declined in recent years due to compliance costs and risk concerns.",
      "example": "If a small bank in Kenya wants to send USD to the USA but has no direct access to the US payment system, it uses a larger correspondent bank like Citibank that has accounts in both countries. Citibank acts as the intermediary, charging fees for providing this access and taking on the compliance burden of verifying the transaction meets anti-money laundering rules."
    },
    {
      "id": "credit-supply",
      "term": "Credit Supply",
      "definition": "The total amount of loans banks can offer to businesses and people.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "Credit supply refers to the total volume of loans that banks are able and willing to offer to businesses and individuals. Banks create loans using their customers' deposits as a funding base -- when you deposit EUR 1,000, the bank can lend most of that to someone else. Credit supply matters for CBDC design because if people move large amounts of money from bank deposits into CBDC, banks lose their lending base and may have to reduce credit supply. Less lending means fewer mortgages, fewer business expansion loans, and potentially slower economic growth. Central banks must balance CBDC adoption against preserving the banking system's ability to fund the real economy.",
      "example": "A small bank has EUR 100 million in customer deposits and lends EUR 80 million of that as mortgages and business loans. If 30% of depositors move their savings to a digital euro, the bank's deposit base falls to EUR 70 million, and it may have to cut lending to EUR 56 million -- restricting credit for local businesses."
    },
    {
      "id": "critical-mass",
      "term": "Critical Mass",
      "definition": "Minimum number of users needed before a network becomes self-sustaining---typically around 16% adoption. Minimum adoption level needed for network effects to become self-sustaining.",
      "lessons": [
        "L04",
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Critical mass is the minimum number of users a network needs before it becomes self-sustaining, meaning new users join on their own without heavy subsidies or marketing. Research suggests this threshold often falls around 10-20% of the potential user base. Below critical mass, the network is fragile because each user sees too few others to justify staying. Once the threshold is crossed, a virtuous cycle kicks in: more users attract even more users, and growth accelerates on its own. Getting to critical mass is the hardest and most expensive phase for any platform.",
      "example": "A messaging app like WhatsApp is useless if only 5 of your 200 contacts use it. Once about 30-40 contacts join, you start checking it daily and telling others, pushing it past critical mass."
    },
    {
      "id": "cross-side-externalities",
      "term": "Cross-Side Externalities",
      "definition": "Effects on one user group when the other group grows.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Cross-side externalities are the effects that one group of users on a platform has on a completely different group of users on the same platform. Unlike regular externalities (spillover effects on bystanders), cross-side externalities specifically describe the interdependence between two distinct user groups connected by a platform. When more users join on one side, the other side benefits or suffers. These effects are the engine that drives two-sided markets (platforms serving two different groups), because each side's value depends on how many people are on the other side.",
      "example": "When more restaurants join Uber Eats, customers get more food choices and use the app more. When more customers use Uber Eats, restaurants earn more revenue and want to stay on the platform. Each side's growth benefits the other."
    },
    {
      "id": "cryptocurrency",
      "term": "Cryptocurrency",
      "definition": "Digital asset using cryptography, not issued by government.",
      "lessons": [
        "L01"
      ],
      "category": "Foundations",
      "detailed": "A cryptocurrency is a digital asset (a form of money that exists only electronically) that uses cryptography to secure transactions and control the creation of new units. Unlike traditional currencies issued by governments (called fiat money), cryptocurrencies are not backed by a central authority like a central bank. Instead, they typically operate on decentralized networks using blockchain technology. The cryptographic algorithms ensure that transactions are secure, ownership is verifiable, and the supply of the currency follows predetermined rules rather than government policy.",
      "example": "Bitcoin is the first and most famous cryptocurrency. It has no physical bills or coins, exists only as digital records on its blockchain, and no government or company controls it. You can send Bitcoin to anyone in the world without going through a bank."
    },
    {
      "id": "dapps",
      "term": "dApps",
      "definition": "Decentralized applications built on blockchain platforms.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Decentralized applications (dApps) are software programs that run on a blockchain (a shared, tamper-resistant database spread across many computers) rather than on a single company's server. Because no single entity controls the underlying infrastructure, dApps can operate without a central authority deciding who can use them or changing the rules unilaterally. They typically use smart contracts (self-executing code stored on the blockchain) to automate their logic. Users interact with dApps through a crypto wallet, and every action is recorded transparently on the blockchain.",
      "example": "Uniswap is a dApp on Ethereum that lets anyone swap tokens without creating an account or providing identification. It processed over $1 trillion in trades by 2023, all governed by code rather than a company."
    },
    {
      "id": "deadweight-loss",
      "term": "Deadweight Loss",
      "definition": "Economic inefficiency representing value destroyed by regulation or market distortions (Harberger triangle).",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Deadweight loss is the economic value that is permanently destroyed -- not transferred to anyone -- when a market is prevented from reaching its natural equilibrium. Imagine regulation forces a tax or restriction that raises the cost of a product. Some buyers who would have purchased at the lower price now choose not to buy, and some sellers who would have sold at the lower price cannot profitably do so. The transactions that would have benefited both sides simply never happen. Economists visualize this as a triangle on a supply-and-demand graph (called a Harberger triangle). The key insight is that this value does not go to the government or anyone else -- it vanishes entirely.",
      "example": "If a country bans crypto exchanges, people who would have traded legally now either stop trading (losing potential gains) or move to unregulated offshore platforms. The economic value of those lost legitimate trades is the deadweight loss of the ban."
    },
    {
      "id": "death-spiral",
      "term": "Death Spiral",
      "definition": "Self-reinforcing collapse where falling prices trigger more selling.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "A death spiral is a self-reinforcing collapse where falling prices trigger more selling, which causes prices to fall further, creating a vicious cycle that accelerates until the asset becomes worthless. In algorithmic stablecoins, a death spiral occurs when the peg (target price) breaks and holders lose confidence in the system's ability to restore it. As people rush to sell, the algorithm creates new tokens to buy back the stablecoin and restore the peg, but this floods the market with tokens, driving their price down and making the problem worse. Each wave of selling increases panic, causing more selling, until confidence is completely destroyed and the system collapses.",
      "example": "In May 2022, TerraUSD lost its 1 USD peg and fell to 0.90 USD. Panicked holders sold, triggering the algorithm to mint billions of LUNA tokens to buy UST and restore the peg. This crashed LUNA from 80 USD to 0.0001 USD in 72 hours, destroying 40 billion USD in value as both UST and LUNA became worthless."
    },
    {
      "id": "decentralization",
      "term": "Decentralization",
      "definition": "Distribution of power away from single authority to many participants.",
      "lessons": [
        "L01"
      ],
      "category": "Foundations",
      "detailed": "Decentralization refers to the distribution of power, control, and decision-making away from a single central authority to many participants in a network. In finance, this means that instead of one institution (like a bank or government) controlling transactions and records, many independent parties share that responsibility. Each participant maintains a copy of the records and helps verify new transactions. This distribution reduces the risk that a single point of failure (one entity being hacked, going bankrupt, or acting maliciously) can compromise the entire system.",
      "example": "Traditional banking is centralized: your bank controls your account and can freeze it. Bitcoin is decentralized: thousands of computers worldwide maintain the ledger, so no single entity can shut it down or censor your transactions, though this comes at the cost of slower processing and higher energy use."
    },
    {
      "id": "defi",
      "term": "DeFi",
      "definition": "Decentralized Finance; blockchain financial services without intermediaries.",
      "lessons": [
        "L01"
      ],
      "category": "Foundations",
      "detailed": "DeFi (Decentralized Finance) refers to financial services built on blockchain platforms that operate without traditional intermediaries like banks, brokers, or exchanges. Instead of a company managing your money, smart contracts (self-executing computer programs on a blockchain) automatically execute transactions based on predefined rules. Users can lend, borrow, trade, earn interest, and access other financial services directly through software protocols. This removes the need to trust a central institution, though it introduces new technical and smart contract risks.",
      "example": "On a DeFi platform like Aave, you can deposit USD Coin (a stablecoin) and automatically earn interest from borrowers worldwide. No bank processes the loan, checks credit scores, or takes a cut as intermediary. The blockchain smart contract handles everything automatically based on supply and demand."
    },
    {
      "id": "deflationary",
      "term": "Deflationary",
      "definition": "Prices falling over time; fixed-supply currencies trend deflationary.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "Deflationary describes a currency where prices of goods and services fall over time, meaning each unit of the currency becomes more valuable and can buy more things as time passes. This typically happens with fixed-supply currencies (where no new money is created) because as the economy grows and produces more goods, the same amount of money chases more goods, making each unit more valuable. While this sounds good for holders, deflation can harm economic activity because people delay purchases expecting lower prices later, reducing spending and investment. Bitcoin is designed to be deflationary because its supply is capped at 21 million coins, so as adoption grows, each Bitcoin should theoretically become more valuable over time.",
      "example": "If Bitcoin were the global currency and a car costs 1 BTC today, in 10 years that same car might cost only 0.5 BTC because Bitcoin's value increased while car production stayed the same. Knowing this, people delay buying cars, which hurts car manufacturers and the economy."
    },
    {
      "id": "digital-finance",
      "term": "Digital Finance",
      "definition": "Financial services relying on digital infrastructure for value transfer.",
      "lessons": [
        "L01"
      ],
      "category": "Foundations",
      "detailed": "Digital finance encompasses all financial services and transactions that rely on digital infrastructure (computers, networks, and electronic systems) rather than physical cash or in-person interactions. This includes online banking, mobile payment apps, digital currencies, electronic trading platforms, and blockchain-based systems. Digital finance enables faster, cheaper, and more accessible financial services by automating processes, reducing paperwork, and allowing people to transact across distances instantly. It ranges from traditional banks offering online services to completely new models like cryptocurrencies and DeFi protocols.",
      "example": "When you pay with Apple Pay instead of cash, check your bank balance on a mobile app instead of visiting a branch, or buy stocks through Robinhood instead of calling a broker, you are using digital finance. Even traditional banks like Chase now conduct over 60% of transactions digitally."
    },
    {
      "id": "digital-finance-trilemma",
      "term": "Digital Finance Trilemma",
      "definition": "Trade-off between decentralization, efficiency, and security/compliance.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "The digital finance trilemma states that financial systems can achieve at most two of three desirable properties simultaneously: decentralization (no single entity controls the system), efficiency (fast, cheap transactions), and security/compliance (protecting users and meeting regulations like anti-money laundering rules). For example, Bitcoin prioritizes decentralization and security but sacrifices efficiency with slow, expensive transactions. Traditional banks maximize efficiency and compliance but are centralized. This trade-off is similar to the famous blockchain trilemma (decentralization, security, scalability) but focuses specifically on financial system design. Regulators and innovators constantly seek to navigate or overcome this constraint.",
      "example": "Bitcoin is decentralized and secure but processes only 7 transactions per second with high fees. PayPal is efficient and compliant but centralized—PayPal controls your account and can freeze it. Privacy-focused coin Monero is decentralized and efficient but struggles with compliance since its anonymity features attract regulatory scrutiny. Stablecoin USDC aims for efficiency and compliance but sacrifices decentralization since Circle (the issuer) can freeze wallets."
    },
    {
      "id": "disintermediation",
      "term": "Disintermediation",
      "definition": "Removal or reduction of intermediaries like banks from financial transactions.",
      "lessons": [
        "L01",
        "L08"
      ],
      "category": "Foundations",
      "detailed": "Disintermediation is the removal or reduction of intermediaries (middlemen) from financial transactions. Traditionally, banks, payment processors, brokers, and other institutions stand between parties in financial dealings, verifying identities, processing transactions, and taking fees for their services. Digital technologies, especially blockchain, enable direct peer-to-peer transactions where parties can transact without these intermediaries. While this can reduce costs and increase speed, it also transfers responsibilities like fraud protection and dispute resolution from institutions to individual users.",
      "example": "Sending money internationally traditionally requires your bank, correspondent banks, and the recipient's bank (each taking fees and 3-5 days). Bitcoin enables Alice in Germany to send money directly to Bob in Kenya in minutes with lower fees, bypassing all banking intermediaries, though Bob must understand how to secure his Bitcoin wallet."
    },
    {
      "id": "dns",
      "term": "DNS (Deferred Net Settlement)",
      "definition": "System accumulating transactions and settling net positions at end of day, requiring less liquidity but more risk.",
      "lessons": [
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "Deferred Net Settlement (DNS) is a payment system that accumulates transactions throughout the day and settles only the net positions (the difference between what each bank owes and is owed) at the end of the day. Instead of transferring money for every single transaction, banks keep a running tally and only move the final balance. This dramatically reduces the amount of money banks need to hold ready (liquidity) compared to settling each transaction individually. However, it creates settlement risk, meaning if one bank fails during the day before settlement occurs, other banks may not receive the money they are owed. DNS systems are common for retail payments where individual transactions are small.",
      "example": "Bank A processes 1000 payments totaling EUR 500,000 to Bank B during the day, while Bank B sends 800 payments totaling EUR 450,000 to Bank A. Instead of transferring money 1800 times, the DNS system nets these out, and only EUR 50,000 moves from Bank A to Bank B at 5pm settlement time."
    },
    {
      "id": "dollarization",
      "term": "Dollarization",
      "definition": "Country adopting foreign currency instead of own.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "Dollarization occurs when a country officially or unofficially adopts a foreign currency (usually the US dollar but could be the euro or any stable foreign currency) instead of using its own national currency for everyday transactions, saving, and pricing goods. This typically happens when a country's own currency suffers from high inflation (rapid loss of value), hyperinflation (extreme inflation where prices double monthly or faster), or economic instability that destroys confidence in the local currency. By adopting a stable foreign currency, countries gain price stability and reduce transaction costs (costs of exchanging money), but they lose monetary sovereignty (the ability to control their own money supply and interest rates) and cannot use monetary policy (central bank tools like printing money) to respond to economic crises.",
      "example": "Ecuador officially dollarized in 2000 after inflation reached 96%, replacing the sucre with the US dollar. Prices stabilized immediately, but when the 2008 financial crisis hit, Ecuador could not print money or lower interest rates to stimulate the economy because those decisions are made by the US Federal Reserve."
    },
    {
      "id": "economies-of-scale",
      "term": "Economies of Scale",
      "definition": "Cost advantages achieved with increased production volume.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Economies of scale occur when a company's average cost per unit drops as it produces or serves more. This happens because certain expenses -- such as office rent, software licenses, or management salaries -- stay roughly the same whether you serve 1,000 customers or 1,000,000. Spreading these fixed costs over more units makes each unit cheaper. In financial regulation, economies of scale matter because large firms absorb compliance costs more easily than small ones. A bank with ten million customers might spend USD 100 million on compliance -- just USD 10 per customer -- while a startup with 10,000 customers spending USD 1 million pays USD 100 per customer for the same regulatory burden.",
      "example": "Visa processes over 65,000 transactions per second. Its cost per transaction is fractions of a cent because the massive network infrastructure cost is spread over billions of transactions. A small payment startup processing just thousands of transactions pays far more per transaction for similar security and compliance systems."
    },
    {
      "id": "externality",
      "term": "Externality",
      "definition": "Cost or benefit affecting parties not directly involved in a transaction or outside a transaction.",
      "lessons": [
        "L01",
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "An externality is a cost or benefit that affects someone who was not part of the original transaction. A negative externality imposes costs on bystanders -- like a factory polluting a river that others rely on for drinking water. A positive externality provides benefits to outsiders -- like a person getting vaccinated, which also protects unvaccinated people nearby. Markets on their own fail to account for externalities because the buyers and sellers do not bear the full consequences of their actions. This is one of the main reasons governments intervene with regulations, taxes, or subsidies to push markets toward outcomes that are better for society as a whole.",
      "example": "When a cryptocurrency exchange suffers a massive hack, the price drop hurts all holders of that cryptocurrency, not just the exchange's customers. The exchange's poor security imposed a negative externality on the broader market. Regulators respond by requiring minimum security standards for all exchanges."
    },
    {
      "id": "extraterritorial-jurisdiction",
      "term": "Extraterritorial Jurisdiction",
      "definition": "Applying domestic laws to foreign entities accessing domestic markets.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Extraterritorial jurisdiction is when a country applies its own laws to companies or individuals located in other countries, typically because those foreign entities serve the first country's citizens or use its financial infrastructure. This is common in finance because money flows across borders easily, especially in digital finance where a crypto exchange based in Country A can serve users in Country B with just an internet connection. Regulators argue that if foreign firms want access to their domestic customers, those firms must play by domestic rules. This creates complex overlapping obligations for global companies, who may face contradictory requirements from multiple jurisdictions simultaneously.",
      "example": "The U.S. SEC has sued foreign crypto exchanges for offering unregistered securities to American users, even though the exchanges were headquartered outside the United States. Similarly, the EU's MiCA regulation applies to any crypto firm serving EU customers, regardless of where that firm is based."
    },
    {
      "id": "fatf",
      "term": "FATF (Financial Action Task Force)",
      "definition": "Global standard-setter for AML/CFT policies and international coordination.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "The Financial Action Task Force (FATF) is an intergovernmental organization that sets global standards for combating money laundering and terrorist financing (collectively called AML/CFT -- Anti-Money Laundering / Combating the Financing of Terrorism). Founded in 1989, it does not directly enforce laws but publishes recommendations that its 39 member countries are expected to adopt. FATF periodically reviews each country's compliance and can place non-compliant nations on a \"grey list\" (increased monitoring) or \"black list\" (high-risk), which makes it harder and more expensive for those countries to participate in global finance. Its recommendations heavily shape crypto regulation worldwide.",
      "example": "When FATF issued its 'Travel Rule' guidance requiring crypto exchanges to share sender and receiver information for transactions above USD 1,000, exchanges worldwide had to build new compliance systems. Countries like Pakistan that appear on the FATF grey list face higher transaction costs and reduced access to international banking."
    },
    {
      "id": "fiat-backed-stablecoin",
      "term": "Fiat-Backed Stablecoin",
      "definition": "Stablecoin backed 1:1 by fiat reserves.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "A fiat-backed stablecoin is a cryptocurrency that maintains stable value by holding traditional fiat money (government-issued currency like USD or EUR) in reserve accounts at banks on a 1:1 basis. For every stablecoin issued, the issuer holds 1 USD (or 1 EUR) in a bank account or short-term government securities (low-risk investments like Treasury bills). Users can redeem their stablecoins for the underlying fiat currency at any time, which maintains the peg (target exchange rate). This model depends on trust that the issuer actually holds the reserves and will honor redemptions. Regular audits (independent financial examinations) provide transparency about reserve holdings.",
      "example": "Tether (USDT) claims to hold 1 USD in reserves for each USDT issued, making 1 USDT always worth approximately 1 USD. If you hold 100 USDT, you can theoretically redeem it for 100 USD from Tether. This allows cryptocurrency users to avoid volatility without converting to traditional bank accounts."
    },
    {
      "id": "fiat-money",
      "term": "Fiat Money",
      "definition": "Government-issued currency not backed by physical commodity.",
      "lessons": [
        "L01"
      ],
      "category": "Foundations",
      "detailed": "Fiat money is government-issued currency that has value because the government declares it legal tender (must be accepted for debts and taxes) and people trust it, not because it is backed by a physical commodity like gold or silver. The term \"fiat\" comes from Latin meaning \"let it be done,\" reflecting that this money exists by government decree. Central banks can create or destroy fiat money to manage the economy, adjusting interest rates and money supply. All modern major currencies—US dollar, euro, British pound, Japanese yen—are fiat money.",
      "example": "A 20 EUR banknote costs only a few cents to print but is worth 20 EUR because the European Central Bank declares it legal tender and people trust they can use it to buy goods, pay taxes, and settle debts. Unlike gold coins, it has no intrinsic value beyond the paper it is printed on."
    },
    {
      "id": "financial-inclusion",
      "term": "Financial Inclusion",
      "definition": "Ensuring all people have access to useful and affordable financial services---1.4 billion adults lack bank accounts.",
      "lessons": [
        "L03",
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "Financial inclusion means ensuring all people have access to useful and affordable financial services such as bank accounts, payments, savings, credit, and insurance. Approximately 1.4 billion adults worldwide lack access to basic banking services, particularly in developing countries, rural areas, and among women and low-income populations. Without access to formal financial services, people must rely on cash, informal lenders with high rates, or risky alternatives. Lack of financial inclusion perpetuates poverty by making it harder to save safely, access credit for business opportunities, or receive payments efficiently. Digital payment systems, mobile money, and central bank digital currencies are seen as potential tools to expand financial inclusion.",
      "example": "Before mobile money, a farmer in rural Kenya had to walk hours to the nearest bank branch and pay high fees to cash checks or send money to family. With M-Pesa mobile money, the farmer can now send and receive payments via text message using just a basic mobile phone, dramatically reducing transaction costs and time."
    },
    {
      "id": "fire-sales",
      "term": "Fire Sales",
      "definition": "Forced selling of assets at distressed prices, which can trigger further price declines.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "Fire sales occur when institutions are forced to sell assets rapidly at heavily discounted prices, typically during a liquidity crisis (needing cash urgently) or to meet margin calls (demands for additional collateral). These sales happen at prices far below the assets' fundamental value because there isn't enough time to find willing buyers, and desperate sellers accept whatever bids are available. Fire sales create a vicious cycle: the discounted sale prices reduce the market value of similar assets held by other institutions, triggering margin calls and more forced selling. This amplifies financial crises and can cause contagion as falling prices spread across interconnected markets.",
      "example": "During the March 2020 COVID-19 market panic, leveraged crypto traders faced margin calls and sold Bitcoin at 3,800 dollars—a 50 percent drop in days—even though Bitcoin recovered to over 60,000 dollars a year later. Similarly, in 2008, Lehman Brothers' bankruptcy forced fire sales of mortgage-backed securities at 20-30 cents on the dollar, depressing prices industry-wide and triggering more margin calls at other banks."
    },
    {
      "id": "flight-to-safety",
      "term": "Flight to Safety",
      "definition": "When investors move money from risky assets to safe ones during uncertainty---with CBDC, could mean moving from bank deposits to CBDC.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "Flight to safety describes the behavior where investors and savers rush to move their money from risky assets into safer ones during times of economic uncertainty or crisis. In the context of CBDCs, this creates a specific danger: because CBDC is guaranteed by the central bank (the safest institution in the financial system), people might rapidly withdraw deposits from commercial banks and convert them to CBDC at the first sign of banking trouble. This could trigger or accelerate a bank run (where too many people withdraw at once, causing the bank to collapse). CBDC designers must build in safeguards like holding limits to slow or prevent such panicked mass transfers.",
      "example": "During a financial crisis, if news breaks that a major bank might fail, depositors could instantly transfer their savings into digital euros with a few taps on their phone -- far faster than lining up at an ATM. A EUR 3,000 holding cap on CBDC would limit this rush."
    },
    {
      "id": "float",
      "term": "Float",
      "definition": "Money in transit between accounts---delay benefits whoever holds it (earns interest) at the other's expense.",
      "lessons": [
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "Float is money that is in transit between accounts during the time delay between when a payment is initiated and when it is actually settled. During this period, the money has left the payer's practical control but has not yet arrived in the payee's account. Whoever holds the float during this period can earn interest on it, creating an economic incentive around payment speed. In traditional banking, float can last several days for checks or international transfers. Payment companies and banks historically benefited from float by earning interest on money in transit. Faster payment systems and real-time settlement reduce float, which benefits consumers but reduces revenue for financial intermediaries.",
      "example": "You write a check for EUR 1000 on Monday, and the recipient deposits it Tuesday. Your bank does not deduct the money from your account until Thursday, and the recipient's bank does not credit their account until Friday. From Tuesday to Friday, that EUR 1000 is float, sitting in the banking system earning interest for the banks rather than either party."
    },
    {
      "id": "four-economic-lenses",
      "term": "Four Economic Lenses",
      "definition": "The four analytical frameworks: monetary economics, platform economics, market microstructure, and regulatory economics.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "The four economic lenses are complementary analytical frameworks used to understand digital finance systems from different perspectives. Monetary economics examines how money is created, how central banks operate, and how monetary policy (interest rate decisions) affects the economy. Platform economics analyzes network effects (value increasing with more users), two-sided markets (platforms connecting buyers and sellers), and winner-take-all dynamics. Market microstructure studies how trading actually happens: order matching, liquidity provision, price formation, and hidden costs like bid-ask spreads. Regulatory economics evaluates market failures (situations where markets don't work efficiently), policy interventions, and the effectiveness of rules. Together, these lenses provide comprehensive understanding of digital finance innovations.",
      "example": "To analyze stablecoin USDC, monetary economics asks whether it threatens central bank control and money creation; platform economics examines network effects as more merchants accept it; market microstructure studies how USDC maintains its 1-dollar peg through arbitrage trading; and regulatory economics debates whether Circle (the issuer) should face bank-like regulations. Each lens reveals different risks and opportunities."
    },
    {
      "id": "front-running",
      "term": "Front-Running",
      "definition": "Trading ahead of someone else's order to profit from the expected price change.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "Front-running is the practice of seeing someone else's pending trade and racing to execute your own trade first to profit from the price movement you know is coming. Imagine you are standing in line at a store, and someone behind you overhears you asking for the last discounted item. They sprint ahead, buy it first, and immediately resell it to you at a higher price. In traditional markets, this is often illegal because brokers have a duty to execute client orders first. In blockchain markets, front-running happens because all pending transactions sit in a public mempool before being included in a block, and anyone with faster technology or higher gas fees can jump ahead of you in line.",
      "example": "You submit a buy order for 100 ETH on Uniswap. A bot detects your pending transaction, submits its own buy for 50 ETH with a higher gas fee (executing first), which pushes the price up, then your order executes at the now-higher price, and the bot profits."
    },
    {
      "id": "fsb",
      "term": "FSB (Financial Stability Board)",
      "definition": "International body coordinating financial regulation to address systemic risks.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "The Financial Stability Board (FSB) is an international body that monitors the global financial system and makes recommendations to promote financial stability. Created in 2009 after the global financial crisis, it coordinates the work of national financial authorities and international standard-setting bodies. The FSB focuses on identifying systemic risks (threats that could bring down the entire financial system, not just one firm) and developing policies to address them. In digital finance, the FSB has published frameworks for regulating stablecoins and crypto-asset activities, particularly those large enough to pose risks to the broader financial system.",
      "example": "In 2023, the FSB published a global framework for regulating crypto-asset activities, recommending that stablecoins like Tether be subject to the same reserve and redemption requirements as traditional money market funds. Member countries then use these recommendations to shape their domestic laws."
    },
    {
      "id": "functional-regulation",
      "term": "Functional Regulation",
      "definition": "Regulating activities (lending, custody) rather than entity types.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Functional regulation means regulating financial activities based on what they do -- such as lending, taking deposits, or trading securities -- rather than what type of company performs them. Under this approach, a traditional bank offering crypto trading services and a crypto-native exchange offering the same service would both follow the same set of rules because the activity is identical. This contrasts with institutional regulation (regulating by entity type), where a bank and a tech company doing the same thing might face completely different rules. Functional regulation is increasingly favored in digital finance because the same activities often occur across very different types of institutions.",
      "example": "If a DeFi lending protocol lets users deposit funds and earn interest, functional regulation would require it to follow the same deposit-protection rules as a traditional bank, because the activity -- taking deposits and lending them out -- is functionally identical, regardless of whether it runs on a blockchain or in a bank branch."
    },
    {
      "id": "gas-fees",
      "term": "Gas Fees",
      "definition": "Transaction fees paid to blockchain validators for processing transactions.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "Gas fees are payments you make to validators (computers that process transactions) on a blockchain network like Ethereum to compensate them for the computational work of executing your transaction. Think of gas as the fuel that powers the blockchain: more complex transactions (like swapping tokens on Uniswap) require more computational steps and thus more gas. Gas fees are measured in two parts: the base fee (which is burned, meaning destroyed permanently) and the priority fee (a tip you pay to validators to process your transaction faster). When the network is congested, gas fees skyrocket because users compete by offering higher priority fees to get their transactions included in the next block.",
      "example": "A simple ETH transfer might cost 2 USD in gas fees during normal times, but swapping tokens on Uniswap could cost 50 USD, and during a market crash when everyone is panic-selling, gas fees can spike to 500 USD per transaction."
    },
    {
      "id": "greshams-law",
      "term": "Gresham's Law",
      "definition": "\"Bad money drives out good\"; overvalued currency circulates, undervalued hoarded.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "Gresham's Law states that when two forms of money are in circulation and one is perceived as more valuable (undervalued by official exchange rates) while the other is less valuable (overvalued), people will hoard the good money and spend the bad money, causing bad money to drive out good money from circulation. This happens because rational people keep assets they expect to appreciate (increase in value) and get rid of assets they expect to depreciate (decrease in value). The law applies when governments set fixed exchange rates that do not reflect market values, creating an incentive to game the system.",
      "example": "In the 1960s, US silver quarters had official face value of 0.25 USD but contained silver worth 0.40 USD due to rising silver prices. People hoarded the silver quarters and spent paper dollars instead. By 1965, silver quarters disappeared from circulation, and the US switched to cheaper copper-nickel coins."
    },
    {
      "id": "grey-listing",
      "term": "Grey-listing",
      "definition": "FATF designation of jurisdictions with strategic AML/CFT deficiencies, triggering enhanced scrutiny.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Grey-listing is a designation by the FATF (Financial Action Task Force, the global anti-money-laundering standard-setter) that a country has strategic deficiencies in its framework for fighting money laundering and terrorist financing. Being grey-listed does not mean a country is blacklisted or sanctioned, but it signals to banks and businesses worldwide that extra caution is needed when dealing with that country. In practice, grey-listed nations face higher transaction fees, longer processing times for international transfers, reduced foreign investment, and difficulty accessing correspondent banking services (arrangements where international banks process payments on behalf of local banks).",
      "example": "When South Africa was placed on the FATF grey list in 2023, its banks faced increased scrutiny from international partners, cross-border transactions slowed, and several foreign investors paused new commitments until the country addressed the identified deficiencies in its anti-money-laundering systems."
    },
    {
      "id": "helicopter-money",
      "term": "Helicopter Money",
      "definition": "Direct cash transfers from central bank to citizens, bypassing banks---named for the image of dropping money from helicopters.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "Helicopter money is a monetary policy concept where the central bank distributes cash directly to every citizen, bypassing commercial banks and the normal lending process. The term comes from economist Milton Friedman's thought experiment of dropping money from a helicopter to stimulate spending. With physical cash, this is logistically impractical, but CBDC makes it technically possible -- a central bank could credit every citizen's CBDC wallet instantly. This approach could be used during severe economic downturns when traditional tools like lowering interest rates are no longer effective. The policy is controversial because it blurs the line between monetary policy (managed by central banks) and fiscal policy (managed by elected governments).",
      "example": "During a deep recession, the Fed could deposit USD 1,000 directly into every American's CBDC wallet overnight -- no checks to mail, no bank intermediaries needed. All 330 million adults would receive the stimulus simultaneously, potentially jumpstarting consumer spending within days."
    },
    {
      "id": "hodl",
      "term": "HODL (Hold On for Dear Life)",
      "definition": "Crypto slang for holding assets long-term instead of trading; resisting sales despite price drops.",
      "lessons": [
        "L02",
        "L06"
      ],
      "category": "Foundations",
      "detailed": "HODL is crypto slang meaning to hold cryptocurrency assets long-term rather than selling them, regardless of price volatility (rapid price swings up and down). The term originated from a 2013 Bitcoin forum post where a user misspelled \"hold\" while drunk, and the community embraced it as \"Hold On for Dear Life.\" HODLers believe in the long-term value appreciation of their assets and resist the temptation to sell during market downturns or panic. This strategy contrasts with active trading and reflects a conviction about eventual price increases despite short-term turbulence.",
      "example": "When Bitcoin dropped from 60,000 USD to 30,000 USD in mid-2021, many investors panicked and sold at a loss. HODLers kept their Bitcoin, believing it would recover. Those who held saw Bitcoin later reach new highs above 69,000 USD by November 2021, validating their patience."
    },
    {
      "id": "ico",
      "term": "ICO",
      "definition": "Initial Coin Offering---token fundraising mechanism for blockchain projects.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "An Initial Coin Offering (ICO) is a fundraising method where a blockchain project sells newly created tokens to early investors in exchange for established cryptocurrencies like Bitcoin or Ethereum, or sometimes traditional money. It is similar to an IPO (initial public offering, where a company sells shares to the public for the first time), but typically with far less regulation and no ownership stake in a company. Instead, buyers receive tokens that may grant access to a future service or rise in value if the project succeeds. The ICO boom of 2017 raised billions but also produced many scams and failures.",
      "example": "Ethereum raised about $18 million in its 2014 ICO by selling ETH tokens at roughly $0.31 each. Those tokens later exceeded $4,000, but many other ICO projects from the same era went to zero."
    },
    {
      "id": "impermanent-loss",
      "term": "Impermanent Loss",
      "definition": "Loss LPs experience when asset prices diverge from deposit ratio, compared to simply holding.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "Impermanent loss is the hidden cost liquidity providers (LPs) pay when they deposit tokens into an AMM liquidity pool. It occurs when the price ratio of the two tokens changes compared to when you deposited them. Because the AMM rebalances your holdings using the constant product formula, you end up with more of the token that fell in price and less of the token that rose in price, compared to if you had simply held both tokens in your wallet. It is called \"impermanent\" because if prices return to the original ratio, the loss disappears. But if you withdraw while prices are different, the loss becomes permanent. LPs accept this risk in exchange for earning trading fees from the pool.",
      "example": "You deposit 1 ETH and 2,000 USDC when ETH = 2,000 USD. ETH doubles to 4,000 USD. The AMM rebalances to 0.707 ETH and 2,828 USDC (worth 5,656 USD total). But holding would give you 1 ETH and 2,000 USDC (worth 6,000 USD). You lost 344 USD to impermanent loss."
    },
    {
      "id": "inflation-tax",
      "term": "Inflation Tax",
      "definition": "Hidden tax reducing purchasing power when government prints money.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "The inflation tax is an implicit (hidden) tax that governments impose on holders of cash and savings when they print money or increase the money supply faster than economic growth. When new money is created without corresponding growth in goods and services, each existing unit of money becomes less valuable, meaning prices rise and your savings buy less than before. This is called a tax because it transfers purchasing power (the ability to buy things) from citizens to the government without explicitly collecting taxes. Governments resort to the inflation tax when they cannot or will not raise regular taxes or borrow money to finance spending. It disproportionately hurts poor people who hold cash and have fewer options to protect their wealth through investments.",
      "example": "Venezuela's government printed massive amounts of bolivars to pay for spending without raising taxes. Between 2016 and 2019, inflation exceeded 1,000,000%, meaning savings of 1 million bolivars became worth 1 bolivar in purchasing power. Citizens lost nearly all their wealth while the government gained resources by printing money."
    },
    {
      "id": "information-asymmetry",
      "term": "Information Asymmetry",
      "definition": "Situation where one party in a transaction has more or better information than another, potentially leading to adverse selection or moral hazard.",
      "lessons": [
        "L07",
        "L08"
      ],
      "category": "Regulatory Economics",
      "detailed": "Information asymmetry exists when one party in a transaction has more or better information than the other party. This imbalance can lead to two major problems: adverse selection (before a deal, the less-informed party attracts bad counterparts -- like an insurer who cannot distinguish healthy from sick applicants) and moral hazard (after a deal, the better-informed party takes hidden risks -- like a driver who drives recklessly after buying insurance). In digital finance, information asymmetry appears when project insiders know their token is worthless while investors do not, or when a borrower on a DeFi platform knows they will default but the lender cannot see this.",
      "example": "A crypto project team knows their code has a critical bug but continues selling tokens to the public. Buyers, lacking access to this insider knowledge, purchase tokens at full price. This information asymmetry harms buyers and is exactly the type of problem that disclosure regulations aim to prevent."
    },
    {
      "id": "institutional-regulation",
      "term": "Institutional Regulation",
      "definition": "Regulating entity types with clear jurisdictional boundaries.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Institutional regulation means assigning regulatory responsibility based on what type of entity a company is -- for example, banks are overseen by banking regulators, insurance companies by insurance regulators, and securities firms by securities regulators. Each entity type has its own dedicated supervisor with clear jurisdictional boundaries. This approach works well when financial activities map neatly to specific institution types, but it struggles with digital finance, where a single crypto platform might simultaneously act as a bank (holding deposits), an exchange (facilitating trades), and an investment advisor (recommending assets). Gaps and overlaps emerge when one entity performs activities spanning multiple regulatory categories.",
      "example": "In the United States, banks are regulated by the OCC (Office of the Comptroller of the Currency), while securities firms answer to the SEC. A crypto exchange like Coinbase that offers both trading and custody services may need to satisfy multiple institutional regulators, each with different and sometimes conflicting requirements."
    },
    {
      "id": "interbank-settlement",
      "term": "Interbank Settlement",
      "definition": "The process by which banks transfer money between themselves to complete transactions.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "Interbank settlement is the process by which banks transfer money between each other to complete transactions initiated by their customers. When you send money to someone at a different bank, your bank does not physically hand cash to their bank. Instead, both banks adjust their reserve accounts at the central bank -- your bank's balance goes down and the recipient's bank's balance goes up. This settlement process is the plumbing of the financial system and currently happens through systems like TARGET2 in Europe or Fedwire in the US. Wholesale CBDCs could modernize this process by enabling faster, cheaper, and potentially 24/7 interbank settlement using digital currency technology.",
      "example": "When you transfer EUR 500 from your Deutsche Bank account to a friend at BNP Paribas, the two banks settle through the ECB's TARGET2 system: Deutsche Bank's reserve account is debited EUR 500 and BNP Paribas's is credited EUR 500. A wholesale CBDC could make this happen in seconds instead of hours."
    },
    {
      "id": "interchange-fee",
      "term": "Interchange Fee",
      "definition": "Fee paid by merchant's bank to cardholder's bank for each card transaction---funds rewards programs.",
      "lessons": [
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "An interchange fee is a fee paid by the merchant's bank (acquirer) to the cardholder's bank (issuer) for each card transaction, typically ranging from 1% to 3% of the transaction value. This fee is set by the card networks like Visa and Mastercard and is ultimately passed on to merchants, who pay it as part of their merchant service fees. Interchange fees fund credit card rewards programs, fraud protection, and card issuer profits. Merchants cannot usually negotiate these fees and typically pass the costs to consumers through higher prices. Many countries regulate interchange fees because they are perceived as anti-competitive, with the European Union capping them at 0.2% for debit and 0.3% for credit cards.",
      "example": "When you use your rewards credit card to buy EUR 100 of groceries, the grocery store pays approximately EUR 2 in interchange fees to your bank. Your bank uses this revenue to fund the cash-back or airline miles rewards you earn, creating a subsidy where people who pay cash effectively subsidize rewards for credit card users."
    },
    {
      "id": "interoperability",
      "term": "Interoperability",
      "definition": "Ability of different financial systems and protocols to work together seamlessly.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "Interoperability is the capacity of different blockchain networks, financial protocols, or payment systems to exchange information and value seamlessly without requiring users to understand technical differences or manually convert between formats. High interoperability means you can send money from Bitcoin to Ethereum or use your bank account to directly purchase assets on a DeFi protocol. Lack of interoperability fragments markets, creates inefficiencies, and locks users into specific ecosystems. Solutions include bridges (protocols connecting different blockchains), wrapped assets (tokenized versions of assets from other chains), and standardized protocols. Interoperability is crucial for digital finance to compete with the relatively seamless experience of traditional payment networks.",
      "example": "Today, sending money from Bitcoin to Ethereum requires multiple steps: sell Bitcoin for dollars on an exchange, buy Ethereum with those dollars, then withdraw to your Ethereum wallet—each step taking time and fees. True interoperability would let you send Bitcoin directly to an Ethereum address instantly. Projects like Polkadot and Cosmos aim to enable this, while wrapped Bitcoin (WBTC) provides partial interoperability by creating an Ethereum-compatible version of Bitcoin."
    },
    {
      "id": "issuer",
      "term": "Issuer",
      "definition": "Bank that provides cards to consumers and extends credit.",
      "lessons": [
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "An issuer is a bank or financial institution that provides payment cards (debit or credit) to consumers and extends credit to cardholders. The issuer maintains the customer relationship, sets credit limits, handles billing and collections, and bears the risk if the cardholder does not pay. When you use your card, the issuer receives the interchange fee from the merchant's bank and must pay you any rewards you earn. Issuers make money from interchange fees, interest on credit card balances, and annual fees. They compete for customers by offering attractive rewards programs, lower interest rates, or other benefits. This is the opposite side of card transactions from the acquirer, which works with merchants.",
      "example": "Chase Bank is the issuer of your Visa credit card. When you make a purchase, Chase verifies you have available credit, approves the transaction, charges it to your account, sends you a monthly bill, and collects interest if you carry a balance. Chase also credits you with rewards points and receives interchange fees from merchants where you shop."
    },
    {
      "id": "kyc",
      "term": "KYC (Know Your Customer)",
      "definition": "The process of verifying the identity of customers, required by financial regulations to prevent fraud and money laundering.",
      "lessons": [
        "L03",
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Know Your Customer (KYC) is the process financial institutions use to verify the identity of their clients before and during the business relationship. At its simplest, KYC means checking a government-issued ID and proof of address when someone opens an account. More advanced KYC involves ongoing monitoring of transactions, checking customers against sanctions lists (government lists of people or organizations that are banned from financial services), and assessing the risk level of each customer based on their profile and behavior. KYC is a cornerstone of anti-money-laundering (AML) compliance and applies to banks, exchanges, and increasingly to crypto platforms that handle fiat currency or large transaction volumes.",
      "example": "When you sign up for a crypto exchange like Binance, you must upload a photo of your passport, take a selfie for facial matching, and sometimes provide proof of your home address. This KYC process is why anonymous accounts are being phased out on major regulated exchanges worldwide."
    },
    {
      "id": "layer-1",
      "term": "Layer 1 (L1)",
      "definition": "Base blockchain protocols (e.g., Ethereum, Bitcoin).",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Layer 1 refers to the base-level blockchain protocol that processes and records transactions on its own without relying on any other network. Think of it as the foundation of a building: everything else is built on top of it. Layer 1 blockchains define the core rules for how transactions are validated, how new blocks of data are added, and how the network reaches agreement (consensus) among participants. Because every transaction must be verified by the entire network, Layer 1 chains often face trade-offs between security, speed, and decentralization (spreading control across many participants).",
      "example": "Bitcoin and Ethereum are Layer 1 blockchains. Ethereum processes roughly 15-30 transactions per second on its base layer, compared to Visa's capacity of about 65,000 per second."
    },
    {
      "id": "layer-2",
      "term": "Layer 2 (L2)",
      "definition": "Scaling solutions built on top of Layer 1 blockchains.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Layer 2 refers to secondary networks or technologies built on top of a Layer 1 blockchain to increase its speed and reduce costs without sacrificing security. They work by processing many transactions off the main chain (away from the base blockchain) and then periodically posting a compressed summary back to Layer 1 for final verification. This is like handling routine paperwork in a branch office and only sending the final signed documents to headquarters. Layer 2 solutions let blockchains serve millions of users while keeping the underlying network secure and decentralized.",
      "example": "Arbitrum and Optimism are Layer 2 networks on Ethereum that can process transactions for under $0.10, compared to $5-50 on Ethereum's base layer during busy periods. They inherit Ethereum's security guarantees."
    },
    {
      "id": "liability",
      "term": "Liability (Finance)",
      "definition": "A legal obligation to pay---if you hold CBDC, the central bank owes you that value.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "In finance, a liability is a legal obligation to pay a certain amount. When applied to money, the concept explains who ultimately guarantees its value. If you hold physical cash, the central bank has a liability to you -- it owes you that value. If you hold money in a bank account, the commercial bank has a liability to you -- it promises to give you that amount on demand. CBDC is a direct liability of the central bank, which is important because central banks cannot go bankrupt in their own currency (they can always create more). Commercial banks, by contrast, can fail, which is why bank deposits above certain limits are not fully guaranteed.",
      "example": "If you hold EUR 5,000 in a bank account, your bank owes you that money -- but if the bank collapses, you depend on deposit insurance (guaranteed up to EUR 100,000 in the EU). If you hold EUR 5,000 in a digital euro CBDC, the ECB itself owes you that money, and the ECB cannot go bankrupt."
    },
    {
      "id": "liquidation",
      "term": "Liquidation",
      "definition": "Forced sale of collateral when value drops below threshold.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "Liquidation is the automatic forced sale of a borrower's collateral (assets pledged as security) when its value falls below a required minimum threshold relative to the loan amount. This mechanism protects lenders from losses due to volatility (rapid price changes) in collateral values. In decentralized finance (DeFi) systems, liquidation happens automatically through smart contracts (self-executing code) without human intervention. When collateral value drops to the liquidation threshold (typically 120-150% of loan value), a liquidation bot (automated program) buys the collateral at a discount and repays the loan, keeping the difference as profit. Liquidation penalties (fees charged to borrowers) provide incentives for liquidators to act quickly and for borrowers to maintain healthy collateral ratios.",
      "example": "You deposit 10,000 USD worth of Ethereum to borrow 6,667 USD in DAI stablecoin (150% collateralization ratio). If Ethereum crashes and your collateral falls to 8,000 USD, your collateralization drops to 120%, triggering automatic liquidation. The system sells your Ethereum for 8,000 USD, repays your 6,667 USD loan, charges a 13% penalty (867 USD), leaving you with 466 USD instead of your original 10,000 USD."
    },
    {
      "id": "liquidity",
      "term": "Liquidity",
      "definition": "How easily an asset trades without affecting its price. Having cash available when needed---RTGS requires banks to hold more liquidity than netting systems.",
      "lessons": [
        "L01",
        "L04",
        "L06"
      ],
      "category": "Foundations",
      "detailed": "Liquidity refers to how easily and quickly an asset can be bought or sold in the market without causing a significant change in its price. High liquidity means you can trade large amounts without affecting the price much because there are many buyers and sellers ready to transact. Low liquidity means your trades move the price substantially, making it expensive to enter or exit positions. Liquidity is crucial for markets to function efficiently and for institutions to meet their payment obligations without delay. It also refers to having cash or easily-convertible assets available when needed.",
      "example": "Bitcoin is highly liquid: you can sell 10,000 USD worth instantly on major exchanges at the displayed price. A rare collectible NFT might be low liquidity: if you try to sell it quickly, you might only find one buyer willing to pay 50% of its last sale price."
    },
    {
      "id": "liquidity-mining",
      "term": "Liquidity Mining",
      "definition": "Distributing tokens to users who provide liquidity to protocols, accelerating adoption.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Liquidity mining is a strategy where a DeFi protocol (decentralized finance application) distributes free tokens to users who deposit their assets into the protocol's trading pools, providing the liquidity (readily available funds) that the platform needs to function. It is essentially a subsidy to attract capital quickly, similar to a bank offering a high introductory interest rate to attract new depositors. The distributed tokens often carry governance rights (voting power over the protocol's future) or can be sold for profit. Liquidity mining helped DeFi grow rapidly but can create mercenary capital that leaves when rewards dry up.",
      "example": "In 2020, Compound started distributing COMP tokens to anyone lending or borrowing on its platform. Within weeks, total deposits surged from $100 million to over $1 billion as users chased the token rewards."
    },
    {
      "id": "liquidity-provider",
      "term": "Liquidity Provider (LP)",
      "definition": "Party depositing assets into AMM pool to enable trading, earning fees in return.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "A Liquidity Provider (LP) is someone who deposits pairs of tokens into an AMM pool to enable trading. Think of LPs as the people who stock the shelves of a robot-run store: they provide inventory (token pairs like ETH and USDC) so that traders can come and swap tokens anytime. In return, LPs earn a share of the trading fees charged on every swap (typically 0.3% per trade on Uniswap). Being an LP is risky because you face impermanent loss if token prices diverge, and you also take on smart contract risk (the possibility that a bug in the code could drain the pool). LPs are essential to DeFi because without them, AMMs would have no liquidity and trading would be impossible.",
      "example": "Alice deposits 10 ETH and 20,000 USDC into a Uniswap pool, receiving LP tokens representing her 5% share. She earns 5% of all trading fees (0.3% per swap), but faces impermanent loss if ETH price changes significantly relative to USDC."
    },
    {
      "id": "liquidity-risk",
      "term": "Liquidity Risk",
      "definition": "Risk that an asset cannot be sold quickly without significant price impact.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "Liquidity risk is the danger that an asset cannot be quickly sold or converted to cash without accepting a significantly lower price than its fundamental value, or that an institution cannot meet short-term payment obligations when they come due. This risk has two dimensions: market liquidity risk (your assets are hard to sell quickly) and funding liquidity risk (you can't access cash to pay debts). High liquidity risk means that trying to exit a position rapidly causes massive price impact—the act of selling pushes prices down substantially. During crises, liquidity often evaporates suddenly as buyers disappear, transforming normally liquid assets into illiquid ones overnight.",
      "example": "In May 2022, stablecoin TerraUSD collapsed partly due to liquidity risk: when users tried to redeem billions of dollars simultaneously, there weren't enough buyers for the backing assets, causing a death spiral. In traditional finance, the 2008 crisis saw mortgage-backed securities become completely illiquid—banks couldn't sell them at any reasonable price. Money market funds face liquidity risk when everyone wants withdrawals simultaneously but the fund holds assets that take days to sell."
    },
    {
      "id": "lock-in",
      "term": "Lock-In",
      "definition": "Situation where switching costs make users captive to existing platform.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Lock-in occurs when the costs of switching away from a platform become so high that users are effectively trapped, even if a better alternative exists. These costs can be financial (losing purchased content), social (leaving behind your contact network), or technical (data stored in a proprietary format that competitors cannot read). Lock-in gives platforms enormous pricing power because users will tolerate fee increases or quality declines rather than bear the pain of switching. In crypto, lock-in can occur through token holdings, learned interfaces, or smart contract dependencies that tie a user's assets to one ecosystem.",
      "example": "If you have years of playlists, followers, and listening history on Spotify, switching to Apple Music means losing all that curation. The effort to rebuild keeps you locked in even if Apple offers a cheaper plan."
    },
    {
      "id": "market-failure",
      "term": "Market Failure",
      "definition": "Situation where free markets fail to allocate resources efficiently, justifying regulatory intervention.",
      "lessons": [
        "L01",
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "A market failure occurs when a free market, left on its own without government intervention, fails to allocate resources in a way that maximizes total benefit to society. Common causes include externalities (costs or benefits spilling over onto uninvolved parties), information asymmetry (one side knowing more than the other), public goods (things everyone benefits from but nobody wants to pay for, like national defense), and market power (monopolies charging excessive prices). Market failures provide the economic justification for regulation: if the market were working perfectly, there would be less need for rules. The goal of regulation is to correct these failures and move outcomes closer to what economists call efficiency.",
      "example": "Without regulation, a dominant crypto exchange could manipulate prices, hide fee structures, and refuse to honor withdrawals -- all because individual customers lack the power or information to protect themselves. The FCA (UK Financial Conduct Authority) steps in precisely because the market alone fails to prevent such abuses."
    },
    {
      "id": "market-microstructure",
      "term": "Market Microstructure",
      "definition": "How trading actually works at the detailed level: order matching, price formation, liquidity provision, and how trading mechanisms affect price formation and efficiency.",
      "lessons": [
        "L01",
        "L06",
        "L08"
      ],
      "category": "Market Microstructure",
      "detailed": "Market microstructure is the study of how trading actually works at the nuts-and-bolts level: how buy and sell orders are matched, how prices are formed, how liquidity is provided, and how the mechanics of the market affect outcomes like price efficiency and trader welfare. It zooms in on the plumbing of financial markets rather than big-picture questions like asset valuation. For example, microstructure economists care whether continuous trading or periodic auctions lead to better price discovery, whether payment for order flow harms retail investors, or how high-frequency traders affect market quality. In crypto, microstructure includes understanding AMM vs order book designs, MEV extraction, and how blockchain block times create unique trading dynamics.",
      "example": "A microstructure question: Does Uniswap's AMM (where prices adjust along a curve) or Binance's order book (where traders post bids and asks) lead to better prices for a 10,000 USD trade? Studies compare execution costs, price impact, and speed."
    },
    {
      "id": "medium-of-exchange",
      "term": "Medium of Exchange",
      "definition": "Money's function as accepted payment for transactions.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "A medium of exchange is anything widely accepted as payment for goods and services, allowing indirect exchange instead of barter (direct goods-for-goods exchange). Money serves as a medium of exchange by solving the double coincidence of wants problem, where both trading parties must simultaneously want what the other offers. A good medium of exchange must be widely accepted, easily divisible (can be broken into smaller units), portable (easy to carry), durable (does not deteriorate), and recognizable (easy to verify authenticity). When a currency fails as a medium of exchange due to hyperinflation (extreme inflation) or lack of acceptance, economic activity suffers because people revert to inefficient barter or alternative currencies.",
      "example": "In Venezuela during hyperinflation (2016-2019), the bolivar failed as a medium of exchange because its value changed hourly and vendors refused to accept it. People switched to US dollars, Colombian pesos, or Bitcoin for transactions, while bolivars were only used when no alternative existed."
    },
    {
      "id": "metcalfes-law",
      "term": "Metcalfe's Law",
      "definition": "A network's value grows with the square of its users: V ∝ n². 10x users means 100x value, explaining network dominance.",
      "lessons": [
        "L04",
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Metcalfe's Law states that the value of a network grows proportionally to the square of the number of its users, expressed as V = n^2, where V is value and n is the number of users. The reasoning is that each new user can connect with every existing user, so the number of possible connections grows much faster than the number of users. With 10 users there are 45 possible connections, but with 100 users there are 4,950. This explosive growth in connections explains why dominant networks become nearly impossible to displace: the value gap between a large and small network widens with every new user.",
      "example": "A phone network with 10 users has 45 possible connections (10 times 9 divided by 2). Double to 20 users and connections jump to 190, more than quadrupling. This is why Facebook with 3 billion users dwarfs smaller social networks in value."
    },
    {
      "id": "mev",
      "term": "MEV (Maximal Extractable Value)",
      "definition": "Profit extractable by reordering, inserting, or censoring transactions within a block.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "Maximal Extractable Value (MEV) is the profit that miners or validators can earn by strategically reordering, inserting, or censoring transactions within a blockchain block they are assembling. Think of validators as DJs who can rearrange the playlist of pending transactions before broadcasting them to the network. By seeing pending trades in the mempool, sophisticated bots can identify profitable opportunities like sandwich attacks (trading right before and after someone else to profit from the price movement they cause), arbitrage between decentralized exchanges, or liquidations of undercollateralized loans. MEV is controversial because it represents value extracted from ordinary users, often without their consent or knowledge, though it also serves efficiency purposes like liquidating risky loans quickly.",
      "example": "A validator sees your pending order to buy 100 ETH on Uniswap for 200,000 USDC. They insert their own bot's buy order before yours (front-run), pushing the price up, then insert a sell order after yours (back-run), capturing 5,000 USDC profit at your expense."
    },
    {
      "id": "mobile-money",
      "term": "Mobile Money",
      "definition": "Financial services via mobile phone without a bank account---M-Pesa in Kenya pioneered this model.",
      "lessons": [
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "Mobile money is a financial service that allows users to store, send, and receive money using their mobile phone without needing a traditional bank account. Users deposit cash with an agent, who credits their mobile account, and can then transfer money via text message to other users, who can withdraw cash from another agent. M-Pesa in Kenya pioneered this model in 2007 and has achieved massive adoption, especially in regions with low banking penetration but high mobile phone ownership. Mobile money dramatically reduces transaction costs and increases financial inclusion by leveraging existing mobile networks and agent networks instead of expensive bank branches. It has become essential for remittances, bill payments, and merchant transactions in many developing countries.",
      "example": "A construction worker in Nairobi uses M-Pesa to send 2000 Kenyan shillings (about USD 20) to his mother in a rural village. He visits a local shop that acts as an M-Pesa agent, gives them cash, and they credit his mobile account. He then sends the money via text message, and his mother visits her local agent to withdraw cash, all within minutes and for fees under 1%."
    },
    {
      "id": "monetary-economics",
      "term": "Monetary Economics",
      "definition": "Study of money creation, central banking, and monetary policy transmission.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "Monetary economics is the study of how money functions in an economy, including money creation (how new money enters circulation), the role of central banks (institutions controlling money supply and interest rates), inflation and deflation (rising or falling prices), and monetary policy transmission (how central bank decisions affect the broader economy through channels like bank lending). This field analyzes the velocity of money (how fast money circulates), quantity theory (the relationship between money supply and price levels), and trade-offs between different monetary regimes. Digital currencies challenge traditional monetary economics by enabling private money creation and potentially bypassing central bank control.",
      "example": "When the Federal Reserve (the U.S. central bank) lowers interest rates, monetary economics predicts banks will lend more, businesses will invest, and inflation may rise. Bitcoin challenges this framework by having a fixed supply (21 million coins maximum) instead of flexible central bank control—monetary economics helps us understand why this makes Bitcoin deflationary (prices in Bitcoin terms tend to fall over time) and why it struggles as a medium of exchange for everyday transactions."
    },
    {
      "id": "monetary-policy",
      "term": "Monetary Policy",
      "definition": "The central bank's decisions about interest rates and money supply to control inflation and support the economy.",
      "lessons": [
        "L03",
        "L08"
      ],
      "category": "CBDC",
      "detailed": "Monetary policy refers to the decisions a central bank makes about interest rates and the money supply in order to manage inflation (rising prices) and support economic growth. When the economy overheats with too much spending, the central bank raises interest rates to make borrowing more expensive, cooling demand. When the economy slumps, it lowers rates to encourage borrowing and spending. CBDC could give central banks a powerful new channel for monetary policy -- for example, paying interest directly on citizens' CBDC holdings or even applying negative interest rates (charging people to hold large balances) to encourage spending during downturns.",
      "example": "The ECB currently sets interest rates that affect banks, which then pass those rates on to customers. With a digital euro, the ECB could directly offer 0.5% interest on CBDC balances up to EUR 3,000, instantly incentivizing citizens to hold and spend digital euros -- bypassing banks entirely."
    },
    {
      "id": "monetary-sovereignty",
      "term": "Monetary Sovereignty",
      "definition": "A nation's ability to control its own money supply and monetary policy independently.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "Monetary sovereignty is a nation's ability to control its own currency, set its own interest rates, and manage its money supply independently. This power allows governments to respond to economic crises, control inflation, and finance public spending. Monetary sovereignty can be threatened when citizens adopt foreign currencies or private digital currencies (like stablecoins pegged to the US dollar) instead of the national currency. CBDCs are partly motivated by the desire to protect monetary sovereignty -- if a private company like Meta or a foreign government's digital currency becomes widely used domestically, the national central bank loses influence over its own economy.",
      "example": "If citizens in a small country like Uruguay start using a USD-pegged stablecoin for most daily transactions, the country's central bank can no longer effectively control inflation or stimulate the economy through interest rate changes. Launching a CBDC (digital Uruguayan peso) could help preserve that control."
    },
    {
      "id": "money-multiplier",
      "term": "Money Multiplier",
      "definition": "Bank lending amplifies deposits into larger money supply.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "The money multiplier describes how banks create money through fractional reserve banking, amplifying central bank money (base money or reserves) into a much larger money supply through repeated lending. When a central bank creates 100 EUR in reserves and banks are required to hold 10% reserves (reserve requirement ratio), banks can lend 90 EUR of every 100 EUR deposited. That 90 EUR gets deposited elsewhere and re-lent, creating a multiplicative effect. The money multiplier equals 1 divided by the reserve requirement ratio, so with 10% reserves, the multiplier is 10, meaning 100 EUR of reserves supports 1,000 EUR in total money supply. This mechanism gives central banks powerful leverage over the economy but also creates systemic fragility because money exists mostly as loan obligations, not physical currency.",
      "example": "The European Central Bank creates 1 billion EUR in reserves. With a 2% reserve requirement, banks can lend 980 million EUR. Those borrowers deposit the money, which gets re-lent at 98%, creating deposits of 960 million EUR. This process repeats until the original 1 billion EUR supports approximately 50 billion EUR in total money supply (multiplier of 50)."
    },
    {
      "id": "moral-hazard",
      "term": "Moral Hazard",
      "definition": "Taking excessive risk because someone else bears the cost (e.g., expecting bailouts).",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Moral hazard occurs when a person or institution takes on more risk than they normally would because someone else will bear the consequences if things go wrong. The classic example is insurance: once you have fire insurance, you might be less careful about fire safety because the insurance company pays for damage, not you. In finance, moral hazard arises when banks take excessive risks knowing the government will bail them out to prevent a financial crisis -- the profits go to the bank, but losses are absorbed by taxpayers. In digital finance, moral hazard can appear when a DeFi protocol promises to compensate users for losses, encouraging riskier behavior than the system was designed for.",
      "example": "During the 2008 financial crisis, large banks had taken enormous risks in mortgage lending. When they collapsed, governments bailed them out because they were 'too big to fail.' Knowing bailouts were likely had encouraged the risk-taking in the first place -- a textbook moral hazard cycle."
    },
    {
      "id": "multi-homing-costs",
      "term": "Multi-Homing Costs",
      "definition": "Costs of using multiple competing platforms simultaneously.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Multi-homing costs are the expenses and inconveniences of using multiple competing platforms at the same time rather than committing to just one. These costs include subscription fees, the time spent maintaining separate accounts, learning different interfaces, and splitting your data or social connections across platforms. When multi-homing costs are low, users easily try competitors and no single platform dominates. When multi-homing costs are high, users pick one platform and stick with it, which strengthens winner-take-all dynamics (where one platform captures most of the market).",
      "example": "A restaurant can easily list on both Uber Eats and DoorDash (low multi-homing cost). But a game developer building for both PlayStation and Xbox must write separate code, buy two dev kits, and manage two storefronts (high multi-homing cost)."
    },
    {
      "id": "nash-equilibrium",
      "term": "Nash Equilibrium",
      "definition": "Game theory outcome where no player can improve by changing strategy alone.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "A Nash equilibrium is a concept from game theory (the mathematical study of strategic decision-making) describing a situation where no participant can improve their outcome by changing their own strategy alone, assuming everyone else keeps doing what they are doing. It does not mean everyone is happy or that the outcome is optimal for society -- it just means nobody has a reason to unilaterally switch. In regulatory economics, Nash equilibrium helps explain why countries may maintain low regulatory standards even when global cooperation would be better: each country individually benefits from attracting business with lax rules, so no single country wants to tighten up first.",
      "example": "Two countries both know stricter crypto regulation would reduce fraud globally. But if only one tightens rules, exchanges simply move to the other country. Neither country acts alone, so both maintain weak regulation -- a Nash equilibrium that is bad for everyone but stable because neither side wants to move first."
    },
    {
      "id": "natural-monopoly",
      "term": "Natural Monopoly",
      "definition": "Market where one provider can serve everyone at lower cost than multiple competitors---common in payment infrastructure.",
      "lessons": [
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "A natural monopoly exists when a market is most efficiently served by a single provider because of high fixed costs and low marginal costs, meaning one company can serve everyone at lower cost than multiple competitors. Payment infrastructure often exhibits natural monopoly characteristics because building and maintaining a payment network requires massive upfront investment, but processing additional transactions costs very little. Once one network achieves dominance, it becomes increasingly difficult for competitors to justify building duplicate infrastructure. This creates a policy dilemma since monopolies can lead to high prices and lack of innovation, but forcing competition may result in inefficient duplication and higher overall costs. Many countries regulate natural monopolies or provide public alternatives to ensure fair access and pricing.",
      "example": "In many countries, the national card payment network like Visa or Mastercard acts as a near-monopoly because it would be wasteful for five different companies to each build separate networks of card readers, bank connections, and fraud systems. The dominant network gets stronger as more merchants and cardholders join, making it nearly impossible for new entrants to compete."
    },
    {
      "id": "negative-interest-rates",
      "term": "Negative Interest Rates",
      "definition": "A policy where depositors pay to keep money in accounts rather than earning interest---used to encourage spending.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "Negative interest rates are a policy where, instead of earning interest on your savings, you pay a fee for keeping money deposited. Central banks sometimes use this unconventional tool during severe economic downturns to discourage hoarding and encourage people to spend or invest. With physical cash, negative rates are hard to enforce because people can simply withdraw banknotes and store them. CBDC changes this equation: if money is purely digital, a central bank could programmatically apply a negative rate to CBDC holdings, making it costly to hoard digital cash. This is both a powerful policy tool and a politically sensitive concern that worries citizens about government overreach.",
      "example": "The ECB could set a -0.5% annual rate on digital euro balances above EUR 3,000. If you hold EUR 10,000 in CBDC, you would lose EUR 35 per year on the excess (0.5% of the EUR 7,000 above the threshold), nudging you to spend or invest rather than sit on idle savings."
    },
    {
      "id": "network-effects",
      "term": "Network Effects",
      "definition": "Phenomenon where a product or service becomes more valuable as more users join. Value of payment network increases as more users and merchants participate---why dominant networks stay dominant.",
      "lessons": [
        "L01",
        "L04",
        "L05",
        "L08"
      ],
      "category": "Platform Economics",
      "detailed": "Network effects occur when a product or service becomes more valuable to each user as more people use it. A phone is worthless if you are the only person who owns one, but extremely valuable when billions of people have phones. Network effects create a positive feedback loop (a self-reinforcing cycle): more users attract even more users, which makes the network more valuable, which attracts still more users. This dynamic explains why payment networks, social media, and blockchain platforms tend toward a small number of dominant players. Network effects are the single most important force in platform economics.",
      "example": "Instagram became more valuable as more friends joined because you could see more content and reach more people. By 2023 it had over 2 billion users, making it nearly impossible for a new photo-sharing app to compete."
    },
    {
      "id": "network-externality",
      "term": "Network Externality",
      "definition": "Benefit or cost imposed on users when another user joins the network.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "A network externality is a benefit or cost that one user's participation in a network imposes on other users, without any direct transaction between them. When a new person joins a social network, every existing member gains a potential new connection at no extra cost, which is a positive network externality. Conversely, when too many users join and the network becomes congested or spammy, that is a negative network externality. The key insight is that individuals do not consider these spillover effects on others when deciding to join, which can lead to networks that are either too small or too large relative to what would be socially optimal.",
      "example": "When one more driver joins Uber, riders benefit from shorter wait times (positive externality). But during surge pricing, too many ride requests overwhelm drivers, increasing wait times for everyone (negative externality)."
    },
    {
      "id": "netting",
      "term": "Netting",
      "definition": "Offsetting payments in opposite directions so only the net difference settles---reduces liquidity needs.",
      "lessons": [
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "Netting is the process of offsetting payments in opposite directions so that only the net difference actually settles, rather than settling each transaction individually. If Bank A owes Bank B EUR 10 million and Bank B owes Bank A EUR 9 million, netting means only EUR 1 million actually moves from Bank A to Bank B instead of transferring EUR 19 million in both directions. This dramatically reduces the amount of liquidity (money) that banks need to hold ready to make payments, lowering costs. Netting can be bilateral (between two parties) or multilateral (across many parties simultaneously). However, netting creates settlement risk because if one party fails before settlement, the other parties may be left with unexpected obligations.",
      "example": "During a trading day, Bank A and Bank B execute hundreds of securities trades with each other. Instead of transferring cash and securities for each trade individually, which would require enormous liquidity reserves, they net all trades at day's end. If Bank A bought EUR 500 million and sold EUR 450 million worth of securities, only the net EUR 50 million needs to be settled."
    },
    {
      "id": "opportunity-cost",
      "term": "Opportunity Cost",
      "definition": "Value of next best alternative foregone when choosing.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "Opportunity cost is the value of the next best alternative you give up when making a choice. Every decision involves trade-offs because resources (time, money, attention) are limited. When you choose option A, the opportunity cost is the benefit you would have received from option B, the best alternative you did not choose. In monetary contexts, holding cash has an opportunity cost equal to the interest or returns you could earn by investing that money elsewhere. Opportunity cost is crucial for understanding economic decisions because the true cost of any action includes both direct costs (money spent) and the value of forgone alternatives.",
      "example": "You have 10,000 EUR and can either hold it as cash earning 0% or invest in government bonds earning 3% annually. If you hold cash, the opportunity cost is 300 EUR per year in forgone interest. If inflation is 2%, your real opportunity cost is even higher because cash loses 2% purchasing power while bonds gain 3%, making the real difference 5%."
    },
    {
      "id": "oracle",
      "term": "Oracle",
      "definition": "System that provides external real-world data to blockchain smart contracts.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "An oracle is a system that provides external real-world information to blockchain smart contracts, which cannot access data outside the blockchain by themselves. Oracles act as bridges between blockchains (which are isolated by design for security) and the outside world, supplying price feeds (asset prices), weather data, sports scores, or any other off-chain information that smart contracts need to execute properly. The oracle problem is a major challenge: blockchains are decentralized and trustworthy, but oracles introduce centralization risk because someone must decide what data gets reported. Decentralized oracle networks like Chainlink aggregate data from multiple sources to reduce manipulation risk.",
      "example": "A DeFi lending protocol needs to know Ethereum's current dollar price to decide when to liquidate under-collateralized loans. It can't access Coinbase or Bloomberg directly—blockchains can't make internet requests. Instead, it uses Chainlink oracles that aggregate price data from multiple exchanges and report an average price on-chain. If oracles were compromised and reported that Ethereum was worth 1 dollar, the smart contract would incorrectly liquidate billions of dollars of collateral."
    },
    {
      "id": "order-book",
      "term": "Order Book",
      "definition": "Traditional market structure listing buy and sell orders at various prices.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "An order book is a list showing all the buy orders (bids) and sell orders (asks) waiting to be executed at different price levels in a market. Imagine a two-column table: the left column shows prices at which people want to buy (sorted highest to lowest) and the quantity they want, while the right column shows prices at which people want to sell (sorted lowest to highest) and their quantities. The top of the buy column is the best bid (highest price someone will pay) and the top of the sell column is the best ask (lowest price someone will accept). The gap between them is the bid-ask spread. Order books provide transparency: you can see the market depth at every price level and estimate how much your trade will move the price.",
      "example": "Bitcoin order book on Coinbase might show: Bids: 50,000 USD (2 BTC), 49,999 (5 BTC), 49,998 (3 BTC) | Asks: 50,001 (4 BTC), 50,002 (6 BTC), 50,003 (2 BTC). Best bid is 50,000, best ask is 50,001, spread is 1 USD."
    },
    {
      "id": "order-book-depth",
      "term": "Order Book Depth",
      "definition": "Volume of buy/sell orders at each price level; deeper books absorb large trades without price impact.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "Order book depth refers to the volume of buy and sell orders available at each price level near the current market price. A deep order book has large quantities of orders stacked at many price levels, which means the market can absorb big trades without the price moving much (low price impact). A shallow order book has small quantities at few price levels, so even a modest trade can cause the price to jump or drop significantly. Depth is a key measure of market liquidity: deep markets are more stable and cheaper to trade in, while shallow markets are volatile and expensive because your trade moves the price against you. Traders inspect order book depth before executing large orders to estimate their price impact.",
      "example": "Binance BTC/USDT has 500 BTC of bids stacked within 1% below the market price (deep book): a 50 BTC sell barely moves the price. A small altcoin exchange has only 10 BTC of bids within 1% (shallow): a 50 BTC sell crashes the price by 5%."
    },
    {
      "id": "over-collateralization",
      "term": "Over-collateralization",
      "definition": "Pledging more collateral than loan value for safety.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "Over-collateralization means pledging collateral (assets used as security) worth significantly more than the value of the loan or obligation being secured. In decentralized finance (DeFi), over-collateralization is necessary because crypto assets are volatile (prices change rapidly) and smart contracts (self-executing code) cannot assess creditworthiness (trustworthiness as a borrower) or pursue legal action against defaulters. Typical ratios range from 150% to 300%, meaning borrowers must deposit 1.50 to 3.00 EUR worth of assets for every 1 EUR borrowed. This protects lenders from losses if collateral value drops suddenly, providing a buffer before liquidation (automatic sale of collateral) becomes necessary. The higher the volatility, the higher the required over-collateralization ratio.",
      "example": "To borrow 1,000 DAI stablecoin from Aave, you must deposit 1,500 USD worth of Ethereum (150% collateralization). If Ethereum's price drops 20%, your collateral falls to 1,200 USD (120% ratio), triggering automatic liquidation to protect the lending pool. This over-collateralization ensures lenders get repaid even if collateral value crashes."
    },
    {
      "id": "path-dependence",
      "term": "Path Dependence",
      "definition": "Current state depends on historical choices, not just current conditions.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Path dependence means that the current state of a technology or market is heavily shaped by historical events and early choices, not just by present-day conditions. Small advantages or lucky breaks early on can lock in a particular outcome permanently, even if objectively better alternatives exist. Once a platform gains a lead, network effects and switching costs reinforce its dominance, making it nearly impossible for latecomers to catch up regardless of their technical superiority. Path dependence explains why we sometimes end up stuck with inferior standards or dominant platforms that won the race through timing rather than quality.",
      "example": "The QWERTY keyboard layout was designed in the 1870s to prevent typewriter jams. Even though faster layouts exist, billions of people learned QWERTY, and switching costs keep it dominant 150 years later."
    },
    {
      "id": "platform-economics",
      "term": "Platform Economics",
      "definition": "Analysis of network effects, two-sided markets, and ecosystem dynamics.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "Platform economics is the analysis of markets where platforms (intermediaries connecting two or more distinct user groups) create value primarily through network effects rather than traditional production. Key concepts include two-sided markets (platforms like Uber connecting drivers and riders), cross-side externalities (benefits to one group when the other group grows), critical mass (minimum users needed for self-sustaining growth), and winner-take-all dynamics (tendency for one platform to dominate). Platforms face unique pricing challenges—often subsidizing one side to attract the other—and governance questions about who controls the platform and how. Blockchain protocols are platforms where token economics replaces traditional business models.",
      "example": "Ethereum is a platform connecting developers (who build applications) and users (who pay gas fees to use them). As more developers build on Ethereum, users benefit from more applications; as more users join, developers gain larger potential markets—these are cross-side externalities. Ethereum faced the cold-start problem of attracting initial users, subsidized developers through grants, and now benefits from network effects where switching to alternative platforms (Solana, Cardano) has high costs despite potentially better technology."
    },
    {
      "id": "platform-governance",
      "term": "Platform Governance",
      "definition": "Rules and mechanisms for decision-making about platform evolution and resource allocation.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Platform governance refers to the rules, processes, and power structures that determine how decisions are made about a platform's evolution, fee structure, and resource allocation. In traditional companies, a board of directors governs. In blockchain platforms, governance is often decentralized: token holders vote on proposals to change protocol rules, adjust fees, or allocate treasury funds. Good governance balances efficiency (making decisions quickly) with legitimacy (ensuring all stakeholders have a voice). Poor governance can lead to plutocracy (rule by wealthy token holders), stagnation, or contentious splits (forks) in the community.",
      "example": "MakerDAO token holders vote on interest rates for its stablecoin DAI. In 2023, a governance vote raised the DAI savings rate from 1% to 8%, attracting billions in deposits. One large holder's vote can outweigh thousands of small holders."
    },
    {
      "id": "plutocracy",
      "term": "Plutocracy",
      "definition": "Rule by the wealthy---those with most tokens have most votes.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Plutocracy means governance by the wealthy. In blockchain platforms that use token-based voting (one token equals one vote), anyone who accumulates a large number of tokens gains disproportionate control over the platform's rules, fee structures, and treasury spending. This mirrors how a shareholder with 51% of a company's stock can outvote all other shareholders combined. Plutocracy undermines the decentralization promise of blockchain because a handful of whales (large token holders) can dominate decisions that affect millions of users. Solutions like quadratic voting (where voting power grows with the square root of tokens, not linearly) aim to reduce this imbalance.",
      "example": "In some DeFi protocols, a single venture capital fund holding 10% of tokens can outvote thousands of small community members combined. If 100 small holders each own 100 tokens, the fund with 1 million tokens still wins every vote."
    },
    {
      "id": "price-discovery",
      "term": "Price Discovery",
      "definition": "Process by which market determines asset prices through trading activity and information aggregation.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "Price discovery is the process by which markets aggregate information from all participants to determine the fair value of an asset. It happens through continuous trading: buyers and sellers submit bids and asks based on their private information (news they have read, analysis they have done, or beliefs they hold), and the market price converges to a level that reflects the collective wisdom of all participants. Good price discovery means the market price accurately reflects all available information quickly. Poor price discovery means prices are stale, inaccurate, or lag behind news. Factors affecting price discovery include market fragmentation (trading happening across many venues), information asymmetries (some traders know more than others), and trading frictions (fees, delays, or restrictions).",
      "example": "When Elon Musk tweets about Bitcoin, traders on hundreds of exchanges simultaneously buy, pushing the price up within seconds. Prices on liquid exchanges like Binance adjust first, then smaller exchanges follow via arbitrage, completing global price discovery within minutes."
    },
    {
      "id": "price-elasticity",
      "term": "Price Elasticity",
      "definition": "How much demand changes when price changes---card users are less price-sensitive than merchants.",
      "lessons": [
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "Price elasticity measures how much demand changes when price changes, expressed as the percentage change in quantity demanded divided by the percentage change in price. In payment systems, card users are typically price-insensitive (inelastic demand) because they do not directly pay transaction fees and value the convenience and rewards, while merchants are more price-sensitive (elastic demand) but have little choice but to accept cards since refusing them loses customers. This asymmetry allows card networks to charge high fees to merchants who have less ability to resist. Elastic demand means small price increases cause large drops in usage, while inelastic demand means price increases barely affect usage.",
      "example": "When Visa increases interchange fees by 10%, merchants continue accepting Visa cards because refusing them would drive customers to competitors, even though the fee increase hurts merchant profitability. Meanwhile, if merchants tried to charge customers a 10% surcharge for using cards, many customers would switch to cash or go elsewhere, showing that merchant demand is more elastic than cardholder demand."
    },
    {
      "id": "price-impact",
      "term": "Price Impact",
      "definition": "How much your trade moves the market price; larger trades have higher price impact.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "Price impact is the change in the market price caused by your own trade. When you place a large buy order, you consume all the sell orders at the best ask price, then the next best, then the next, walking up the order book and pushing the price higher. Similarly, a large sell order walks down the buy side, pushing the price lower. Price impact is a hidden cost of trading large quantities: the average price you pay is worse than the market price when you started. It depends on market liquidity: in deep, liquid markets like major stock exchanges, even million-dollar trades have minimal price impact. In shallow, illiquid markets like small-cap crypto tokens, even thousand-dollar trades can move the price by several percent.",
      "example": "You want to buy 100 ETH on a DEX. The first 10 ETH cost 2,000 USDC each, the next 20 cost 2,010 each, the next 30 cost 2,025 each, and the final 40 cost 2,050 each. Your average price is 2,028 per ETH due to price impact, costing you 2,800 USDC more than if there were no impact."
    },
    {
      "id": "principles-based-regulation",
      "term": "Principles-Based Regulation",
      "definition": "Flexible approach setting high-level objectives with supervisory judgment.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Principles-based regulation sets broad, high-level goals -- such as 'treat customers fairly' or 'maintain adequate capital' -- and gives regulated firms flexibility in how they achieve those goals. Regulators then use supervisory judgment to assess whether a firm's approach meets the spirit of the principle. The advantage is adaptability: principles can cover new technologies and business models without needing constant rule updates. The disadvantage is uncertainty: firms may struggle to know exactly what compliance looks like, and enforcement can seem subjective or inconsistent. This approach is often contrasted with rules-based regulation, which specifies exact requirements but can be rigid and easy to game.",
      "example": "The UK's FCA operates largely on principles-based regulation. Rather than specifying exactly how a crypto firm must protect customer funds, the FCA requires firms to 'safeguard client assets' and judges each firm's method individually. This gives innovative firms room to find creative compliance solutions."
    },
    {
      "id": "prisoners-dilemma",
      "term": "Prisoner's Dilemma",
      "definition": "Situation where individual rationality leads to collectively suboptimal outcome.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "The Prisoner's Dilemma is a foundational game-theory scenario where two individuals, acting in pure self-interest, each choose a strategy that leads to an outcome worse for both than if they had cooperated. The name comes from a thought experiment: two suspects are interrogated separately and each can either stay silent (cooperate with each other) or betray the other (defect). Betrayal gives a better personal result regardless of what the other does, so both betray -- but mutual betrayal leads to harsher punishment than mutual silence. In regulation, this explains why competing countries often engage in a 'race to the bottom' on regulatory standards, each hoping to attract business at the expense of global stability.",
      "example": "Singapore and Switzerland both want to attract crypto companies. Each country could enforce strict consumer-protection rules, but fears that the other will offer lighter rules and steal the business. Both end up with weaker regulation than either truly prefers -- a Prisoner's Dilemma in regulatory competition."
    },
    {
      "id": "proportionality",
      "term": "Proportionality",
      "definition": "Principle that regulatory intensity should match risk level and firm size/complexity.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Proportionality is the regulatory principle that the intensity and cost of oversight should match the level of risk an entity poses and its size or complexity. A small fintech startup handling modest transaction volumes should not face the same compliance burden as a global bank moving trillions of dollars. Without proportionality, heavy-handed regulation would crush small innovators while barely affecting large incumbents, reducing competition and innovation. In practice, proportionality means tiered licensing (different license types for different risk levels), simplified reporting for small firms, and phased compliance timelines that give startups time to build up their compliance capacity gradually.",
      "example": "The EU's MiCA regulation uses proportionality by requiring stablecoin issuers with more than EUR 200 million in circulation to meet stricter reserve and audit requirements, while smaller issuers face lighter obligations. This prevents small projects from being buried under compliance costs designed for giants like Tether."
    },
    {
      "id": "prudential-regulation",
      "term": "Prudential Regulation",
      "definition": "Rules ensuring financial institutions' safety and soundness.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Prudential regulation consists of rules designed to ensure that financial institutions remain safe, solvent (able to pay their debts), and sound over time. These rules typically require institutions to hold minimum amounts of capital (a financial buffer to absorb losses), maintain adequate liquidity (enough cash or easily sellable assets to meet withdrawal demands), manage risks properly, and submit to regular examinations by supervisors. The goal is to prevent individual firm failures that could harm depositors or trigger wider financial instability. In digital finance, the question is whether crypto platforms holding customer funds should face similar prudential requirements as banks.",
      "example": "After the collapse of FTX in 2022, regulators argued that if the exchange had been subject to prudential rules -- like maintaining capital reserves equal to a percentage of customer deposits -- it could not have secretly lent out billions of dollars of customer funds. Basel III capital requirements for banks exist to prevent exactly this kind of failure."
    },
    {
      "id": "quadratic-voting",
      "term": "Quadratic Voting",
      "definition": "Voting power increases with square root of tokens, not linearly, to mitigate plutocracy.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Quadratic voting is a governance mechanism where the cost of additional votes increases quadratically, meaning each extra vote costs more than the last. Specifically, casting N votes costs N^2 tokens (1 vote costs 1 token, 2 votes cost 4 tokens, 3 votes cost 9 tokens, and so on). This design lets people express how strongly they care about an issue while preventing wealthy participants from cheaply dominating every decision. Someone who cares intensely can still cast many votes but must pay a steep premium, while someone with moderate preferences can vote cheaply. It is a mathematical compromise between one-person-one-vote democracy and one-token-one-vote plutocracy.",
      "example": "Under quadratic voting, casting 10 votes costs 100 tokens (10 squared), while casting 1 vote costs just 1 token. A whale with 10,000 tokens gets only 100 votes (square root of 10,000), not 10,000 votes as in standard token voting."
    },
    {
      "id": "quantity-theory-of-money",
      "term": "Quantity Theory of Money",
      "definition": "MV = PY relationship linking money, velocity, prices, output.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "The quantity theory of money describes the relationship between the money supply (total amount of money in circulation), velocity of money (how fast money changes hands), price levels (average prices of goods and services), and real output (total goods and services produced) using the equation MV = PY. M is money supply, V is velocity (number of times a unit of money circulates per year), P is price level, and Y is real output or GDP (gross domestic product, the total value of goods and services produced). The theory predicts that if velocity and output are constant, increasing money supply causes proportional increases in prices (inflation). This implies that printing money without growing the economy causes inflation, while growing the economy without increasing money supply causes deflation (falling prices).",
      "example": "An economy produces 1,000 EUR worth of goods annually (Y = 1,000), has 100 EUR in circulation (M = 100), and each euro is spent 10 times per year (V = 10). This gives MV = 100 × 10 = 1,000 = PY. If the central bank doubles money supply to M = 200 with constant V and Y, then P must double, causing 100% inflation."
    },
    {
      "id": "regtech",
      "term": "RegTech",
      "definition": "Regulatory Technology---software tools automating compliance (KYC, AML, reporting).",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "RegTech (Regulatory Technology) refers to software tools and platforms that help financial companies comply with regulations more efficiently and at lower cost. Instead of relying on armies of compliance staff manually reviewing transactions, RegTech solutions use automation, artificial intelligence, and data analytics to handle tasks like identity verification (KYC, or Know Your Customer), transaction monitoring for suspicious activity (AML, or Anti-Money Laundering), regulatory reporting, and risk assessment. RegTech benefits both firms (reducing compliance costs) and regulators (receiving cleaner, more timely data). It is the compliance side's counterpart to SupTech, which gives regulators similar technological tools.",
      "example": "A RegTech company like Chainalysis provides tools that automatically trace cryptocurrency transactions across blockchains, flagging wallets associated with sanctioned individuals or known criminal activity. An exchange using this software can screen thousands of transactions per second instead of reviewing them manually."
    },
    {
      "id": "regulatory-arbitrage",
      "term": "Regulatory Arbitrage",
      "definition": "Practice of exploiting differences in rules across jurisdictions or asset classifications to minimize compliance costs or avoid regulation.",
      "lessons": [
        "L07",
        "L08"
      ],
      "category": "Regulatory Economics",
      "detailed": "Regulatory arbitrage is the practice of deliberately structuring business activities to take advantage of differences in rules across jurisdictions (different countries or regions) or across regulatory categories (different asset classifications). Companies may relocate operations to countries with lighter regulation, restructure products to fall outside certain regulatory definitions, or split activities across entities to avoid triggering specific thresholds. While not always illegal, regulatory arbitrage undermines the intent of regulation by allowing firms to enjoy the benefits of operating in well-regulated markets while avoiding the associated costs and protections. It is a major challenge in digital finance because blockchain-based services can operate globally from anywhere.",
      "example": "A crypto lending platform incorporates in the Cayman Islands to avoid U.S. securities laws but continues serving American customers through a website. By exploiting the gap between where it is registered and where its customers are, the platform engages in regulatory arbitrage to minimize its compliance obligations."
    },
    {
      "id": "regulatory-capture",
      "term": "Regulatory Capture",
      "definition": "When regulated industry gains control over its regulator, leading to rules favoring industry over public interest.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Regulatory capture occurs when a regulatory agency, created to act in the public interest, instead advances the commercial or political interests of the industry it is supposed to oversee. This happens gradually: industry insiders become regulators, regulated firms provide the technical expertise that agencies rely on, and constant lobbying shapes rules to favor incumbents over newcomers. The result is regulation that protects established firms from competition rather than protecting consumers. In digital finance, capture risk exists when traditional financial institutions lobby for strict crypto regulations that they can afford to comply with but that would eliminate smaller competitors.",
      "example": "If major banks successfully lobby for crypto regulations requiring a banking license to offer any token custody service, small crypto startups would be shut out of the market. The regulation would protect banks from competition rather than protecting consumers -- a sign of regulatory capture."
    },
    {
      "id": "regulatory-economics",
      "term": "Regulatory Economics",
      "definition": "Analysis of market failures, regulatory interventions, and policy effectiveness.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "Regulatory economics analyzes when and how government intervention in markets can improve outcomes, focusing on market failures (situations where free markets produce inefficient or unfair results), the design of effective regulations, trade-offs between different policy approaches, and unintended consequences of rules. Key topics include information asymmetries (when one party knows more than another), externalities (costs or benefits affecting non-participants), systemic risk (threats to the entire financial system), consumer protection, and cost-benefit analysis of regulations. This field recognizes that both unregulated markets and poorly designed regulations can harm welfare (total societal well-being). International coordination challenges arise when digital finance crosses borders.",
      "example": "The 2008 financial crisis was partly caused by information asymmetries—banks knew more about mortgage risk than investors—and systemic risk from interconnected institutions. Regulators responded with Dodd-Frank rules requiring banks to hold more capital and limiting risky trading. In crypto, the collapse of FTX in 2022 highlighted consumer protection failures: customers thought deposits were safe but FTX secretly lent them to a risky hedge fund. Regulatory economics debates whether extending banking rules to crypto exchanges would prevent future failures or stifle innovation."
    },
    {
      "id": "regulatory-perimeter",
      "term": "Regulatory Perimeter",
      "definition": "Boundary defining which activities and entities fall under regulatory oversight.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "The regulatory perimeter is the boundary that defines which activities, entities, and products fall under a regulator's oversight and which ones remain outside it. Activities inside the perimeter must follow the rules, obtain licenses, and submit to examinations. Activities outside the perimeter operate in an unregulated space. A key challenge in digital finance is that many crypto activities -- like decentralized lending or peer-to-peer token swaps -- were designed to operate outside traditional regulatory perimeters. Regulators worldwide are actively debating whether and how to expand their perimeters to capture these new activities, balancing the need for protection against the risk of stifling innovation.",
      "example": "In the UK, peer-to-peer Bitcoin transactions between individuals fall outside the FCA's regulatory perimeter, meaning no consumer protections apply. But if a company operates an exchange facilitating those same transactions, it steps inside the perimeter and must register, follow AML rules, and protect customer funds."
    },
    {
      "id": "remittances",
      "term": "Remittances",
      "definition": "Money sent home by workers abroad---often to developing countries, with high fees (average 6%).",
      "lessons": [
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "Remittances are money transfers sent by workers living abroad back to their families in their home countries, often from developed to developing nations. Remittances are a critical source of income for many developing countries, exceeding foreign aid in total value. However, sending remittances through traditional channels like Western Union or banks is expensive, with global average costs around 6% of the amount sent, and sometimes exceeding 10% for certain corridors. These high costs are due to lack of competition, compliance costs, and correspondent banking fees. Digital payment systems, cryptocurrencies, and mobile money are emerging as cheaper alternatives, with some services charging under 2%. Reducing remittance costs is a development priority because it increases the money reaching families.",
      "example": "A construction worker in Germany sends EUR 200 per month to his family in Morocco using Western Union. He pays EUR 12 in fees each time (6% of the transfer), meaning his family receives only EUR 188. Over a year, EUR 144 goes to fees instead of his family. With a digital service charging 2%, his family would receive an extra EUR 96 per year."
    },
    {
      "id": "retail-cbdc",
      "term": "Retail CBDC",
      "definition": "CBDC available to the general public for everyday transactions.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "A retail CBDC is a central bank digital currency designed for use by the general public -- ordinary people and businesses -- for everyday payments like buying groceries, paying rent, or transferring money to friends. This is distinct from wholesale CBDC, which is only available to banks and financial institutions. Retail CBDC would function as a digital equivalent of physical cash, accessible through smartphone apps or payment cards. Central banks designing retail CBDCs must balance competing goals: making payments convenient and inclusive, maintaining user privacy, preventing money laundering, and avoiding damage to the commercial banking system through deposit outflows.",
      "example": "The Bahamas launched the Sand Dollar, a retail CBDC available to all residents. A fisherman on a remote island can receive payment by holding his phone near the buyer's -- no bank account, internet connection, or credit card needed. Nigeria's eNaira is another live retail CBDC used for everyday purchases."
    },
    {
      "id": "rtgs",
      "term": "RTGS (Real-Time Gross Settlement)",
      "definition": "Payment system settling transactions individually and immediately, eliminating settlement risk.",
      "lessons": [
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "Real-Time Gross Settlement (RTGS) is a payment system that settles transactions individually and immediately, with finality, meaning once settled the payment cannot be reversed. Unlike deferred net settlement systems that batch transactions, RTGS transfers money instantly for each transaction in real-time. This eliminates settlement risk (the risk that a counterparty fails before settlement) because transactions complete immediately. However, RTGS requires banks to hold much more liquidity (cash reserves) since they must have funds available for each transaction as it occurs, rather than netting obligations at day's end. RTGS systems are typically used for large-value payments between financial institutions, such as interbank transfers or securities settlements, where settlement risk is unacceptable.",
      "example": "When Bank A wires EUR 50 million to Bank B to settle a corporate acquisition, the payment goes through the central bank's RTGS system. Within seconds, EUR 50 million is deducted from Bank A's account at the central bank and credited to Bank B's account, with immediate finality. Bank B can immediately use these funds, knowing the payment cannot be reversed."
    },
    {
      "id": "rules-based-regulation",
      "term": "Rules-Based Regulation",
      "definition": "Precise requirements approach with clear enforcement but less flexibility.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Rules-based regulation specifies precise, detailed requirements that regulated firms must follow -- exact capital ratios, specific reporting formats, mandatory disclosure checklists, and defined operational procedures. The advantage is clarity: firms know exactly what they must do, and enforcement is straightforward because compliance is binary (you either meet the number or you do not). The disadvantage is rigidity: detailed rules cannot anticipate every new product or business model, so firms can technically comply with the letter of the law while violating its spirit. Rules-based systems also require frequent updates as markets evolve, creating regulatory lag where innovation outpaces the rules.",
      "example": "The U.S. approach to securities regulation is largely rules-based: the SEC's Regulation D specifies exact conditions under which a company can sell securities without full public registration, including precise investor income thresholds (USD 200,000 annual income) and maximum fundraising amounts."
    },
    {
      "id": "run-risk",
      "term": "Run Risk",
      "definition": "Risk that depositors or token holders simultaneously attempt to withdraw, causing liquidity crisis.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "Run risk is the danger that many depositors, investors, or token holders will simultaneously attempt to withdraw their funds, creating a self-fulfilling crisis even if the institution was initially sound. This happens because financial institutions practice maturity transformation—holding long-term illiquid assets (like loans or bonds) while promising short-term liquidity to depositors. When everyone tries to withdraw at once, the institution must sell assets rapidly at fire-sale prices, realize losses, and potentially become insolvent (unable to pay all obligations). Runs are driven by coordination failure: if everyone stays calm, the institution survives; if everyone panics, it collapses. Deposit insurance and central bank lending exist to prevent runs.",
      "example": "In March 2023, Silicon Valley Bank experienced a classic bank run: depositors feared losses after the bank reported holding bonds that had fallen in value, triggered mass withdrawals, forcing SVB to sell bonds at losses, confirming depositors' fears, and causing failure within 48 hours. In DeFi, stablecoin TerraUSD faced a run in May 2022 when doubts about its peg mechanism caused billions in redemption attempts, depleting reserves and collapsing the entire ecosystem. Both showed how quickly confidence can evaporate."
    },
    {
      "id": "same-risk-same-regulation",
      "term": "Same Risk, Same Regulation",
      "definition": "Principle that activities posing similar risks should face equivalent regulatory treatment.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Same risk, same regulation is the principle that any financial activity posing the same type and level of risk to consumers or the financial system should be subject to the same regulatory requirements, regardless of what kind of entity performs it or what technology is used. If a DeFi lending protocol creates the same risks as a traditional bank -- such as the risk of losing depositors' money -- it should face equivalent capital, disclosure, and consumer-protection rules. This principle aims to prevent regulatory arbitrage (exploiting rule differences to avoid compliance) and ensure a level playing field. It is central to how policymakers are approaching crypto regulation globally.",
      "example": "The ECB (European Central Bank) argues that if a stablecoin like USDC functions as a payment instrument just like a bank deposit, then USDC's issuer should face the same reserve, redemption, and audit requirements as a bank. The activity is the same, so the regulation should be too."
    },
    {
      "id": "sandbox",
      "term": "Sandbox",
      "definition": "Controlled regulatory environment where firms can test innovations with reduced requirements, allowing limited experimentation with relaxed rules for innovation.",
      "lessons": [
        "L07",
        "L08"
      ],
      "category": "Regulatory Economics",
      "detailed": "A regulatory sandbox is a controlled environment set up by a regulator where companies can test new financial products, services, or business models with real customers under relaxed regulatory requirements for a limited time. Think of it as a safe playground: the company gets to experiment and learn, while the regulator observes closely and gathers data about risks and benefits before deciding on permanent rules. Sandboxes typically have conditions such as limited customer numbers, maximum transaction amounts, enhanced consumer disclosures, and mandatory progress reports. If the test succeeds, the company can apply for a full license under adapted rules. Sandboxes help regulators keep pace with innovation without either blocking it or letting it run unchecked.",
      "example": "The UK's FCA launched one of the first regulatory sandboxes in 2016. A blockchain-based remittance startup could serve up to 1,000 real customers for six months under relaxed licensing rules, while the FCA monitored results. If the pilot went well, the startup could then apply for full authorization."
    },
    {
      "id": "sandwich-attack",
      "term": "Sandwich Attack",
      "definition": "MEV strategy: buy before victim's trade, then sell after, profiting from price manipulation.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "A sandwich attack is a specific MEV exploitation technique where a bot detects your pending trade, executes a buy order right before yours (front-run) to push the price up, waits for your order to execute at the now-higher price, then immediately sells (back-run) at a profit. Your trade is \"sandwiched\" between the bot's buy and sell orders. This is possible because on blockchains like Ethereum, all pending transactions are visible in the mempool before being confirmed, and bots can pay higher gas fees to ensure their orders are processed first. Sandwich attacks harm ordinary traders by increasing the price they pay (or decreasing the price they receive) while enriching the attacker. They are endemic in DeFi because of blockchain transparency and priority gas auctions.",
      "example": "You submit a Uniswap order to buy 10 ETH for 20,000 USDC. Bot sees it, buys 5 ETH first for 9,800 USDC (pushing price up), your order executes for 20,200 LIQUIDITY, bot sells 5 ETH for 10,100 USDC, netting 300 USDC profit at your expense."
    },
    {
      "id": "seigniorage",
      "term": "Seigniorage",
      "definition": "Profit from issuing currency above production cost. The difference between the face value of money and its production cost---a profit that governments earn from issuing currency.",
      "lessons": [
        "L01",
        "L02",
        "L03"
      ],
      "category": "Monetary Economics",
      "detailed": "Seigniorage is the profit a government or central bank earns from issuing currency when the face value (nominal value printed on the currency) exceeds the production cost. For physical currency, if a 100 EUR note costs 0.15 EUR to print, seigniorage is 99.85 EUR. For digital money, production costs approach zero, making seigniorage nearly 100%. Governments use seigniorage as a funding source, essentially getting free resources by creating money. In cryptocurrency contexts, miners or validators (participants who secure the network) earn seigniorage by creating new coins as rewards for processing transactions. Excessive seigniorage through money printing leads to inflation (rising prices) and eventually hyperinflation if abused, functioning as an inflation tax (hidden tax on money holders).",
      "example": "The European Central Bank prints a 50 EUR note costing 0.12 EUR in paper and ink, earning 49.88 EUR in seigniorage when it enters circulation. Bitcoin miners earn seigniorage of 6.25 BTC (worth approximately 160,000 USD at 2024 prices) every 10 minutes for validating transactions and securing the network."
    },
    {
      "id": "self-custody",
      "term": "Self-Custody",
      "definition": "Holding private keys directly without intermediary.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Self-custody means holding your own private keys (the secret codes controlling access to your cryptocurrency) directly, without relying on a third party like an exchange or bank. It is the digital equivalent of keeping cash in your own safe rather than a bank vault. The advantage is full control: no intermediary can freeze your funds, go bankrupt with your assets, or deny access. The disadvantage is full responsibility: if you lose your private keys or they are stolen, there is no way to recover your funds. Self-custody raises major regulatory questions because KYC (identity verification) and AML (anti-money-laundering) rules are hard to apply without an intermediary.",
      "example": "Using a hardware wallet like Ledger, you store your Bitcoin private keys on a physical device you keep at home. If the device is lost or damaged and you did not back up your recovery phrase (a set of words that regenerates your keys), your Bitcoin is permanently inaccessible -- no bank or regulator can help."
    },
    {
      "id": "settlement-risk",
      "term": "Settlement Risk",
      "definition": "Risk that one party delivers but the other defaults---eliminated by RTGS, present in deferred systems.",
      "lessons": [
        "L04"
      ],
      "category": "Payment Systems",
      "detailed": "Settlement risk is the risk that one party in a transaction delivers their side of the bargain (such as goods, services, or securities) but the counterparty fails to deliver their side (typically payment) before settlement completes. This risk exists in deferred settlement systems where there is a time gap between when a transaction is agreed and when it actually settles. If one party becomes insolvent during this period, the other party may not receive what they are owed, potentially triggering a cascade of failures if the loss affects their ability to meet obligations to others. Settlement risk is eliminated in real-time gross settlement (RTGS) systems because transactions complete immediately with finality. It is a key concern in payment systems, securities trading, and foreign exchange markets.",
      "example": "Bank A agrees to buy EUR 100 million in securities from Bank B, with settlement scheduled for two days later. Bank A transfers the securities immediately but Bank B has not yet paid. If Bank B fails before settlement day, Bank A has delivered EUR 100 million in securities but will not receive payment, creating a massive loss and potentially causing Bank A to fail its own obligations to other parties."
    },
    {
      "id": "slippage",
      "term": "Slippage",
      "definition": "Price change between when you submit an order and when it executes, especially on large trades.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "Slippage is the difference between the price you expected to get when you submitted your trade and the actual price you received when it executed. It happens because markets are constantly moving: by the time your order reaches the exchange and gets matched, other traders may have bought or sold, changing the best available price. Slippage is especially severe in fast-moving markets (like during news announcements or crashes) and in illiquid markets (where there are not many orders available at each price level). On AMMs, slippage happens because your trade itself changes the price via the constant product formula. Traders can set slippage tolerance limits: if slippage exceeds the limit, the trade is canceled.",
      "example": "You place a market buy for 1,000 USDC worth of a small altcoin, expecting a price of 0.50 USD per token (2,000 tokens). By the time it executes 2 seconds later, the price is 0.53 USD, and you only get 1,887 tokens. You suffered 6% slippage."
    },
    {
      "id": "spillovers",
      "term": "Spillovers",
      "definition": "When one country's policy unintentionally affects other countries.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "Spillovers occur when one country's policy decisions unintentionally affect other countries. In the CBDC context, if a major economy launches a digital currency, it could have ripple effects worldwide. For example, if the US Federal Reserve issues a digital dollar that anyone globally can hold, people in developing countries might prefer it over their own national currency, weakening those countries' monetary sovereignty. Cross-border spillovers can also include capital flow disruptions (money moving rapidly between countries), exchange rate volatility (unpredictable changes in currency values), and challenges for smaller economies that cannot compete with the technological infrastructure of larger nations.",
      "example": "If the Fed launches a digital dollar and citizens in Argentina can easily hold it on their phones, many might abandon the Argentine peso (which has suffered high inflation). This capital flight would weaken the peso further and undermine Argentina's central bank -- a classic negative spillover."
    },
    {
      "id": "stablecoin",
      "term": "Stablecoin",
      "definition": "Cryptocurrency designed to maintain stable value, typically pegged to fiat currency.",
      "lessons": [
        "L01",
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "A stablecoin is a cryptocurrency designed to maintain a stable value relative to a reference asset, typically pegged at 1:1 to a fiat currency like the US dollar or euro. Unlike Bitcoin or Ethereum, whose prices fluctuate dramatically, stablecoins aim to provide the benefits of cryptocurrency (fast transfers, programmability, global access) without the volatility (rapid price changes). Stablecoins achieve stability through different mechanisms: fiat-backed stablecoins hold traditional currency reserves, crypto-backed stablecoins use over-collateralization with volatile assets, and algorithmic stablecoins use supply adjustments without collateral. Stablecoins are crucial for cryptocurrency trading (providing a stable trading pair), decentralized finance (DeFi) applications, and cross-border payments.",
      "example": "USDC (USD Coin) is a fiat-backed stablecoin issued by Circle, maintaining a 1:1 peg to the US dollar by holding 1 USD in reserves for every USDC issued. Users can always redeem 100 USDC for 100 USD, keeping the market price stable. This allows cryptocurrency traders to park funds in USDC during market downturns without converting to traditional bank accounts."
    },
    {
      "id": "staking",
      "term": "Staking",
      "definition": "Locking tokens to earn rewards and secure the network.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Staking is the process of locking up cryptocurrency tokens in a blockchain protocol as a form of security deposit, earning rewards in return. Stakers help secure the network because they have money at risk: if they validate fraudulent transactions, their staked tokens can be confiscated (a penalty called slashing). Think of it like a landlord requiring a security deposit that you forfeit if you damage the property. Staking also acts as a velocity sink (a mechanism that slows token circulation) because locked tokens cannot be sold or traded, which tends to support the token's price by reducing available supply.",
      "example": "Ethereum requires validators to stake 32 ETH (roughly $60,000-100,000) to participate in securing the network. In return, stakers earn approximately 3-5% annual rewards. If a validator goes offline or cheats, a portion of their stake is slashed."
    },
    {
      "id": "store-of-value",
      "term": "Store of Value",
      "definition": "Money's function preserving purchasing power over time.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "A store of value is an asset that maintains its purchasing power (ability to buy goods and services) over time without significant depreciation (loss of value). Good stores of value have characteristics like durability (lasting without deteriorating), scarcity (limited supply), portability (easy to transfer), and recognizability (universally accepted). Money serves as a store of value when inflation (rising prices) is low and stable, allowing savings to retain their worth. Assets that lose value quickly due to inflation, deterioration, or lack of demand fail as stores of value. Gold, real estate, and government bonds traditionally serve as stores of value, while Bitcoin proponents argue its fixed supply makes it a superior store of value compared to fiat currencies subject to inflation.",
      "example": "In stable economies, 1,000 EUR saved today will buy roughly the same amount of goods in 10 years (adjusted for modest 2% annual inflation, worth about 820 EUR in purchasing power). In Venezuela during hyperinflation (2016-2019), 1,000 bolivars lost 99.9999% of purchasing power within months, failing catastrophically as a store of value."
    },
    {
      "id": "suptech",
      "term": "SupTech",
      "definition": "Supervisory Technology---tools enabling regulators to monitor markets in real-time.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "SupTech (Supervisory Technology) refers to technological tools that regulators and supervisors use to monitor financial markets, detect risks, and enforce rules more effectively. While RegTech helps companies comply with regulations, SupTech helps the regulators themselves do their jobs better. SupTech tools can automatically scan millions of transactions for suspicious patterns, use machine learning to detect market manipulation, analyze social media for early warning signals of bank runs, and process regulatory filings in real time instead of waiting for periodic reports. This allows regulators to be proactive rather than reactive, catching problems before they become crises rather than investigating after the damage is done.",
      "example": "The Monetary Authority of Singapore uses SupTech tools that automatically analyze blockchain transaction data in real time, flagging unusual patterns that might indicate money laundering. Instead of waiting for quarterly reports from exchanges, regulators can spot suspicious activity as it happens."
    },
    {
      "id": "switching-costs",
      "term": "Switching Costs",
      "definition": "Costs (financial or behavioral) of moving from one platform to another.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Switching costs are all the expenses, effort, and inconvenience a user faces when moving from one platform or service to another. These costs can be financial (cancellation fees, losing prepaid credits), procedural (learning a new interface, migrating data), or relational (leaving behind friends, followers, or professional connections). High switching costs create lock-in and protect incumbent platforms from competition, even when rivals offer better features or lower prices. In crypto, switching costs include transferring assets between blockchains (which may require bridge fees and carry security risks), relearning interfaces, and abandoning reputation or history on the original platform.",
      "example": "Moving from one bank to another requires changing direct deposits, updating automatic bill payments, ordering new checks, and memorizing new account numbers. These hassles explain why the average person keeps the same bank account for over 15 years."
    },
    {
      "id": "systemic-risk",
      "term": "Systemic Risk",
      "definition": "Risk that failure of one entity triggers cascading failures throughout the financial system.",
      "lessons": [
        "L07",
        "L08"
      ],
      "category": "Regulatory Economics",
      "detailed": "Systemic risk is the danger that the failure of one financial institution, market, or instrument triggers a chain reaction of failures throughout the entire financial system, much like one falling domino toppling all the others. This differs from the risk of a single company going bankrupt: systemic risk threatens the stability of the whole economy. It typically arises from interconnectedness (institutions owing money to each other), concentration (too much activity in too few hands), and contagion (panic spreading from one market to another). Regulators focus heavily on systemic risk because individual firms may rationally take risks that, when combined across the system, become catastrophic for everyone.",
      "example": "When Lehman Brothers collapsed in 2008, it owed money to hundreds of other financial institutions worldwide. Those institutions then faced losses, causing them to pull back lending, which hurt businesses, which triggered layoffs -- a cascading chain reaction. Regulators now designate certain firms as 'systemically important' and subject them to stricter oversight to prevent a repeat."
    },
    {
      "id": "technology-neutral-regulation",
      "term": "Technology-Neutral Regulation",
      "definition": "Rules focused on function/activity rather than specific technology.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "Technology-neutral regulation means writing rules that focus on what an activity does and what risks it creates, rather than specifying or restricting the particular technology used to perform it. Under this approach, the same rules apply whether a payment is processed through a traditional banking network, a mobile app, or a blockchain. The advantage is future-proofing: regulations do not need to be rewritten every time a new technology emerges. The disadvantage is that truly technology-neutral rules can sometimes miss technology-specific risks, such as smart-contract vulnerabilities unique to blockchain systems. Most modern regulatory frameworks aspire to technology neutrality but sometimes add technology-specific provisions where unique risks exist.",
      "example": "The EU's MiCA regulation aims to be technology-neutral: whether a stablecoin's reserves are managed through traditional bank accounts or through blockchain-based smart contracts, the issuer must meet the same reserve adequacy and transparency requirements. The rules care about the outcome, not the plumbing."
    },
    {
      "id": "tiered-remuneration",
      "term": "Tiered Remuneration",
      "definition": "Different interest rates for different amounts held---e.g., 0% on first 3000 EUR, negative rates above.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "Tiered remuneration is a CBDC design feature where different interest rates apply to different amounts of holdings. The idea is to make CBDC attractive for everyday payments (by offering a competitive or zero rate on small balances) while discouraging people from treating it as a savings vehicle that could drain commercial bank deposits (by offering unattractive or negative rates on large balances). This graduated structure creates a built-in safeguard against bank disintermediation and flight-to-safety risks. Most major CBDC proposals, including the digital euro, incorporate some form of tiered remuneration as a core design element.",
      "example": "The ECB's digital euro proposal suggests 0% interest on the first EUR 3,000 held per person, then a penalty rate (say -2%) on any amount above that. A person holding EUR 3,000 pays nothing, but holding EUR 10,000 would cost EUR 140 per year on the excess -- strongly discouraging large CBDC hoarding."
    },
    {
      "id": "token",
      "term": "Token",
      "definition": "Digital unit of value representing assets, rights, or access.",
      "lessons": [
        "L01"
      ],
      "category": "Foundations",
      "detailed": "A token is a digital unit of value created on a blockchain that can represent various things: assets (like real estate or gold), utility (access rights to use a service), governance rights (voting power in protocol decisions), or currency. Unlike cryptocurrencies that have their own blockchains (like Bitcoin), tokens are usually built on existing blockchain platforms (like Ethereum). Smart contracts define the token's properties—how many exist, how they transfer, what rights they confer. Tokens enable programmable, divisible, and transferable digital ownership of virtually anything.",
      "example": "Uniswap's UNI token gives holders voting rights on protocol changes like fee structures. Each UNI represents one vote. Alternatively, a real estate company might issue 1,000 tokens representing fractional ownership of a building—owning 10 tokens means you own 1% of the property and earn 1% of rental income."
    },
    {
      "id": "token-based-cbdc",
      "term": "Token-Based CBDC",
      "definition": "CBDC where validity is verified by the instrument itself (like cash), enabling offline transactions.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "A token-based CBDC is a type of central bank digital currency where the digital coin itself proves its authenticity, rather than relying on verifying the holder's identity. This works similarly to physical cash: a EUR 20 banknote is valid regardless of who holds it, because the note itself contains security features that prove it is genuine. Token-based CBDCs can enable offline transactions (payments without internet) and greater privacy, since the system validates the money rather than the person. However, this design makes anti-money-laundering enforcement more difficult because transactions can potentially occur anonymously.",
      "example": "Imagine paying for coffee by tapping your phone even when neither device has internet. Your phone transfers a cryptographically signed digital token to the shop's device, which can verify the token is genuine without contacting any server -- just like handing over a physical EUR 5 coin."
    },
    {
      "id": "token-velocity",
      "term": "Token Velocity",
      "definition": "Rate at which tokens change hands; high velocity can depress token value.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Token velocity measures how frequently a token changes hands within a given time period. It is calculated as the total transaction volume divided by the average token supply in circulation. High velocity means tokens are bought and immediately sold or spent, passing through wallets quickly without being held. The equation of exchange (M * V = P * Q, where M is token supply, V is velocity, P is price level, and Q is quantity of transactions) shows that if velocity rises while other factors stay constant, each token's value falls. Platforms therefore try to reduce velocity through mechanisms that encourage holding rather than instant resale.",
      "example": "If a token has a supply of 1 million and $10 million in daily transactions, its velocity is 10 per day. Each token changes hands 10 times daily, suggesting nobody holds it long, which puts downward pressure on its price."
    },
    {
      "id": "tokenomics",
      "term": "Tokenomics",
      "definition": "Economic design of token systems including supply schedules, incentives, and governance rights.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Tokenomics is the economic design of a cryptocurrency token, encompassing its supply schedule (how many tokens exist now and will exist in the future), distribution method (who gets tokens and how), utility (what the token can be used for), and incentive structure (why people would want to hold it). Good tokenomics aligns the interests of all participants: developers, users, and investors. Key design choices include whether supply is capped or inflationary, how tokens are allocated between the team and community, what governance rights (voting power) tokens carry, and what mechanisms exist to create demand and reduce selling pressure.",
      "example": "Bitcoin's tokenomics features a hard cap of 21 million coins, with new supply halving every four years. Ethereum's tokenomics changed in 2022 to include fee burning, making supply potentially deflationary during high-usage periods."
    },
    {
      "id": "trade-finance",
      "term": "Trade Finance",
      "definition": "Loans and guarantees that help companies buy and sell goods internationally.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "Trade finance refers to the loans, guarantees, and insurance products that help companies buy and sell goods across international borders. When a factory in Germany ships machinery to Brazil, the buyer and seller face risks: the buyer worries about paying before receiving the goods, and the seller worries about shipping before getting paid. Banks bridge this gap by providing letters of credit (guarantees of payment) and short-term loans. CBDC could transform trade finance by enabling instant cross-border settlement through atomic swaps, reducing the time goods spend in transit limbo, and lowering the costs that banks charge for intermediation -- currently a multi-trillion-dollar global market.",
      "example": "A German exporter ships EUR 500,000 in equipment to Brazil. Today, the process involves 3-4 banks, stacks of paperwork, and 5-10 days for payment to clear. With interconnected CBDCs, the digital euro and digital real could be swapped atomically at the moment of delivery confirmation, settling in seconds."
    },
    {
      "id": "tradfi",
      "term": "TradFi (Traditional Finance)",
      "definition": "Banks, stock exchanges, and conventional financial institutions versus DeFi. Traditional Finance contrasted with decentralized alternatives.",
      "lessons": [
        "L02",
        "L06",
        "L08"
      ],
      "category": "Foundations",
      "detailed": "TradFi (Traditional Finance) refers to the established financial system of banks, stock exchanges, insurance companies, and other regulated institutions that have operated for decades or centuries. These institutions are centralized (controlled by specific organizations), heavily regulated by government authorities, operate during set business hours, and rely on trusted intermediaries to facilitate transactions. TradFi is contrasted with DeFi (Decentralized Finance), which uses blockchain technology to provide financial services without centralized control, 24/7 operation, and permissionless access (anyone can participate without approval).",
      "example": "JPMorgan Chase is TradFi: it is a bank regulated by the US Federal Reserve, holds your money in centralized databases, operates branches with set hours, and requires identity verification to open accounts. Aave is DeFi: software on the Ethereum blockchain where anyone can lend or borrow cryptocurrency 24/7 without identity checks."
    },
    {
      "id": "tradfi-defi-convergence",
      "term": "TradFi-DeFi Convergence",
      "definition": "Trend of traditional finance adopting DeFi innovations while DeFi increasingly seeks regulatory compliance.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "TradFi-DeFi convergence is the ongoing trend where traditional finance institutions adopt blockchain innovations and decentralized finance protocols increasingly seek regulatory compliance, blurring the distinction between the two sectors. Traditional banks are tokenizing assets, exploring blockchain settlement, and offering crypto custody services. Simultaneously, DeFi protocols are implementing know-your-customer (identity verification) requirements, seeking regulatory licenses, and partnering with banks. This convergence is driven by TradFi wanting blockchain efficiency and transparency, and DeFi needing legitimacy, liquidity, and access to fiat currency on-ramps. The result may be hybrid systems combining decentralized infrastructure with regulatory compliance.",
      "example": "BlackRock, the world's largest asset manager with 10 trillion dollars under management, launched a tokenized money market fund on Ethereum in 2024, bringing TradFi scale to DeFi infrastructure. Meanwhile, DeFi protocols like Aave introduced permissioned pools with KYC requirements for institutional investors, and Circle (USDC stablecoin issuer) obtained banking-like licenses. JPMorgan operates a blockchain network for institutional payments, while Compound Finance explores regulatory compliance frameworks. These moves show both sectors recognizing value in the other's approach."
    },
    {
      "id": "transaction-costs",
      "term": "Transaction Costs",
      "definition": "All exchange costs: time, fees, search, and friction.",
      "lessons": [
        "L01"
      ],
      "category": "Foundations",
      "detailed": "Transaction costs encompass all expenses and frictions involved in making an exchange beyond the price of the good or service itself. These include explicit fees (bank charges, payment processing fees, brokerage commissions), time costs (how long the transaction takes), search costs (effort to find trading partners or best prices), and information costs (verifying quality, trust, and legitimacy). High transaction costs make markets less efficient by discouraging beneficial trades. Digital finance aims to reduce these costs through automation, disintermediation, and faster processing, though it may introduce new costs like technical complexity and security requirements.",
      "example": "Buying a house involves massive transaction costs: real estate agent commissions (3-6% of price), legal fees for contracts and title searches, inspection fees, weeks of time negotiating and processing paperwork, and effort searching for properties. In contrast, buying stocks via Robinhood has near-zero fees and takes seconds."
    },
    {
      "id": "travel-rule",
      "term": "Travel Rule",
      "definition": "FATF requirement to transmit originator/beneficiary information for transactions exceeding threshold.",
      "lessons": [
        "L07"
      ],
      "category": "Regulatory Economics",
      "detailed": "The Travel Rule is a regulation, recommended globally by the FATF (Financial Action Task Force), requiring financial institutions to transmit identifying information about the sender (originator) and receiver (beneficiary) when transferring funds above a certain threshold. The name comes from the idea that the identifying information must 'travel' alongside the money. Originally created for traditional bank wire transfers, the Travel Rule has been extended to cryptocurrency transactions, requiring exchanges to share customer names, account numbers, and addresses with each other for transfers above the threshold (typically USD/EUR 1,000). This makes it harder for criminals to move money anonymously through the financial system.",
      "example": "If you send 2,000 USDT from your Kraken account to someone's Binance account, Kraken must transmit your name, account details, and address to Binance along with the transfer. Binance must verify this information before crediting the funds, just as traditional banks do for wire transfers above the threshold."
    },
    {
      "id": "tvl",
      "term": "TVL (Total Value Locked)",
      "definition": "Total amount of money deposited in DeFi protocols, a measure of adoption and liquidity.",
      "lessons": [
        "L06"
      ],
      "category": "Market Microstructure",
      "detailed": "Total Value Locked (TVL) is the total dollar value of all assets deposited into a DeFi protocol or set of protocols. It is calculated by adding up the value of every token locked in smart contracts for purposes like providing liquidity to AMMs, collateralizing loans, or staking for yield. TVL serves as a rough measure of a protocol's popularity, user trust, and economic significance: higher TVL means more users are willing to entrust their funds to the protocol. However, TVL can be misleading because it can be inflated by counting the same assets multiple times (if assets are rehypothecated across protocols) or by not accounting for whether deposits are real user funds or just mercenary capital chasing high yields.",
      "example": "Uniswap has 4 billion USD TVL across all its liquidity pools, meaning users have deposited that much value in ETH, USDC, and other tokens to enable decentralized trading. Aave has 6 billion USD TVL, representing collateral deposited for lending and borrowing."
    },
    {
      "id": "two-sided-market",
      "term": "Two-Sided Market",
      "definition": "Platform connecting two distinct user groups who need each other (e.g., merchants and consumers, cardholders and merchants) providing mutual network benefits.",
      "lessons": [
        "L01",
        "L04",
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "A two-sided market is a platform that creates value by connecting two distinct groups of users who need each other but cannot easily connect on their own. The platform acts as an intermediary, and its value depends on having enough participants on both sides. This creates a chicken-and-egg problem (a circular dependency): one side will not join without the other, but the other will not join without the first. To solve this, platforms often subsidize the more price-sensitive side (the side that is more likely to leave if charged) and charge the less price-sensitive side. Pricing strategy becomes about balancing both sides, not just maximizing revenue from one.",
      "example": "Uber connects riders (side A) with drivers (side B). Uber subsidized early riders with cheap fares to attract them, then attracted drivers by guaranteeing minimum earnings. A credit card network similarly needs both cardholders and merchants."
    },
    {
      "id": "unit-of-account",
      "term": "Unit of Account",
      "definition": "Money's function as standard measure for pricing.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "A unit of account is the standard measure used to price goods, services, assets, and debts in an economy. Money functions as a unit of account by providing a common denominator for expressing value, making it easy to compare the worth of different things. Without a unit of account, you would need to know exchange rates between every pair of goods (if 1 apple = 3 oranges and 1 chair = 50 apples, how many oranges equal 1 chair?). Using money simplifies this: if apples cost 1 EUR, oranges cost 0.33 EUR, and chairs cost 50 EUR, all comparisons become trivial. A stable unit of account requires low inflation (stable prices) so contracts and prices remain meaningful over time.",
      "example": "In everyday life, we think in euros or dollars, not apples or gold grams. A coffee costs 3 EUR, rent is 1,000 EUR per month, and salaries are 50,000 EUR per year. Without this common unit, comparing whether a coffee is expensive relative to rent would require complex mental calculations involving dozens of exchange rates."
    },
    {
      "id": "velocity-of-money",
      "term": "Velocity of Money",
      "definition": "Rate at which money circulates in economy.",
      "lessons": [
        "L02"
      ],
      "category": "Monetary Economics",
      "detailed": "Velocity of money measures how many times a unit of currency circulates through the economy within a period (usually one year), calculated as nominal GDP (gross domestic product, total value of all goods and services produced) divided by money supply. High velocity means money changes hands frequently, indicating active economic activity where people spend rather than hoard money. Low velocity means money sits idle in accounts, suggesting economic stagnation or hoarding behavior. Velocity is crucial for understanding the quantity theory of money (MV = PY): if velocity falls, the central bank must increase money supply to maintain price levels and output. Token velocity in cryptocurrencies works similarly—high velocity can depress token value because tokens do not get held as a store of value.",
      "example": "If an economy produces 10 trillion EUR in GDP annually with 2 trillion EUR in money supply, velocity is 10 trillion / 2 trillion = 5, meaning each euro is spent 5 times per year on average. If velocity drops to 3 due to recession fears causing hoarding, GDP falls unless the central bank increases money supply."
    },
    {
      "id": "velocity-sink",
      "term": "Velocity Sink",
      "definition": "Mechanism that slows how fast tokens change hands, supporting value.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "A velocity sink is any mechanism built into a token's design that encourages holders to keep their tokens rather than immediately selling or spending them, thereby slowing the rate at which tokens change hands (velocity). Common velocity sinks include staking rewards (earning interest for locking tokens), governance rights (needing to hold tokens to vote on protocol changes), usage discounts (getting lower fees when holding tokens), and buy-and-burn programs (where the protocol uses revenue to purchase and destroy tokens). By reducing velocity, these mechanisms support token value according to the equation of exchange: if V (velocity) goes down and other factors stay constant, token price goes up.",
      "example": "Binance's BNB token acts as a velocity sink: holding BNB gives you a 25% discount on trading fees. This encourages traders to buy and hold BNB rather than selling it immediately, reducing its velocity and supporting its price."
    },
    {
      "id": "volatility",
      "term": "Volatility",
      "definition": "Degree of price fluctuation; high volatility means rapid changes.",
      "lessons": [
        "L01"
      ],
      "category": "Foundations",
      "detailed": "Volatility measures the degree and frequency of price fluctuations in an asset. High volatility means prices change rapidly and unpredictably over short periods, swinging dramatically up and down. Low volatility means prices remain relatively stable with gradual changes. Volatility represents risk and uncertainty—high volatility assets can generate large gains or losses quickly, making them unsuitable for transactions or savings where predictable value is needed. Financial stability typically requires low volatility. Volatility is often measured statistically as the standard deviation (a measure of spread) of price returns over a period.",
      "example": "Bitcoin experienced extreme volatility in 2021, ranging from 29,000 USD to 69,000 USD within months—a 138% swing. The US dollar versus euro showed low volatility, fluctuating only between 1.13 and 1.23 USD per EUR—less than 9%. This makes Bitcoin unsuitable for pricing your salary or a mortgage, but USD/EUR pairs work fine."
    },
    {
      "id": "welfare",
      "term": "Welfare",
      "definition": "Total societal well-being; measures efficiency plus fairness.",
      "lessons": [
        "L01"
      ],
      "category": "Foundations",
      "detailed": "Welfare in economics refers to the total well-being or benefit that society derives from economic activities, goods, and services. It encompasses both efficiency (maximizing total value created, measured as consumer surplus plus producer surplus) and equity (fairness in how benefits are distributed across people). Economists analyze how policies, regulations, and market structures affect welfare—whether they increase overall social benefit or create deadweight losses (value destroyed). Welfare analysis helps determine if an innovation or intervention makes society better off, considering not just who gains but also who loses and by how much.",
      "example": "Introducing a payment system with lower fees increases consumer welfare (buyers save money) and producer welfare (sellers receive more). But if the system excludes elderly people who lack smartphones, total welfare might decrease if their lost access outweighs others' gains. Policymakers must weigh total benefit against distribution of who benefits."
    },
    {
      "id": "wholesale-cbdc",
      "term": "Wholesale CBDC",
      "definition": "CBDC restricted to financial institutions for interbank settlements.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "A wholesale CBDC is a central bank digital currency restricted to financial institutions -- primarily commercial banks -- for use in large-value interbank settlements and securities transactions. Unlike retail CBDC (which ordinary people use), wholesale CBDC is not available to the general public. It upgrades the existing system where banks settle payments through reserve accounts at the central bank, potentially enabling faster settlement, 24/7 operations, and programmable money (automated transactions triggered by conditions). Wholesale CBDC is considered less disruptive than retail CBDC because it improves existing infrastructure rather than creating a new relationship between citizens and the central bank.",
      "example": "In Project Helvetia, the Swiss National Bank tested a wholesale CBDC on a blockchain platform. Banks could settle securities trades worth millions of Swiss francs in seconds rather than the current two-day cycle, while the central bank maintained full oversight of the process."
    },
    {
      "id": "wholesale-funding",
      "term": "Wholesale Funding",
      "definition": "Money banks borrow from other financial institutions (rather than customer deposits) to fund operations.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "Wholesale funding is money that banks borrow from other financial institutions -- such as other banks, pension funds, or money market funds -- rather than from ordinary customer deposits. Banks use wholesale funding to fill gaps when customer deposits alone are not enough to cover their lending activities. This type of funding is typically short-term and must be regularly renewed (rolled over). Wholesale funding is relevant to CBDC because if customer deposits migrate to CBDC, banks would need to rely more heavily on wholesale funding, which is generally more expensive and less stable than deposits. During financial crises, wholesale funding can dry up suddenly as institutional lenders become risk-averse.",
      "example": "A bank has EUR 80 billion in customer deposits and EUR 20 billion in wholesale funding from other banks to support EUR 90 billion in loans. If CBDC adoption causes EUR 15 billion in deposits to leave, the bank must replace that with more wholesale funding -- which might cost 1-2% more in interest and can vanish during a crisis."
    },
    {
      "id": "winner-take-all",
      "term": "Winner-Take-All",
      "definition": "Market dynamic where network effects lead to one dominant platform capturing most market share.",
      "lessons": [
        "L05"
      ],
      "category": "Platform Economics",
      "detailed": "Winner-take-all describes a market dynamic where strong network effects cause one dominant platform to capture the vast majority of users and value, leaving little room for competitors. Once a platform reaches critical mass (the minimum user base for self-sustaining growth), network effects accelerate its advantage: more users attract more users, developers build for the largest audience, and switching costs lock everyone in. The result is that the market tips toward a single winner, and second-place competitors struggle to survive even with comparable or superior technology. This pattern is especially common in payment systems, social networks, and blockchain platforms where interoperability between competing networks is limited.",
      "example": "Google controls roughly 90% of the global search market. In social media, Facebook grew so dominant that Google+, despite Google's vast resources, shut down after failing to reach critical mass. In crypto, Ethereum hosts over 60% of all DeFi activity."
    },
    {
      "id": "wrapped-assets",
      "term": "Wrapped Assets",
      "definition": "Tokenized versions of assets from one blockchain that can be used on another blockchain.",
      "lessons": [
        "L08"
      ],
      "category": "Synthesis",
      "detailed": "Wrapped assets are tokenized representations of assets from one blockchain that have been locked or deposited and then reissued on a different blockchain, enabling those assets to be used in ecosystems where they otherwise wouldn't be compatible. The original asset is held by a custodian (trusted third party) or locked in a smart contract, and an equivalent token is minted on the target blockchain. Wrapped assets solve interoperability problems by letting users access cross-chain liquidity without selling their holdings. However, they introduce trust assumptions and centralization risks—you must believe the custodian actually holds the underlying assets and will redeem them on demand.",
      "example": "Wrapped Bitcoin (WBTC) lets Bitcoin holders use Ethereum DeFi applications. You deposit real Bitcoin with a custodian like BitGo, who mints an equivalent amount of WBTC (an Ethereum token) that you can use on decentralized exchanges like Uniswap or lend on Aave. When you want your Bitcoin back, you return the WBTC and BitGo releases your original Bitcoin. This is like exchanging dollars for casino chips—you can now play all the casino games, but you're trusting the casino to redeem chips for dollars later."
    },
    {
      "id": "zero-knowledge-proofs",
      "term": "Zero-Knowledge Proofs",
      "definition": "Cryptography that proves you meet a requirement without revealing your data---like proving you're over 18 without showing your birthdate.",
      "lessons": [
        "L03"
      ],
      "category": "CBDC",
      "detailed": "Zero-knowledge proofs are a cryptographic technique (a method using mathematical codes) that allows one person to prove a fact to another without revealing the underlying data. The concept is like proving you know a secret password without ever saying the password out loud. In CBDC design, zero-knowledge proofs could let the system verify that a transaction is legitimate -- for example, that the sender has enough funds and is not on a sanctions list -- without revealing the sender's identity or account balance to anyone. This technology offers a potential solution to the tension between user privacy and regulatory compliance that is central to CBDC policy debates.",
      "example": "When paying with a digital euro, a zero-knowledge proof could let the system verify you are over 18 and not on a terrorist watchlist without revealing your name, age, or address to the merchant or anyone else in the transaction chain. You prove compliance without sacrificing privacy."
    }
  ]
}